{
  "content": "arXiv:0912.3607v2 [cond-mat.mes-hall] 7 Apr 2010Diﬀusive versus local spin currents in dynamic spin pumping systems Akihito Takeuchi,∗Kazuhiro Hosono, and Gen Tatara Department of Physics, Tokyo Metropolitan University, Hac hioji, Tokyo 192-0397, Japan (Dated: September 17, 2018) Abstract Using microscopic theory, we investigate the properties of a spin current driven by magnetization dynamics. In the limit of smooth magnetization texture, the dominant spin current induced by the spin pumping eﬀect is shown to be the diﬀusive spin current, i.e., the one arising from only a diﬀusion associated with spin accumulation. That is to say, t here is no eﬀective ﬁeld that locally drives the spin current. We also investigate the conversion mechanism of the pumped spin current into a charge current by spin-orbit interactions, speciﬁca lly the inverse spin Hall eﬀect. We show that the spin-charge conversion does not always occur and th at it depends strongly on the type of spin-orbit interaction. In a Rashba spin-orbit system, t he local part of the charge current is proportional to the spin relaxation torque, and the local sp in current, which does not arise from the spin accumulation, does not play any role in the conversi on. In contrast, the diﬀusive spin current contributes to the diﬀusive charge current. Alterna tively, for spin-orbit interactions arising from random impurities, the local charge current is proport ional to the local spin current that constitutes only a small fraction of the total spin current. Clearly, the dominant spin current (diﬀusive spin current) is not converted into a charge curren t. Therefore, the nature of the spin current is fundamentally diﬀerent depending on its origin an d thus the spin transport and the spin-charge conversion behavior need to be discussed toget her along with spin current generation. 1\nI. INTRODUCTION Spintronics1,2is a novel technology that enables control of both charge and spin of elec- trons. To accomplish this aim, establishing methods for generation a nd observation of spin currents is an urgent issue. For generation in nonmagnetic conduc tors, several methods have been proposed. The standard way is to use the spin pumping eﬀect in ferromagnetic-normal metal junctions.3–7In those systems, a spin current can be induced by the precession of the magnetization caused by an external alternating ﬁeld and is then pu mped into the normal metal. This spin pumping eﬀect is widely used in experiments. A second t echnique is non- local spin injection in ferromagnetic-normal metal junctions.8,9In this case, a spin-polarized current is induced in a ferromagnet by applying an electric ﬁeld. The s pin-polarized current results in a spin imbalance at the interface that gives rise to a diﬀusive ﬂow of spin without a charge current in the normal metal. A third technique is to use the spin Hall eﬀect,10–15 where the spin current ﬂows in a transverse direction to an applied e lectric voltage in the presence of a spin-orbit interaction. Very recently, the spin Seeb eck eﬀect was discovered enabling a generation of a spin current from thermal gradients in fe rromagnets.16Thus, spin current generation can be realized by several mechanisms using va rious magnetic, electric, thermoelectric, and quantum relativistic (spin-orbit) eﬀects. In contrast, direct measurement of spin currents is still an open is sue. Spin current detection has so far been performed by measuring subsidiary obse rvables that arise from spin currents. The ﬁrst such observation was accomplished by Kat oet al.14by measuring optically the spin accumulation that appears as a result of spin curre nts at the edges of samples (GaAs and InGaAs) in spin Hall systems. The critical issue, h owever, is that spin currents are not conserved. Therefore, spin accumulation a nd spin currents are not in direct correspondence, in sharp contrast to charge currents that are conserved. The inversespinHalleﬀectwasproposedasamethodformeasuringspin currentselectrically.17–19 The idea is based on the argument that spin currents ﬂowing in the pr esence of spin-orbit interactions induce an electric voltage through the inverse proces s associated with the spin Hall eﬀect.17,20,21(The electric detection of spin transport was ﬁrst demonstrated at the interface between ferromagnetic and paramagnetic metals by Joh nson and Silsbee.8) Being electric, the inverse spin Hall eﬀect has been widely utilized to detect spin currents.16,22–24 Theoreticaljustiﬁcationfortheinverse spinHalleﬀecthasbeenc arriedoutonvarioussys- 2\ntems.20,21,25–31Takahashi and Maekawa20,21investigated the inverse spin Hall eﬀect because of nonlocal spin injection in ferromagnetic-nonmagnetic metal jun ctions, and demonstrated phenomenologically the relationship between charge current ( jc) and spin current ( js), i.e., jc∝σ×js, whereσis the spin polarization direction. Generation of the charge current by magnetization dynamics in magnetic junctions was studied phenom enologically by Wang et al.25and Xiao et al.26By using microscopic theory, the direct connection between spin currents pumped by magnetization dynamics and induced charge cu rrents was revealed in disordered metallic systems27,28and in disordered Rashba systems.29–31The result for metal- lic systems followed phenomenological predictions, jc∝σ×js, whereas pumped charge cur- rents in Rashba systems deviated from this simple relation. The naive picture that all spin currents are converted into charge currents is, therefore, inc orrect. What has been missing in this picture is the distinction between spin currents induced by som e eﬀective ﬁeld and those arising from spin accumulation diﬀusion. The ﬁrst one, local sp in current, is a contri- bution proportional to a local value of the magnetization texture. The other contribution is a diﬀusive spin current which contains a long-range diﬀusion factor. As we will show below, this diﬀerence is crucial in discussing the inverse spin Hall eﬀect but c an not be addressed by phenomenological schemes. For applications, these two spin curre nts need to be considered separately since the direction of the local (ﬁeld-driven) spin curre nt is controlled by the ﬁeld, while there is no way to control the direction of the diﬀusive spin curr ent. The ﬁrst aim of the present paper is to study these spin currents a rising from magnetiza- tion dynamics (spin pumping eﬀect) in the absence of spin-orbit inter actions by providing a fully quantum-mechanical treatment of the conduction electrons . (We note that spin-orbit interactions are not essential in discussing the spin pumping eﬀect.) Generation of spin cur- rents because of a precessing magnetization was ﬁrst studied by S ilsbeeet al.3They showed that this precession generates an accumulation of spin at the inter face between ferromag- netic and nonmagnetic domains and that the spin diﬀusion, i.e., spin cur rent, arises from this spin accumulation. Tserkovnyak et al.4argued that the pumped spin current can be expressed in the form js=a˙S+bS×˙S, introducing phenomenological parameters aandb (aandbare proportional to their mixing conductances and Sdenotes the magnetization di- rection). They assumed that the spin-ﬂip relaxation rate is suﬃcien tly larger than their spin injection rate and the spin accumulation does not build up at the inter face. Therefore, their pumping mechanism is diﬀerent from that of Silsbee et al.Later, Brataas et al.considered 3\nthe eﬀect of a back ﬂow arising from the spin accumulation at the inte rface.5There have been, therefore, predicted two types of spin currents: one aris ing from a nonlocal diﬀusion of the spin accumulation and the other a local contribution driven by an eﬀective ﬁeld. We show in the present paper that the diﬀusive spin current originating from spin accumulation dominates in the case of the slow-varying magnetization (disordere d system). This result is in agreement with the prediction by Silsbee et al.3The scenario of the spin pumping eﬀect without spin accumulation by Tserkovnyak et al.4does not hold in the present situation, but it may apply to cases where rapid-varying magnetization occurs at the interface of a ferromagnetic-normal metal junctions. The second aim of the present paper is to clarify the spin-charge co nversion mechanism based on microscopic theory and derive its conversion formula. By c alculating a spin current in the absence of spin-orbit interactions and a charge current with spin-orbit interactions (treated as linear-order perturbation), we will reveal the spin-t o-charge current conversion phenomena via the spin-orbit interaction. We will demonstrate that this conversion mecha- nismdiﬀersdepending onthetypeofspin-orbitinteraction, smooth nessofthemagnetization proﬁle, and the disorder (electron mean free path). In particular , the origin of spin currents, namely, whether spin currents are generated by eﬀective ﬁelds or arise from spin accumula- tion, turns out to be crucially important for spin-charge conversio n eﬃciency. Depending on the spin-orbit interaction causing the conversion, we consider two cases: Rashba spin-orbit interactions and spin-orbit interaction originating from random impu rity scattering in met- als. In the former, the dominant spin current is converted into a ch arge current. In contrast, in the latter, the correlation between the dominant spin current an d pumped charge currents is very weak. Instead, the local spin current (a small fraction of t he pumped spin current) is converted. Identifying the origin of spin currents is, therefore , crucial for realizing high conversion eﬃciency. II. SPIN PUMPING EFFECT A. Model Weconsider adisorderedelectronsystem coupledwithlocalizedspin S(x,t)(Fig.1). The localized spin can have spatial and temporal dependences, but we c onsider only the slowly 4\nFIG. 1: (Color online) Schematic illustration of spin curre nt generation. The localized spin Sis assumed to be slowly varying in space (compared to the elec tron mean-free path) and time (compared to the electron lifetime). Precession of the loca lized spin Sin the ferromagnet generates a ﬂow of the spin in the contiguous normal metal. varying case [namely, that the spatial correlation length is larger th an the electron mean free path (see below)]. The total Hamiltonian of the system is given a sH(t) =H0+Hex(t), where H0=∑ kεkc† kck+ui V∑ n∑ k,peip·rnc† k−pck, Hex(t) =−J∑ k,q( c† k−qˆσck) ·Sq(t).(1) The ﬁrst term H0describes free electrons in the presence of spin-independent impu rity scatterers and Hexrepresents the exchange interaction between the conducting ele ctron and the local spin. We have introduced in momentum space annihilation (cr eation) operators c(†) kfor conduction electrons with kinetic energy εk≡/planckover2pi12k2/2m, whileuiis the strength of the impurity scatterers, Vis the system volume, rnrepresents the position of the nth impurity,Jis the exchange coupling constant, ˆσcharacterizes a vector of Pauli matrices, the caret signiﬁes a matrix, and Sqdenotes the Fourier transform of the localized spin (or magnetization). We note that impurity scattering gives rise to an ela stic electron lifetime τ. Let us stress that spin-orbit interactions are not considered in t his section, since it is not essential to spin current generation and to spin-charge convers ion. The electron-spin density is deﬁned as ρα s(x,t)≡(/planckover2pi1/2)tr/angbracketleftbig ψ†(x,t)ˆσαψ(x,t)/angbracketrightbig H, where 5\nFIG. 2: Diagrammatic representations of the spin current de nsityjs. Diagram (a) describes ﬁrst- order contributions in Jand (b) second-order contributions. The wavy lines denote t he interaction with the local spin Sand the gray shaded region represents the vertex correction from impurity scatterers. ψ(†)(x) is the Fourier transform of c(†) k, tr denotes the trace over spin indices, and ∝angb∇acketleft···∝angb∇acket∇ightH represents the expectation value estimated for the total Hamilto nianH. The spin current density is deﬁned (without spin-orbit interaction) as jα s(x,t) =−i/planckover2pi13 2mV∑ k,qe−iq·xtr/bracketleftBig kˆσαˆG< k−q 2,k+q 2(t,t)/bracketrightBig , (2) where the spin current jα sihas two direction components, one associated with the ﬂow of spin in direction iand the other associated with a spin polarization in direction α. Here we used the lesser component of the path-ordered Green’s function deﬁned asG< kα,k′α′(t,t′)≡ (i//planckover2pi1)/angbracketleftbig c† k′α′(t′)ckα(t)/angbracketrightbig H. B. Pumped spin current We carry out the calculation in a weak exchange coupling regime, J≪/planckover2pi1/τ. This assumption would be satisﬁed in a junction of normal metal and a fer romagnet, as shown in Fig. 1, since the interface is usually disordered.32The Feynman diagrams contributing to the spin current at ﬁrst and second orders in the exchange coupling Jare shown in Fig. 2. We assume a spatially smooth magnetization structure qℓ≪1, whereqis the momentum of the magnetization and ℓdenotes the mean free path for conduction electrons, and assum e a slow precession of magnetization Ω τ≪1, where Ω is a frequency of magnetization dynamics. Contributions from Fig. 2(a) reads j(1)α s(x,t) =−2/planckover2pi13J 3mV∑ k,k′,q∑ ω,Ωe−iq·x+iΩtSα q,ΩqΩf′ ω/bracketleftBig Imεkgr k,ω(ga k,ω)2/bracketrightBig(g 1+niu2 i VΠra q;ω,Ωgr k′,ωga k′,ω)g . (3) 6\nHereniis the impurity concentration, fω=θ(εF−/planckover2pi1ω) denotes the Fermi distribution function at zero temperature [ θ(ω) is the step function and εFis the Fermi energy], ga(gr) denotes the advanced (retarded) free Green’s function given by ga k,ω= (gr k,ω)∗=/bracketleftbig /planckover2pi1ω−εk− (i/planckover2pi1/2τ)/bracketrightbig−1, and Πradescribes the diﬀusion ladder deﬁning the vertex correction, Πra q;ω,Ω≡∞∑ n=0(g∑ kniu2 i Vgr k−q 2,ω−Ω 2ga k+q 2,ω+Ω 2)gn . (4) The dominant ﬁrst-order contribution to the spin current is calcula ted as j(1)α s(x,t) =/planckover2pi1νJτD V∇/angbracketleftbig˙Sα(x,t)/angbracketrightbig , (5) whereνdenotes the density of states, D denotes a diﬀusion coeﬃcient give n as 2εFτ/3m, and∝angb∇acketleft···∝angb∇acket∇ightdescribes long-range diﬀusion because of random impurity scatter ing /angbracketleftbig A(x,t)/angbracketrightbig ≡1 V∫display d3x′∫display dt′∑ q∑ Ωe−iq·(x−x′)+iΩ(t−t′)A(x′,t′) Dq2τ+iΩτ, (6) whereA(x,t) is an arbitrary function of both xandt. (We show details of the calculations in Appendix A.) Similarly, we obtain second-order contributions in J[Fig. 2(b)] as j(2) s= jp(2) s+jsc(2) s, where the dynamic component (pumped spin current) jp(2) sis given by jp(2)α s(x,t) =−4/planckover2pi12J2τ 3mV∑ k,k′,q,q′∑ ω,Ω,Ω′e−iq·x+iΩt( Sq′,Ω′×Sq−q′,Ω−Ω′)αΩ′f′ ω ×/bracketleftBig Imεkgr k,ω(ga k,ω)2/bracketrightBig/bracketleftbigg (q+q′)+niu2 iq VΠra q;ω,Ωgr k′,ωga k′,ω/bracketrightbigg ≃−2νJ2τ2D V∇/angbracketleftbig/bracketleftbig S(x,t)×˙S(x,t)/bracketrightbigα/angbracketrightbig , (7) and the equilibrium component (spin super-current) jsc(2) sis given by jsc(2)α s(x,t) =i/planckover2pi12J2 3mV∑ k,q,q′∑ ω,Ω,Ω′e−iq·x+iΩt( Sq′,Ω′×Sq−q′,Ω−Ω′)αq′f′ ωIm(ga k,ω)2 ≃−/planckover2pi12νJ2 12mεFV/bracketleftbig S(x,t)×∇S(x,t)/bracketrightbigα. (8) This equilibrium ﬂow is a spin super-current and arises from the angula r diﬀerence between two localized spins (or magnetizations) S1×S2, i.e., from the spin Josephson eﬀect.33In Eqs. (5) and (7), the dynamic component without vertex correct ion does not contribute because it is smaller than that with vertex correction by 1 order of m agnitude (qℓ)2≪1. 7\nAs a result, the pumped spin current for a smooth-varying magnet ization texture is a long- range diﬀusive ﬂow (Eqs. (5) and (7)). From Eqs. (5) and (7), the pumped spin current, j(p) s≡j(1) s+jp(2) s, can be written as a gradient of an eﬀective potential µs, j(p)α s(x,t) =−∇µα s(x,t), (9) where µα s(x,t)≡ −/planckover2pi1νJτD V/angbracketleftbig˙Sα(x,t)/angbracketrightbig +2νJ2τ2D V/angbracketleftbig/bracketleftbig S(x,t)×˙S(x,t)/bracketrightbigα/angbracketrightbig (10) This eﬀective spin potential arises from dissipations of magnetizatio n energy S×˙Sand˙S. Our result, Eqs. (9) and (10), indicates that the sources of the s pin current are ˙SandS×˙S and this result appears to agree with phenomenological predictions for the spin pumping eﬀect.4However, the spin current here has been diﬀusion-averaged and is not simply a local function of the source. Similarly, spin density is given by ρα s(x,t) =−/planckover2pi1νJτD V∇2/angbracketleftbig Sα(x,t)/angbracketrightbig +2νJ2τ2 V/angbracketleftbig/bracketleftbig S(x,t)×˙S(x,t)/bracketrightbigα/angbracketrightbig . (11) It satisﬁes the spin diﬀusion equation: ˙ρα s(x,t)−D∇2ρα s(x,t) =τα ρ(x,t), (12) whereτρrepresents the spin relaxation given as τα ρ(x,t)≡ −/planckover2pi1νJD V∇2Sα(x,t)+2νJ2τ V/bracketleftbig S(x,t)×˙S(x,t)/bracketrightbigα. (13) The eﬀective spin potential is written as µα s(x,t) = Dρα s(x,t)−/planckover2pi1νJD VSα(x,t). (14) Speciﬁcally, it is the spin density excluding the direct spin polarization b ecause of the ex- change interaction, ρs−(/planckover2pi1νJ/V)S, multiplied by D. Therefore, the total spin current is reducible to jα s(x,t) =jsc(2)α s(x,t)+j(p)α s(x,t) =−/planckover2pi12νJ2 12mεFV/bracketleftbig S(x,t)×∇S(x,t)/bracketrightbigα−∇µα s(x,t). (15) 8\nThe last term, a diﬀusive contribution, can be written in terms of the spin density by using Eq. (14) and we ﬁnally obtain jα s(x,t) =j(sc)α s(x,t)−D∇ρα s(x,t), (16) where we have deﬁned the total equilibrium spin current as j(sc)α s(x,t) =/planckover2pi1νJD V∇Sα(x,t)−/planckover2pi12νJ2 12mεFV/bracketleftbig S(x,t)×∇S(x,t)/bracketrightbigα. (17) As seen in Eq. (16), the dominant contribution of the dynamic spin cu rrent derives com- pletely fromadiﬀusion ofthespin polarization. Equations (16)and(1 7)arethemainresults describing the spin pumping phenomena. For a charge current jc, it is described generally as jc(x,t) =σcE(x,t)+jsc(x,t)−D∇ρc(x,t), (18) whereσcis an electrical conductivity, Erepresents an electric ﬁeld, jscis a super-current which exists in an equilibrium situation (corresponding to j(sc) sof the spin current), and ρc denotes a charge density. Comparing the two expressions, Eqs. ( 16) and (18), we imme- diately see a striking diﬀerence between the charge and the spin, na mely, there is no ﬁeld that induces a spin current at least in the present perturbative re gime without spin-orbit interactions. In other words, the spin pumping eﬀect does not dire ctly generate the spin current itself, but causes a spin imbalance or spin accumulation that then gives rise to a diﬀusive spin current. This result is in agreement with the study by Sils beeet al.,3while the prediction by Tserkovnyak et al.,4stating that spin pumping is not associated with spin accumulation, does not hold in the smooth spin case. The diﬀusive spin current represented by the vertex correction found here would correspond to the phe nomenologically discussed back-ﬂow because of spin accumulation at the interface.5 Absence of aneﬀective ﬁeld for the spin current is crucial in spintro nics. In fact, in charge electronics, the charge and its current are independently contro llable and can be measured by diﬀerent mechanisms, for instance, by capacitance means for c harges and Amp` ere’s law for currents. This is not the case in spin transport phenomena. If we use the spin pumping mechanism in a disordered system, the spin current is always accomp anied by spin accumu- lation according to Eq. (16). 9\nFortunately, we know that there is an eﬀective ﬁeld for a spin curre nt if we use spin-orbit interactions, speciﬁcally, as in the spin Hall system. By including spin- orbit interactions, the spin current is generalizable to jα si(x,t) =σSHǫijαEj(x,t)+j(sc)α si(x,t)−D∇iρα s(x,t), (19) whereσSHrepresents the spin Hall conductivity proportional to the spin-or bit interaction andǫijαdenotes the Levi-Civita antisymmetric tensor. Therefore, charg e and spin currents, Eqs. (18) and (19), now look symmetric. However, there appears a crucial diﬀerence when one includes spin-orbit interactions, namely, the violation of the con servation law for spin. In fact, spin and its current in the presence of spin-orbit interact ions satisfy the identity ˙ρα s(x,t)+∇·jα s(x,t) =Tα s(x,t), (20) whereTsrepresents the spin-relaxation torque arising from the spin-orbit interaction.34 (This equation is equivalent to the diﬀusion equation for the spin dens ity.35–37) The non- conservation of spin causes deﬁnitional ambiguity of a spin current . Since a deﬁnition of spin current is absolutely related to a deﬁnition of spin relaxation torque , spin currents cannot be deﬁned uniquely under the spin-orbit interaction. (As a possible solu tion, a gauge covariant derivative was proposed.38) Because of the spin relaxation torque Ts, the measurement of the spin current can never be carried out by simply measuring the sp in density induced at the edge since the induced spin current can disappear because of t he term Tswhile being transported. (In this sense, the observation of the spin Hall eﬀe ct in Ref. 14 cannot be con- sidered as a direct observation of the spin current.) At present, t here has been no indication of an emission of an observable ﬁeld (either electric or magnetic) fro m the spin current and, therefore, incontrast to charge currents which are observable by detecting anAmp` ere’s ﬁeld, electromagnetic detection of spin currents is not possible. [The abs ence of electromagnetic ﬁelds induced by spin currents is reasonable from Maxwell’s equations because the equations as determined by special relativity and U(1) gauge invariance canno t be modiﬁed by the spin current.] Here a serious dilemma for spintronics arises. Speciﬁc ally, spin currents and spin densities are independently controllable only if one switches on sp in-orbit interactions, but such interactions make it impossible to detect the spin current b y measuring the spin accumulation. 10\nFIG. 3: (Color online) Relationship between pumped spin cur rent and interface condition in a ferromagnetic-normal metal junction. (a) The diﬀusive spi n current is dominant where the magnetization structure Svaries slowly as compared to the electron mean free path ℓin normal metal. (b) The local spin current is dominant where the magne tization structure varies rapidly at the interface. C. Diﬀusive spin current vs. local spin current In the spin pumping eﬀect, we have demonstrated that the diﬀusive spin current is dom- inant in a slow-varying magnetization structure, subject to ℓ≪λ(ℓis the electron mean free path and λrepresents the length scale of the magnetization structure) as d epicted in Fig. 3(a). In an actual spin pumping system, this condition would be s atisﬁed since the mean-free path in such experimental systems is known to be very s hort, for example, less than 1 nm size in Ni 81Fe19/Pt sample.32Strictly speaking, a local spin current can also exist but this contribution is negligibly small compared with the diﬀusive spin c urrent. There- fore, in this situation, it is impossible that local and nonlocal spin curr ents coexist, as found in a study by Brataas et al.5The situation can be diﬀerent with a clean sample or very sharp magnetization proﬁle, subject to ℓ≫λ, as shown in Fig. 3(b). In this case, the local spin current without spin accumulation could become dominant a nd the diﬀusive spin current arising from spin accumulation is small. We therefore expect that the mechanism of Tserkovnayk et al.without spin accumulation may be valid. The spin current induced by the spin pumping eﬀect, therefore, depends much on the disorder or the electron mean-free path. In this section, we did not take into account spin-orbit interactions . It is essential when 11\nwe need to discuss spin-charge conversions, which we do in the follow ing section. III. SPIN-CHARGE CONVERSION We now consider the conversion mechanism of the pumped spin curre nt into the charge current through the inverse spin Hall eﬀect. In this section, we co nsider two types of spin- orbit interactions, the Rashba type and such interactions becaus e of random impurity scat- tering, and we ﬁnally obtain the exact spin-charge conversion form ula. A. Rashba spin-orbit interaction systems We ﬁrst consider charge currents driven by Rashba spin-orbit inte ractions. The Rashba spin-orbit coupling was ﬁrst found as a peculiar eﬀect in a two-dimens ional electron-gas sys- tem.39However recent studies have revealed that the Rashba system ap pears quite generally at surfaces of nonmagnetic materials without inversion symmetry a nd that this Rashba coupling can be quite large.40–43Therefore, there is a possibility that these surface eﬀects contribute greatly to the inverse spin Hall eﬀect in ferromagnetic- normal metal junction systems. The microscopic theory in the presence of Rashba spin-orbit intera ctions was demon- strated by Ohe et al.29They considered a two-dimensional electron-gas system, where t he maximum number of diﬀusion ladder needs to be taken into account. T he result was ex- tended to a three-dimensional and spatially dependent Rashba cou pling case.30However, the account payed little attention to the charge conservation law b ecause the analyses were intended only to see whether the spin-charge current conversion indeed occurs or not. In the following, we consider a three-dimensional system and evaluate the dominant contribution including one diﬀusion ladder as a vertex correction. By considering t he vertex correction, we maintain charge conservation throughout the calculation. The Rashba spin-orbit interaction is given by Hso=−∑ kEso·/bracketleftbig k×( c† kˆσck)/bracketrightbig , (21) whereEsodescribes thespin-orbit ﬁeld (or strength ofthe Rashba coupling) . In thepresence of this interaction, the anomalous velocity resulting from the spin-o rbit interaction modiﬁes 12\nFIG. 4: Dominant contributions to the pumped charge current by magnetization dynamics in a Rashba system: (a) is the normal charge current, jn c, and (b) describes corrections to the charge currentarisingfromtheRashbacoupling, jso c. DoublelinesrepresentRashbaspin-orbitinteractions (SOIs). The Rashba spin-orbit coupling gives the anomalous velocity to the conduction electrons, thereby modifying the deﬁnition of the charge current. the charge current. By deﬁning the charge density as ρc(x,t)≡ −etr/angbracketleftbig ψ†(x,t)ψ(x,t)/angbracketrightbig H, the charge current density is given by jc=jn c+jso c, where the normal charge current jn cis jn c(x,t) =ie/planckover2pi12 mV∑ k,qe−iq·xtr/bracketleftBig kˆG< k−q 2,k+q 2(t,t)/bracketrightBig , (22) and the correction from the Rashba coupling jso cis deﬁned as jso c(x,t) =ie V∑ k,qe−iq·xtr/bracketleftBig( Eso×ˆσ)ˆG< k−q 2,k+q 2(t,t)/bracketrightBig . (23) We treat the Rashba spin-orbit interaction perturbatively by impos ing the constraint EsokF≪/planckover2pi1/τ, withkFbeing theFermiwavelength. Forslow-varying magnetizationtextu res, the contribution from both the ﬁrst-order Rashba and the ﬁrst- order exchange interactions vanishes identically.29,30(Strictly speaking, a contribution proportional to ∇Eso∇˙Sarises if Rashba spin-orbit interactions are inhomogeneous.30) We now consider the charge current to ﬁrst order in the Rashba coupling and second order in the exchan ge coupling. In Fig. 4, we present the Feynman diagrams for the dominant contr ibution which is 13\ncalculated (see details in Appendix B) as jci(x,t) =ieJ2τ mV∑ k,k′,q,q′∑ ω,Ω,Ω′e−iq·x+iΩt/bracketleftBig Eso×( Sq′,Ω′×Sq−q′,Ω−Ω′)/bracketrightBig jΩ′f′ ωgr k,ωga k,ω ×/braceleftbigg −m /planckover2pi1δij+/planckover2pi1qiqj 3πν/bracketleftBig Imεk′gr k′,ω(ga k′,ω)2/bracketrightBig Πra q;ω,Ω/bracerightbigg ≃−4eνJ2τ2 /planckover2pi12V/braceleftBig Eso×/bracketleftbig S(x,t)×˙S(x,t)/bracketrightbig/bracerightBig i −4eνJ2τ3D /planckover2pi12V∇i/braceleftBig ∇·/angbracketleftbig Eso×/bracketleftbig S(x,t)×˙S(x,t)/bracketrightbig/angbracketrightbig/bracerightBig . (24) This pumped charge current is expressible in terms of the dynamic co mponent of the spin relaxation torque T(dy) sand the charge density31 jci(x,t) =ǫijαaR jT(dy)α s(x,t)−D∇iρc(x,t), (25) whereaR≡ −2eτEso//planckover2pi12and T(dy)α s(x,t) =2νJ2τ V/bracketleftbig S(x,t)×˙S(x,t)/bracketrightbigα, ρc(x,t) =2νJ2τ2 VaR·/angbracketleftbig ∇×/bracketleftbig S(x,t)×˙S(x,t)/bracketrightbig/angbracketrightbig .(26) We ﬁrst note that Eqs. (25) and (26) indicate that only the damping of the local spin, S×˙S, is converted into a charge current by Rashba coupling. The equilibr ium spin current, Eq. (17), does not contribute, as is reasonable from energy cons ervation considerations. Sincejcis expressible in terms of T(dy) sandρc, the naive formula for the inverse spin Hall eﬀect, i.e.jcproportional locally to js, does not hold in disordered Rashba systems. Instead, Eq. (25) indicates that the generation mechanism of the local char ge current in a Rashba system is the inverse eﬀect of the spin-relaxation torque. The non-local part in Eq. (25) arises from a diﬀusion of the charge d ensity, which is written in terms of the dynamic component of the pumped spin curre nt [Eq. (7)], ρc(x,t) =−1 DǫijαaR ijp(2)α sj(x,t). (27) Therefore, the (diﬀusive) spin current induces a charge polarizat ion via Rashba spin-orbit interactions, but not a charge current itself. Since diﬀusive spin cu rrents dominate in slow- varying magnetization structures, we expect that the ratio of th e charge current to the pumped spin current is high [see Fig. 5(a)]. 14\nFIG. 5: (Color online) Conversion mechanism of the pumpedsp in current into a charge current via spin-orbit interactions (SOIs). (a) In the Rashbasystem, t he diﬀusivespin current is just converted into a charge current. (b) With spin-orbit interactions cau sed by random impurity scattering, the diﬀusive spin current is present but not converted. Thelocal spin current is converted into a charge current. B. Random impurity-induced spin-orbit interaction systems We now focus on spin-orbit interactions caused by random impurities . This interaction is deﬁned as Hso=iuiλso V∑ n∑ k,peip·rn(k×p)·( c† k−pˆσck) , (28) whereλsois the spin-orbit strength. We have here assumed that the random impurity spin- orbit interaction arises from the same impurities giving rise to the elec tron lifetime τ. In this case, the correction current resulting from the spin-orbit int eraction is given by jso c(x,t) =−euiλso V2∑ n∑ k,q,pe−iq·xeip·rntr/bracketleftBig( p×ˆσ)ˆG< k−q−p 2,k+q−p 2(t,t)/bracketrightBig .(29) As shown in Ref. 28, the charge current is derived in the form jci(x,t) =aimpǫijαj(local)α sj(x,t)−D∇iρc(x,t), (30) whereaimp≡2eλsok2 F/εFτand j(local)α s(x,t) =/planckover2pi1νJτD V(g ∇˙Sα(x,t)−2Jτ /planckover2pi1/braceleftBig ∇/bracketleftbig S(x,t)×˙S(x,t)/bracketrightbigα+/bracketleftbig S(x,t)×∇˙S(x,t)/bracketrightbigα/bracerightBig)g , ρc(x,t) =2νJ2τ3Daimp Vǫijα/angbracketleftbig/bracketleftbig ∇iS(x,t)×∇j˙S(x,t)/bracketrightbigα/angbracketrightbig . (31) 15\nWe have here denoted the local spin current as j(local) s. Equation (30) seems consistent with the naive formula of the inverse spin Hall eﬀect, jc∝σ×js. However, one should note that this local spin current is a very small correction to the dominan t spin current [given by −D∇ρsin Eq. (16)]. Therefore, most of the spin currents generated by t he spin pumping eﬀect are not converted into a charge current; only a small fract ion [of order ( qℓ)2≪1] develops into a charge current [Fig 5(b)]. Thus, the spin-charge co nversion eﬃciency is small in the presence of random impurity-induced spin-orbit interac tions. C. Conversion mechanism By comparing Eqs. (25) and (30) to the general formulation of the charge current [Eq. (18)], the spin relaxation torque T(dy) sand the local spin current j(local) sact as eﬀective electric ﬁelds for Rashba and random impurity-induced spin-orbit int eractions, respectively. Therefore, as we mentioned above, the spin current changes only the constitutive relations associated with electromagnetic ﬁelds but does not change the Max well’s equations them- selves. Correctly, there is a spin current caused by spin-orbit inte ractions. This spin current, however, produces a second-order charge current with respec t to spin-orbit interactions at least. It should be negligible compared to the above results. From the above results, we see that spin accumulation at the interf ace plays a crucial role in determining spin pumping and spin-charge conversion mechanis ms. In fact, the pumped charge current is proportional to the spin accumulation wh en Rashba interactions are present, but does not occur with the spin accumulation for ran dom impurity-induced spin-orbit interactions. Therefore, measuring spin accumulation a t the interface would pro- vide impetus to determine the dominant spin-orbit interaction and to clarify the spin-charge conversion mechanism. IV. CONCLUSIONS We have studied aspects of spin pumping and the spin-charge conve rsion mechanism through spin-orbit interactions in the disordered electron system . We showed that the spin current generated by the spin dynamics is a diﬀusive process arising from a dynamics- induced spin accumulation. There is, therefore, no eﬀective ﬁeld th at drives the spin current 16\ndirectly in the disordered case. We have conﬁrmed that a charge cu rrent is induced by these spin-orbit interactions. This process involves the conversio n of a pumped spin current into a charge transport, but the mechanism has turned out not to be as simple as an earlier phenomenological proposal, jc∝(σ×js),17,20,21had anticipated. In fact, the spin- charge conversion depends largely on the type of spin-orbit intera ction. For Rashba spin- orbit interactions, the charge current is given by a local contribut ion proportional to the spin relaxation torque and a diﬀusive contribution arising from the diﬀ usive spin current. Therefore, the naive formula for the inverse spin Hall eﬀect does n ot hold in the Rashba systems. In contrast, for random impurity-induced spin-orbit int eractions, the local part of the charge current is written as a very small fraction of the spin current [smaller by O(ℓ2/λ2), whereℓandλare the electron mean-free path and the coherence length scale o f the magnetization, respectively]. However, the dominant spin curr ent is not converted into a charge current in the presence of impurities. Thus, the naive inve rse spin Hall eﬀect does not occur either. Our result indicates that the spin-charge conve rsion formula as proposed earlier using phenomenological arguments is too simple and the whole p henomenon needs discussing together with the origin of spin currents. Appendix A: details of calculations for the spin pumping eﬀect We perform here calculations of the pumped spin current using stan dard perturbation expansion techniques. We treat the exchange coupling up to the se cond order. The electron spin and its relaxation torque densities are deﬁned in terms of Green ’s function as ρα s(x,t) =−i/planckover2pi1 2V∑ k,qe−iq·xtr/bracketleftBig ˆσαˆG< k−q 2,k+q 2(t,t)/bracketrightBig , Tα s(x,t) =−i/planckover2pi1J V∑ k,qe−iq·xtr/braceleftBig/bracketleftbig ˆσ×S(x,t)/bracketrightbigαˆG< k−q 2,k+q 2(t,t)/bracerightBig ,(A1) respectively. Before carrying out the calculation, we introduce th e Dyson equation: Gkα,k′α′(t,t′) =δkk′δαα′gkα(t,t′) +ui V∫display CKdT∑ n∑ peip·rngkα(t,T)Gk+pα,k′α′(T,t′) −J∫display CKdT∑ β∑ qgkα(t,T)/bracketleftbig σαβ·Sq(T)/bracketrightbig Gk+qβ,k′α′(T,t′),(A2) 17\nFIG. 6: The lesser component of the Green’s function involvi ng the vertex correction can be divided into the three terms. The diagram is partitioned oﬀ b y deﬁning the diﬀusion ladder as the boundary. We denote contributions from the left-hand si de as Γ, the middle representing the diﬀusion ladder as Π, and the right-hand side as Λ. The spiral l ine represents all interactions and therefore the contribution from Λ depends on the interactio ns. whereGkα,k′α′(t,t′)≡ −(i//planckover2pi1)/angbracketleftbig TCK/bracketleftbig ckα(t)c† k′α′(t′)/bracketrightbig/angbracketrightbig H(TCKbeing the path-ordering operator deﬁned on the Keldysh contour C K) andgis the free Green’s function which is obtained from the free Hamiltonian H0. The Dyson equation is very useful in carrying out the per- turbation expansion because this equation can be solved iteratively . Here we assume a weak exchange coupling regime, J≪/planckover2pi1/τ, and therefore we can treat the exchange interaction perturbatively. To evaluate the lesser component of G(t,t′) =∫text CKdTG1(t,T)G2(T,t′), we use the following44 G<(t,t′) =∫display∞ −∞dT/bracketleftBig Gr 1(t,T)G< 2(T,t′)+G< 1(t,T)Ga 2(T,t′)/bracketrightBig , Ga(r)(t,t′) =∫display∞ −∞dT/bracketleftBig Ga(r) 1(t,T)Ga(r) 2(T,t′)+Ga(r) 1(t,T)Ga(r) 2(T,t′)/bracketrightBig .(A3) The lesser component of the free Green’s function satisﬁes g< k,ω=fω( ga k,ω−gr k,ω) . 18\n1. First-order calculations in J First, weshowthecalculationofthespincurrenttoﬁrst-orderint heexchangeinteraction. The diagram in Fig. 2(a) is written as j(1)α s(x,t) =i/planckover2pi13J 2mV∞∑ n=0(gniu2 i V)gn∑ qe−iq·x∑ {ki}n i=0tr/braceleftBigg k0ˆσα/bracketleftBiggn∏ i=0∫display Ci+1 Kdti+1ˆgki−q 2(ti,ti+1)/bracketrightBigg ×/bracketleftbig ˆσ·Sq(tn+1)/bracketrightbig/bracketleftBiggn∏ i=0∫display Cn+i+1 Kdtn+i+1ˆgkn−i+q 2(tn+i+1,tn+i+2)/bracketrightBigg/bracerightBigg< t0=t2n+2=t.(A4) By using tr( ˆσαˆσβ) = 2δαβand taking the lesser component, the equation reads j(1)α s(x,t) =i/planckover2pi13J mV∑ k,k′,q∑ ω,Ωe−iq·x+iΩtSα q,Ωk( Λaa(1) k,q;ω,Ω−Λrr(1) k,q;ω,Ω+Λra(1) k,q;ω,Ω +Γaa k,q;ω,ΩΠaa q;ω,ΩΛaa(1) k′,q;ω,Ω−Γrr k,q;ω,ΩΠrr q;ω,ΩΛrr(1) k′,q;ω,Ω+Γra k,q;ω,ΩΠra q;ω,ΩΛra(1) k′,q;ω,Ω) . (A5) A diagram involving the vertex correction is divided into three parts: the left-hand side, the diﬀusion ladder (middle), and the right-hand side of the diagram s hown in Fig. 6. The contribution from the left hand side is given as Γaa(rr) k,q;ω,Ω≡niu2 i Vga(r) k−q 2,ω−Ω 2ga(r) k+q 2,ω+Ω 2, Γra k,q;ω,Ω≡niu2 i Vgr k−q 2,ω−Ω 2ga k+q 2,ω+Ω 2.(A6) The diﬀusion ladder arising from the vertex correction is written as Πaa(rr) q;ω,Ω≡∞∑ n=0(g∑ kΓaa(rr) k,q;ω,Ω)gn , Πra q;ω,Ω≡∞∑ n=0(g∑ kΓra k,q;ω,Ω)gn .(A7) The contribution from the right-hand side of a diagram depends on t he diagram and in Fig. 2(a) is given by Λaa(rr)(1) k,q;ω,Ω≡fω−(+)Ω 2ga(r) k−q 2,ω−Ω 2ga(r) k+q 2,ω+Ω 2, Λra(1) k,q;ω,Ω≡( fω+Ω 2−fω−Ω 2) gr k−q 2,ω−Ω 2ga k+q 2,ω+Ω 2.(A8) 19\nAssuming slow dynamics Ω τ≪1 and a spatially smooth local spin structure qℓ≪1, we obtain the result j(1)α s(x,t)≃ −2/planckover2pi13J 3mV∑ k,k′,q∑ ω,Ωe−iq·x+iΩtSα q,ΩqΩf′ ω/bracketleftBig Imεkgr k,ω(ga k,ω)2/bracketrightBig(g 1+niu2 i VΠra q;ω,Ωgr k′,ωga k′,ω)g ≃/planckover2pi1νJτD V∇/angbracketleftbig˙Sα(x,t)/angbracketrightbig . (A9) Here we note simpliﬁcations in the ksummation ∑ kgr kga k≃2πντ /planckover2pi1, (A10) ∑ kεkgr k(ga k)2≃i2πνεFτ2 /planckover2pi12, (A11) where we have put gk≡gk,/planckover2pi1ω=εF. The diﬀusion ladder arising from the vertex correction is also given as Πaa(rr) q;0,Ω≃1, (A12) Πra q,0,Ω≃∞∑ n=0/braceleftBigg niu2 i V∑ k/bracketleftBigg ( 1−iτΩ) gr kga k−2/planckover2pi1τq2 3mImεkgr k(ga k)2/bracketrightBigg/bracerightBiggn ≃∑ n=0( 1−Dq2τ−iΩτ)n =1 Dq2τ+iΩτ. (A13) Since the product of only ga(orgr) gives a very small contribution which is of order 1 /εF compared to the coeﬃcient of gaandgr, the diﬀusion ladder reduces approximately to unity. We cannot, however, ignore the product of only ga(orgr) completely because that contribution corresponds to an equilibrium current. Similarly, the spin density is also calculated in the form ρ(1)α s(x,t) =i/planckover2pi12J V∑ k,q∑ ω,Ωe−iq·x+iΩtSα q,Ω( Λaa(1) k,q;ω,Ω−Λrr(1) k,q;ω,Ω+Πra q;ω,ΩΛra(1) k,q;ω,Ω) ≃i/planckover2pi12J V∑ k,q∑ ω,Ωeiq·x+iΩtSα q,Ωf′ ω(gi τ+ΩΠra q;ω,Ω)g gr k,ωga k,ω ≃ −/planckover2pi1νJτD V∇2/angbracketleftbig Sα(x,t)/angbracketrightbig . (A14) To ﬁrst order in the exchange coupling, the spin-relaxation torque corresponding to diagram Fig. 7(a) vanishes as a consequence of trˆ σα= 0. Therefore, the pumped spin current to ﬁrst 20\nFIG. 7: Diagrammatic representations of the spin-relaxati on torque of the conduction electrons. (a) This contribution comes from ﬁrst-order terms in Jbut vanishes. (b) The leading contribution arises from second-order exchange interaction terms. This contribution corresponds to local spin damping S×˙S. order inJfollows ˙ρ(1)α s(x,t)+∇·j(1)α s(x,t) = 0. (A15) Hence, the spin of conduction electrons is conserved. 2. Second-order calculations in J Here we derive the spin current to second order in the exchange co upling as shown in Fig. 2(b). This is calculated in the same manner as the ﬁrst-order ca lculations. The pumped spin current reads j(2)α s(x,t) =/planckover2pi13J2 mV∑ k,k′,q,q′∑ ω,Ω,Ω′e−iq·x+iΩt( Sq′,Ω′×Sq−q′,Ω−Ω′)αk( Λaa(2) k,q,q′;ω,Ω,Ω′ −Λrr(2) k,q,q′;ω,Ω,Ω′+Λra(2) k,q,q′;ω,Ω,Ω′+Γra k,q;ω,ΩΠra q;ω,ΩΛra(2) k′,q,q′;ω,Ω,Ω′) ≃/planckover2pi12J2 3mV∑ k,k′,q,q′∑ ω,Ω,Ω′e−iq·x+iΩt( Sq′,Ω′×Sq−q′,Ω−Ω′)αf′ ω/braceleftbigg iq′Im(ga k,ω)2 −4τΩ′/bracketleftBig Imεkgr k,ω(ga k,ω)2/bracketrightBig/bracketleftbigg (q+q′)+niu2 iq VΠra q;ω,Ωgr k′,ωga k′,ω/bracketrightbigg/bracerightbigg ≃−/planckover2pi12νJ2 12mεFV/bracketleftbig S(x,t)×∇S(x,t)/bracketrightbigα−2νJ2τ2D V∇/angbracketleftbig/bracketleftbig S(x,t)×˙S(x,t)/bracketrightbigα/angbracketrightbig .(A16) In this case, we should pay particular attention to tr( ˆσαˆσβˆσγ) =i2ǫαβγand the contribution from the right-hand side of the diagram being given as Λaa(rr)(2) k,q,q′;ω,Ω,Ω′≡fω−(+)Ω 2ga(r) k−q 2,ω−Ω 2ga(r) k−q−2q′ 2,ω−Ω−2Ω′ 2ga(r) k+q 2,ω+Ω 2, Λra(2) k,q.q′;ω,Ω,Ω′≡( fω−Ω−2Ω′ 2−fω−Ω 2) gr k−q 2,ω−Ω 2ga k−q−2q′ 2,ω−Ω−2Ω′ 2ga k+q 2,ω+Ω 2 +( fω+Ω 2−fω−Ω−2Ω′ 2) gr k−q 2,ω−Ω 2gr k−q−2q′ 2,ω−Ω−2Ω′ 2ga k+q 2,ω+Ω 2.(A17) 21\nThe pumped spin current contains an equilibrium ﬂow given by estimatin g (ga)2, ∑ k(ga k)2≃ −iπν 2εF. (A18) The spin density is calculated in a similar manner ρ(2)α s(x,t) =/planckover2pi12J2 V∑ k,q,q′∑ ω,Ω,Ω′e−iq·x+iΩt( Sq′,Ω′×Sq−q′,Ω−Ω′)α ×( Λaa(2) k,q,q′;ω,Ω,Ω′−Λrr(2) k,q,q′;ω,Ω,Ω′+Πra q;ω,ΩΛra(2) k,q,q′;ω,Ω,Ω′) ≃i2/planckover2pi1J2τ V∑ k,q,q′∑ ω,Ω,Ω′e−iq·x+iΩt( Sq′,Ω′×Sq−q′,Ω−Ω′)αΩ′f′ ωΠra q;ω,Ωgr k,ωga k,ω ≃2νJ2τ2 V/angbracketleftbig/bracketleftbig S(x,t)×˙S(x,t)/bracketrightbigα/angbracketrightbig . (A19) To second-order in the exchange coupling, the spin of conduction e lectrons is not conserved and follows the general spin continuity equation ˙ρ(2)α s(x,t)+∇·j(2)α s(x,t) =T(2)α s(x,t). (A20) Here the spin relaxation torque is represented by the diagram in Fig. 7(b) and we obtain T(2)α s(x,t) =−i2/planckover2pi1J2 V∑ k,q∑ ω,Ωe−iq·x+iΩt/bracketleftbig S(x,t)×Sq,Ω/bracketrightbigα( Λaa(1) k,q;ω,Ω−Λrr(1) k,q;ω,Ω+Λra(1) k,q;ω,Ω) ≃−i2/planckover2pi1J2 V∑ k,q∑ ω,Ωe−iq·x+iΩt/bracketleftbig S(x,t)×Sq,Ω/bracketrightbigαf′ ω/bracketleftbiggi/planckover2pi1q2 6mIm(ga k,ω)2+Ωgr k,ωga k,ω/bracketrightbigg ≃−/planckover2pi12νJ2 12mεFV/bracketleftbig S(x,t)×∇2S(x,t)/bracketrightbigα+2νJ2τ V/bracketleftbig S(x,t)×˙S(x,t)/bracketrightbigα.(A21) Appendix B: Magnetization-pumped charge current in a Rashba system Here, we calculate the charge current stemming from magnetizatio n pumping in the presence of Rashba spin-orbit interactions. In the Rashba syste m, the Dyson equation is modiﬁed as Gkα,k′α′(t,t′) =δkk′δαα′gkα(t,t′) +ui V∫display CKdT∑ n∑ peip·rngkα(t,T)Gk+pα,k′α′(T,t′) −J∫display CKdT∑ β∑ qgkα(t,T)/bracketleftbig σαβ·Sq(T)/bracketrightbig Gk+qβ,k′α′(T,t′). −∫display CKdT∑ β∑ qgkα(t,T)/bracketleftbig Eso·(k×σαβ)/bracketrightbig Gkβ,k′α′(T,t′).(B1) 22\nSince the spin-orbit interactions are generally weak, subject to EsokF≪/planckover2pi1/τ, we perform the perturbation expansion with respect to both the exchange int eraction and the Rashba spin-orbit interaction. By iteration, we obtain the leading contribut ion shown in Fig. 4, jci(x,t) =−2eJ2 V∑ k,k′,q,q′∑ ω,Ω,Ω′e−iq·x+iΩt/bracketleftBig Eso×( Sq′,Ω′×Sq−q′,Ω−Ω′)/bracketrightBig j ×/bracketleftbigg/planckover2pi12ki m( ˜Λaa(2) j;k,q,q′;ω,Ω,Ω′−˜Λrr(2) j;k,q,q′;ω,Ω,Ω′+˜Λra(2) j;k,q,q′;ω,Ω,Ω′+Γra k,q;ω,ΩΠra q;ω,Ω˜Λra(2) j;k′,q,q′;ω,Ω,Ω′) +δij( Λaa(2) k,q,q′;ω,Ω,Ω′−Λrr(2) k,q,q′;ω,Ω,Ω′+Λra(2) k,q,q′;ω,Ω,Ω′)/bracketrightbigg ≃ieJ2τ mV∑ k,k′,q,q′∑ ω,Ω,Ω′e−iq·x+iΩt/bracketleftBig Eso×( Sq′,Ω′×Sq−q′,Ω−Ω′)/bracketrightBig jΩ′f′ ωgr k,ωga k,ω ×/braceleftbigg −m /planckover2pi1δij+/planckover2pi1qiqj 3πν/bracketleftBig Imεk′gr k′,ω(ga k′,ω)2/bracketrightBig Πra q;ω,Ω/bracerightbigg ≃−4eνJ2τ2 /planckover2pi12V/braceleftBig Eso×/bracketleftbig S(x,t)×˙S(x,t)/bracketrightbig/bracerightBig i−4eνJ2τ3D /planckover2pi12V∇i/braceleftBig ∇·/angbracketleftbig Eso×/bracketleftbig S(x,t)×˙S(x,t)/bracketrightbig/angbracketrightbig/bracerightBig . (B2) Here we have deﬁned contributions from the right-hand side of the diagrams as ˜Λaa(rr)(2) i;k,q,q′;ω,Ω,Ω′≡fω−(+)Ω 2/bracketleftbiggm /planckover2pi12∂ ∂ki( ga(r) k−q 2,ω−Ω 2ga(r) k−q−2q′ 2,ω−Ω−2Ω′ 2ga(r) k+q 2,ω+Ω 2) −2(g k−q−2q′ 2)g iga(r) k−q 2,ω−Ω 2( ga(r) k−q−2q′ 2,ω−Ω−2Ω′ 2)2 ga(r) k+q 2,ω+Ω 2/bracketrightbigg , ˜Λra(2) i;k,q,q′;ω,Ω,Ω′≡( fω−Ω−2Ω′ 2−fω−Ω 2)/bracketleftbiggm /planckover2pi12∂ ∂ki( gr k−q 2,ω−Ω 2ga k−q−2q′ 2,ω−Ω−2Ω′ 2ga k+q 2,ω+Ω 2) −2(g k−q−2q′ 2)g igr k−q 2,ω−Ω 2( ga k−q−2q′ 2,ω−Ω−2Ω′ 2)2 ga k+q 2,ω+Ω 2/bracketrightbigg +( fω+Ω 2−fω−Ω−2Ω′ 2)/bracketleftbiggm /planckover2pi12∂ ∂ki( gr k−q 2,ω−Ω 2gr k−q−2q′ 2,ω−Ω−2Ω′ 2ga k+q 2,ω+Ω 2) −2(g k−q−2q′ 2)g igr k−q 2,ω−Ω 2( gr k−q−2q′ 2,ω−Ω−2Ω′ 2)2 ga k+q 2,ω+Ω 2/bracketrightbigg .(B3) The charge density is written in terms of the lesser component of th e nonequilibrium Green’s function ρc(x,t) =ie/planckover2pi1 V∑ k,qe−iq·xtrˆG< k−q 2,k+q 2(t,t). (B4) 23\nIn a similar manner to the charge current, the charge density is calc ulated as ρc(x,t) =−2e/planckover2pi1J2 V∑ k,q,q′∑ ω,Ω,Ω′e−iq·x+iΩt/bracketleftBig Eso×( Sq′,Ω′×Sq−q′,Ω−Ω′)/bracketrightBig i ×( ˜Λaa(2) i;k,q,q′;ω,Ω,Ω′−˜Λrr(2) i;k,q,q′;ω,Ω,Ω′+Πra q;ω,Ω˜Λra(2) i;k,q,q′;ω,Ω,Ω′) ≃4eJ2τ2 /planckover2pi1V∑ k,q,q′∑ ω,Ω,Ω′e−iq·x+iΩt/bracketleftBig Eso×( Sq′,Ω′×Sq−q′,Ω−Ω′)/bracketrightBig iqiΩ′f′ ωΠra q;ω,Ωgr k,ωga k,ω ≃4eνJ2τ3 /planckover2pi12V∇·/angbracketleftbig Eso×/bracketleftbig S(x,t)×˙S(x,t)/bracketrightbig/angbracketrightbig . (B5) The charge and its current densities that we have obtained satisfy the following charge conservation law: ˙ρc(x,t)+∇·jc(x,t) = 0, (B6) indicating that our calculation has been performed correctly. Acknowledgments The authors are grateful to S. Murakami and E. Saitoh for fruitf ul comments. This work was supported by a Grant-in-Aid for Scientiﬁc Research in Priority A rea “Creation and control of spin current” (Contract No. 1948027) from the Minist ry of Education, Culture, Sports, Science and Technology, Japan, by the Kurata Memorial H itachi Science and Tech- nology Foundation, and by the Sumitomo Foundation. A.T. is ﬁnancially supported by the Japan Society for the Promotion of Science for Young Scientists. ∗atake@phys.metro-u.ac.jp 1H. Ohno, Science 281, 951 (1998). 2S.A. Wolf, D.D. Awschalom, R.A. Buhrman, J.M. Daughton, S. v on Moln´ ar, M.L. Roukes, A.Y. Chtchelkanova, and D.M. Treger, Science 294, 1488 (2001). 3R.H. Silsbee, A. Janossy, and P. Monod, Phys. Rev. B 19, 4382 (1979). 4Y. Tserkovnyak, A. Brataas, and G.E.W. Bauer, Phys. Rev. Let t.88, 117601 (2002). 5A. Brataas, Y. Tserkovnyak, G.E.W. Bauer, and B.I. Halperin , Phys. Rev. B 66, 060404(R) (2002). 6S. Mizukami, Y. Ando, and T. Miyazaki, Phys. Rev. B 66, 104413 (2002). 24\n7M.V. Costache, M. Sladkov, S.M. Watts, C.H. van der Wal, and B .J. van Wees, Phys. Rev. Lett.97, 216603 (2006). 8M. Johnson and R.H. Silsbee, Phys. Rev. Lett. 55, 1790 (1985). 9F.J. Jedema, A.T. Filip, and B.J. van Wees, Nature 410, 345 (2001). 10J.E. Hirsch, Phys. Rev. Lett. 83, 1834 (1999). 11S. Murakami, N. Nagaosa, and S.-C. Zhang, Science 301, 1348 (2003). 12J. Sinova, D. Culcer, Q. Niu, N.A. Sinitsyn, T. Jungwirth, an d A.H. MacDonald, Phys. Rev. Lett.92, 126603 (2004). 13J.-I. Inoue, G.E.W. Bauer, and L.W. Molenkamp, Phys. Rev. B 70, 041303(R) (2004). 14Y.K. Kato, R.C. Myers, A.C. Gossard, and D.D. Awschalom, Sci ence306, 1910 (2004). 15J. Wunderlich, B. Kaestner, J. Sinova, and T. Jungwirth, Phy s. Rev. Lett. 94, 047204 (2005). 16K. Uchida, S. Takahashi, K. Harii, J. Ieda, W. Koshibae, K. An do, S. Maekawa, and E. Saitoh, Nature455, 778 (2008). 17E. Saitoh, M. Ueda, H. Miyajima, and G. Tatara, Appl. Phys. Le tt.88, 182509 (2006). 18S.O. Valenzuela and M. Tinkham, Nature 442, 176 (2006). 19T. Kimura, Y. Otani, T. Sato, S. Takahashi, and S. Maekawa, Ph ys. Rev. Lett. 98, 156601 (2007). 20S. Takahashi and S. Maekawa, Phys. Rev. Lett. 88, 116601 (2002). 21S. Takahashi and S. Maekawa, J. Phys. Soc. Jpn. 77, 031009 (2008). 22L. Vila, T. Kimura, and Y.C. Otani, Phys. Rev. Lett. 99, 226604 (2007). 23T. Seki, Y. Hasegawa, S. Mitani, S. Takahashi, H. Imamura, S. Maekawa, J. Nitta, and K. Takanashi, Nature Mater. 7, 125 (2008). 24K. Ando, S. Takahashi, K. Harii, K. Sasage, J. Ieda, S. Maekaw a, and E. Saitoh, Phys. Rev. Lett.101, 036601 (2008). 25X. Wang, G.E.W. Bauer, B.J. van Wees, A. Brataas, and Y. Tserk ovnyak, Phys. Rev. Let. 97, 216602 (2006). 26J. Xiao, G.E.W. Bauer, and A. Brataas, Phys. Rev. B 77, 180407(R) (2008). 27J. Shibata and H. Kohno, Phys. Rev. Lett. 102, 086603 (2009). 28K. Hosono, A. Takeuchi, and G. Tatata, J. Phys. Soc. Jpn. 79, 014708 (2010). 29J.-I. Ohe, A. Takeuchi, and G. Tatara, Phys. Rev. Lett. 99, 266603 (2007). 30A. Takeuchi and G. Tatara, J. Phys. Soc. Jpn. 77, 074701 (2008). 25\n31A. Takeuchi, K. Hosono, and G. Tatara, J. Phys.: Conf. Ser. 200, 062031 (2010). 32E. Saitoh (private communication). 33H. Katsura, N. Nagaosa, and A.V. Balatsky, Phys. Rev. Lett. 95, 057205 (2005). 34N. Nakabayashi, A. Takeuchi, K. Hosono, K. Taguchi, and G. Ta tara, arXiv:1002.0207. 35E.G. Mishchenko, A.V. Shytov, and B.I. Halperin, Phys. Rev. Lett.93, 226602 (2004). 36R. Raimondi, and P. Schwab, EPL 87, 37008 (2009). 37M. Duckheim, D.L. Maslov, D. Loss, Phys. Rev. B 80, 235327 (2009). 38I.V. Tokatly, Phys. Rev. Lett. 101, 106601 (2008). 39E.I. Rashba, Sov. Phys. Solid State 2, 1109 (1960). 40O. Krupin, G. Bihlmayer, K. Starke, S. Gorovikov, J.E. Priet o, K. D¨ obrich, S. Bl¨ ugel, and G. Kaindl, Phys. Rev. B 71, 201403(R) (2005). 41C.R. Ast, J. Henk, A. Ernst, L. Moreschini, M.C. Falub, D. Pac il´ e, P. Bruno, K. Kern, and M. Grioni, Phys. Rev. Lett. 98, 186807 (2007). 42T. Nakagawa, O. Ohgami, Y. Saito, H. Okuyama, M. Nishijima, a nd T. Aruga, Phys. Rev. B 75, 155409 (2007). 43I.M. Miron, G. Gaudin, S. Auﬀret, B. Rodmacq, A. Schuhl, S. Piz zini, J. Vogel, and P. Gam- bardella, Nature Mater. 9, 230 (2010). 44H. Haug and A.-P. Jauho, Quantum Kinetics in Transport and Optics of Semiconductors (Springer, 2007). 26\n",
  "metadata": {
    "paper_id": "0912.3607v2",
    "downloaded_at": "2025-08-24T23:24:38.224908+00:00"
  },
  "processed_at": "2025-08-24T23:24:38.224926+00:00"
}