{
  "content": "arXiv:1501.01362v1 [cond-mat.quant-gas] 7 Jan 2015Superﬂuidity of pure spin current in ultracold Bose gases Qizhong Zhu (朱起忠),1Qing-feng Sun (孙庆丰),1,2and Biao Wu (吴飙)1,2,3 1International Center for Quantum Materials, School of Phys ics, Peking University, Beijing 100871, China 2Collaborative Innovation Center of Quantum Matter, Beijin g 100871, China 3Wilczek Quantum Center, College of Science, Zhejiang Univer sity of Technology, Hangzhou 310014, China (Dated: October 13, 2018) We study the superﬂuidity of a pure spin current that is a spin current without mass current. We examine two types of pure spin currents, planar and circular , in spin-1 Bose gas. For the planar current, it is usually unstable, but can be stabilized by the quadratic Zeeman eﬀect. The circular current can be generated with spin-orbit coupling. When the spin-orbit coupling strength is weak, we ﬁnd that the circular pure spin current is the ground state of the system and thus a super-ﬂow. We discuss the experimental schemes to realize and detect a p ure spin current. PACS numbers: 05.30.Jp, 03.75.Mn, 03.75.Kk, 71.70.Ej I. INTRODUCTION Since the experimental realization of Bose-Einstein condensation in optical traps, much eﬀort has been de- voted to the study of spinor superﬂuid [1–7]. With the degree of freedom of spin, spinor superﬂuid has much richer phases than scalar superﬂuid as it has both su- perﬂuid order and spin textures. However, most spinor superﬂuids studied till now carry both spin current and mass current. It will be interesting to see whether these two currents can decouple and further whether a pure spin current which has no mass current can ﬂow friction- lessly. Our motivation also originates from condensed matter physics, in which the concept of spin supercon- ductor [8, 9], formed by the Cooper-likepairs of electrons and holes and carrying spin super-current, is proposed. It is interesting to have these ideas realized in the ﬁeld of cold atoms. In this work we focus on the unpolarized spin-1 Bose- Einstein condensate (BEC), where the pure spin current can be generated by applying a small magnetic gradient. It was found in Ref. [10] that a planar pure spin current insuchasystemisalwaysunstableasthe m= 1,−1com- ponents can collide into the m= 0 component destroying the spin current. We ﬁnd that the pure spin current can be stabilized with the quadratic Zeeman eﬀect and be- come a super-ﬂow. Furthermore, we propose a scheme to create pure spin current at the ground state, thus free fromtheissueofinstability. Ourschemeutilizesthe spin- orbit coupling. Speciﬁcally, we study a spin-1 BEC with Rashbaspin-orbitcouplingconﬁnedin atwo-dimensional harmonic trap, and numerically ﬁnd the ground state of the system. For antiferromagnetic interactions, opposite vortices appear in the m= 1,−1 components with equal amplitude when the spin-orbit coupling is weak. Such a state carries pure spin current and no mass current. This spin current is a super-ﬂow as it is the ground state and must be stable. We note that there hasbeen alot oftheoreticaland ex- perimental work on the counterﬂow of two species BEC [10–21]. For two miscible BECs with counterﬂow, it isfound that there is a critical relative speed between the two species, beyond which the state is dynamically un- stable [11–19]. It is shown that the instability can lead to proliferation of solitons [14, 15] and quantum turbulence [16]. This kind of counterﬂow is very similar to a spin current but it is not for two reasons: (1) Theoretically, if weregardthe twospecies astwocomponentsofapseudo- spin, this pseudo-spin has no SU(2) rotational symmetry as the number of bosons in each species is conserved. (2) Experimentally, it is hard to control the number of bosons in each component to create a spin current that has no mass current. The paper is organized as follows. In Sec. II, we ﬁrst study the stability of a spin-1 planar counterﬂow. We identify the mechanisms associated with the instabilities, and ﬁnd that the quadratic Zeeman eﬀect can stabilize suchaplanarﬂow. Wethen studythe similarsituationin the circular geometry in Sec. III. The pure spin current consists of a vortex and anti-vortex in the m=−1,1 components. The experimental schemes to realize the stable pure spin current is discussed in Sec. IV. Finally, we brieﬂy summarize our main results in Sec. V. II. PLANAR FLOW Thedynamicsofaspin-1BECinfreespaceisgoverned by the mean ﬁeld Gross-Pitaevskii (GP) equation [7], i/planckover2pi1∂ ∂tψm=−/planckover2pi12∇2 2Mψm+c0ρψm+c21∑ n=−1s·Smnψn,(1) whereψm(m= 1,0,−1) are the components of the macroscopic wave function. ρ=∑text1 m=−1|ψm|2is the total density, si=∑text mnψ∗ m(Si)mnψnis the spin density vector and S= (Sx,Sy,Sz) is the spin operator vector withSi(i=x,y,z) being the three Pauli matrices in the spin-1 representation. The collisional interactions in- clude a spin-independent part c0= 4π/planckover2pi12(a0+ 2a2)/3M and a spin-dependent part c2= 4π/planckover2pi12(a2−a0)/3M, with af(f= 0,2) being the s-wave scattering length for spin-1 atoms in the symmetric channel of total spin f.\n2 We considera spin currentstate of the aboveGP equa- tion with the form ψ=/radicalbiggn 2 eik1·r 0 eik2·r , (2) wherenis the density of the uniform BEC. The require- ment of equal chemical potential leads to |k1|=|k2|. In the case where k1=−k2, this state carries a pure spin current: the total mass current is zero as it has equal mass counterﬂow while the spin current is nonzero. It is instructive to ﬁrst consider the special case when there is no counterﬂow, i.e., k1=k2= 0. The exci- tation spectra are found to be ǫ0=/radicalBig 2c2nǫq+ǫ2qand ǫ±1 1=/radicalBig 2c0nǫq+ǫ2q,ǫ±1 2=/radicalBig 2c2nǫq+ǫ2q, respectively, withǫq=/planckover2pi12q2/2M. So for antiferromagnetic interac- tion (c0>0,c2>0), all branches of the spectra are real and there is a double degeneracy in one branch of the spectra. The phonon excitations give two sound veloci- ties,/radicalbig nci/M(i= 0,2), corresponding to the speeds of density wave and spin wave, respectively. However, the existence of phonon excitation does not mean that the pure spin current ( k1=k2/ne}ationslash= 0) is a super-ﬂow as we can not obtain the current with k1=k2/ne}ationslash= 0 from the state withk1=k2= 0 by a Galilean transformation. The stability of the spin current has been studied in Ref. [10] for the case k1=−k2/ne}ationslash= 0. It is found that, for the antiferromagnetic interaction case ( c0>0,c2>0), the excitation spectrum of the m= 0 component always has nonzero imaginary part in the long wavelength limit as long as there is counterﬂow between the two compo- nents, and the imaginary excitations in the m= 1,−1 components only appear for a large enough relative ve- locityv1= 2/radicalbig nc2/M. For the ferromagnetic interac- tion case (c0>0,c2<0), both excitation spectra of the m= 0 andm= 1,−1 components have nonzero imagi- nary parts for any relative velocity. This means that the pure spin current cannot be stable in any cases. For the general non-collinear case ( k=k1+k2 2/ne}ationslash= 0) and antiferromagnetic interaction, the excitation spec- trum for the m= 0 component is found to be ǫ0=/radicalBigg(g ǫq+/planckover2pi12 2M(|k|2−|k1|2)+c2n)g2 −c2 2n2.(3) We see here that as long as the momenta of the two com- ponents are not exactly parallel, i.e., k1is not exactly equal to k2, then|k|<|k1|, and there is always dynam- ical instability for the long wavelength excitations. Therefore, the spin current in Eq. (2) is generally un- stable and not a super-ﬂow. This instability originates from the interaction process described by ψ† 0ψ† 0ψ1ψ−1in the second quantized Hamiltonian. This energetically fa- vored process converts two particles in the m= 1,−1 components, respectively, into two stationary particles in them= 0 component. To suppress such a process andachieve a stable pure spin current, one can utilize the quadratic Zeeman eﬀect. With the quadratic Zeeman ef- fect of negative coeﬃcient, the Hamiltonian adopts an additional term λm2(λ <0 andm= 1,0,−1). This term does not change the energy of the m= 0 compo- nent, but lowers the energy of the other two components m= 1,−1. As a result, there arises a barrier for two atoms in the m= 1,−1 components scattering to the m= 0 component, and the scattering process is thus suppressed. The above intuitive argument can be made more rigor- ous and quantitative. Consider the case k1=−k2. With the quadratic Zeeman term, the excitation spectrum for them= 0 component changes to ǫ0=/radicalBigg(g ǫq−/planckover2pi12|k1|2 2M+c2n−λ)g2 −c2 2n2.(4) Soaslongas −λ−/planckover2pi12|k1|2/2M >0, longwavelengthexci- tationswill be stableforthe m= 0component. Fromthe excitationofthe m= 0component, onecanobtainacrit- icalrelativevelocityofthespincurrent, v0= 2/radicalbig −2λ/M. Thereis anothernonzerocriticalvelocity v1= 2/radicalbig nc2/M determined by the excitations of the m= 1,−1 compo- nents. The overall critical velocity of the system is the smaller one of v0andv1. Therefore, below the critical relative velocity vc= min{v0,v1}, the pure spin current is stable and a super-ﬂow. The experimental scheme to realize such a Zeeman eﬀect will be discussed in Sec. IV. III. CIRCULAR FLOW In the cylindrical geometry, we consider a pure spin current formed by two vortices with opposite circulation in them= 1,−1 components. From similar arguments, one can expect that interaction will make such a cur- rent unstable. Inspired by the quadratic Zeeman eﬀect method above, we propose to use spin-orbit coupling to stabilize it. The spin-orbit coupling can be viewed as a momentum-dependent eﬀective magnetic ﬁeld that ex- erts only on the m= 1,−1 components. Therefore, it is possible that spin-orbit coupling lowers the energy of m= 1,−1 components, and consequently suppresses the interaction process leading to the instability. The model of spin-1 BEC subject to Rashba spin-orbit coupling can be described by the following energy func- tional, E[ψα] =∫display dr/braceleftBigg∑ α/planckover2pi12|∇ψα|2 2M+ρV(r)+c0 2ρ2+c2 2s2 +γ/an}b∇acketle{tSxpy−Sypx/an}b∇acket∇i}ht/bracerightBigg , (5) whereρis the density, V(r) =1 2Mω2(x2+y2) is the trap- ping potential, and γis the strength of spin-orbit cou- pling./an}b∇acketle{t···/an}b∇acket∇i}htistheexpectationvaluetakenwithrespectto\n3 the three component wave function ψ= (ψ1,ψ0,ψ−1)T. The strength of the spin-orbit coupling γdeﬁnes a char- acteristic length asoc=/planckover2pi1/Mγ, and can be rescaled to be dimensionless with respect to the harmonic oscillator lengthah=/radicalbig /planckover2pi1/Mω. Then we characterize the strength of spin-orbit coupling with the dimensionless quantity κ=ah/asoc=γ/radicalbig M//planckover2pi1ω. The spin-orbit coupling of Rashbatypeherecanbegeneratedinvariousways,which will be discussed in the next section. The above model can describe a spin-1 BEC of23Na conﬁned in a two-dimensional harmonic trap. Assume the atom number is about 106. Using the estimate of scattering lengths a0= 50aB,a2= 55aB[22], withaB being the Bohr radius, the ground state of spin-123Na should be antiferromagnetic because c0>0,c2>0 [5]. Previous studies of spin-1 BEC with Rashba spin-orbit coupling mostly focus on the strong spin-orbit coupling regime, where the ground state is found to be the plane wave phase or the stripe phase, for ferromagnetic in- teraction and antiferromagnetic interaction, respectively [23]. Here we are interested in the antiferromagnetic in- teraction case and the weak spin-orbit coupling regime (κ≪1), and calculate the ground state wave function of the energy functional with the method of imaginary time evolution. Weﬁndthatwhenthespin-orbitcouplingisweak( κ≪ 1), the ground state wave function has the form ψ= χ1(r)e−iφ χ0(r) χ−1(r)eiφ , (6) withχ1(r) =−χ−1(r) and allχireal. The ground state is shown in Fig. 1. Such a ground state consists of an anti-vortex in the m= 1 component and a vortex in the m=−1 component. The m= 0 component does not carry angular momentum. Since |ψ1|=|ψ−1|, the net mass current vanishes. The wave function in Eq. (6) can be understood in the single particle level. In terms of the ladder operators of spin and angular momentum, the spin-orbit coupling term reads Hsoc=γ√ M/planckover2pi1ω 2/bracketleftBig S+( ˆaR−ˆa† L) +S−( ˆa† R−ˆaL)/bracketrightBig , (7) whereS±is the ladder operator of spin, and ˆ a† L(R)is the creation operator of the left (right) circular quanta [24]. When the spin-orbit coupling is very weak ( κ≪1), its eﬀect can be accounted for in a perturbative way. From the ground state Ψ(0)=|0,0/an}b∇acket∇i}ht, the ﬁrst order correction to the wave function for small γis given by Ψ(1)=γ√ M/planckover2pi1ω 2/planckover2pi1ω( −S+ˆa† L+S−ˆa† R) |0,0/an}b∇acket∇i}ht =κ 2(−|1,−1/an}b∇acket∇i}ht+|−1,1/an}b∇acket∇i}ht), (8) where|ms,mo/an}b∇acket∇i}htdenotes a state with spin quantum num- bermsand orbital magnetic quantum number mo. One FIG. 1: (color online) Amplitudes (a1,b1,c1) and phase an- gles (a2,b2,c2) of the three component wave function ψ= (ψ1,ψ0,ψ−1)Tat the ground state of Hamiltonian (5) for a BEC of23Na conﬁned in a 2D harmonic trap. The particle numberis 106, the frequency of the trap is 2 π×42 Hz, and the dimensionless spin-orbit coupling strength is κ= 0.04. The units of the XandYaxes areah. immediately sees that ψ1has angularmomentum −/planckover2pi1and ψ−1has angular momentum /planckover2pi1. Besides, the amplitudes of bothψ1andψ−1are proportional to κ. There exits a continuity equation for spin density and spin current, which is d dt( ψ†Sµψ) +∇·Js µ= 0. (9) The spin current density tensor Js µ(µ=x,y,zdenotes the spin component) is deﬁned as [25, 26] Js µ=1 2/braceleftbig ψ†Sµvψ+c.c./bracerightbig =1 2  ∑ m,n,lψ∗ m(Sµ)mnvnlψl+c.c.  ,(10) where vnl=p M+γ(ˆz×Snl), (11)\n4 −2−1 012−2−1012 XY FIG. 2: (color online) Distribution of the spin current dens i- tiesJs x(blue arrow), Js y(red arrow) and Js z(black arrow) of the ground state shown in Fig. 1. The length of the arrows represents the strength of the spin current. The arrow lengt h of diﬀerent colors is not to scale. κ= 0.04. The units of the XandYaxes areah. and c.c. means the complex conjugate. The second part invnlis induced by the spin-orbit coupling. By the deﬁnition in Eq. (10), the spin current density carried by the ground state (6) is Js x=γsin2φ|ψ1|2ˆx+γ( |ψ0|2+2|ψ1|2sin2φ) ˆy, Js y=−γ( |ψ0|2+2|ψ1|2cos2φ) ˆx−γsin2φ|ψ1|2ˆy, Js z=( −2/planckover2pi1|ψ1|2 Mr+√ 2γ|ψ1ψ0|) ˆφ. (12) From both analytical and numerical results of the wave function, |ψ1| ≪ |ψ0|, soJs xroughly points in the ydi- rection, while Js yalmost points in the −xdirection. Js z represents a ﬂow whose amplitude has rotational symme- try. From the numerical results shown in Fig. 2, we see thatJs zis a counter-clockwise ﬂow. The amplitudes of Js xandJs yare of the same order, both proportional to κ, while that of Js z, proportional to κ2, is much smaller. It is evident that the state in Eq. (6) carries no mass cur- rent and only pure spin current. Since the spin current is in the ground state, it must be stable. In this way, we have realized a superﬂuid of pure spin current, or a pure spin super-current. IV. EXPERIMENTAL SCHEMES In this section, we propose the experimental schemes to generate and detect the pure spin currents discussed in Sec. II and Sec. III.The planar pure spin current can be easily generated. By applying a magnetic ﬁeld gradient, the two compo- nentsm= 1,−1 will be accelerated in opposite direc- tions and a pure spin current is generated as done in Refs. [14, 15]. To stabilize this spin current, one needs to generate the quadratic Zeeman eﬀect. We apply an oscil- lating magnetic ﬁeld Bsinωtwith the frequency ωbeing much larger than the characteristic frequency of the con- densate, e.g., the chemical potential µ. The time averag- ing removes the linear Zeeman eﬀect; only the quadratic Zeeman eﬀect remains. The coeﬃcient of the quadratic Zeeman eﬀect from the second-orderperturbation theory is given by λ= (gµBB)2/∆Ehf, wheregis the Land´ e g- factoroftheatom, µBisthe Bohrmagneton, and∆ Ehfis the hyperﬁne energy splitting [27]. For the F= 2 mani- fold of87Rb, ∆Ehf<0, sothe coeﬃcient ofthe quadratic Zeeman eﬀect is negative. The circular ﬂow in Sec. III may ﬁnd prospective real- izations in two diﬀerent systems: cold atoms and exciton BEC. In cold atoms, we consider a system consisting of a BEC of23Na conﬁned in a pancake trap, where the con- ﬁnement in the zdirection is so tight that one can treat the system eﬀectively as two dimensional. The spin-orbit couplingcanbe inducedbytwodiﬀerentmethods. Oneis by the exertion of a strong external electric ﬁeld Ein the zdirection. Due to the relativistic eﬀect, the magnetic moment of the atom will experience a weak spin-orbit coupling, where the strength γ=gµB|E|/Mc2. HereM is the atomic mass and cis the speed of light. For weak spin-orbit coupling (small γ), the fraction ofatoms in the m= 1,−1 components is proportional to γ2. For an ex- perimentally observable fraction of atoms, e.g., 0 .1% of 106atoms, using the typical parameters of23Na BEC, the estimated electric ﬁeld is of the same order of mag- nitude as the vacuum breakdown ﬁeld. For atoms with smaller mass or larger magnetic moment, the required electricﬁeld canbe lowered. Another method ofrealizing spin-orbit coupling is to exploit the atom laser interac- tion, where strong spin-orbit coupling can be created in principle [28]. In exciton BEC systems, as the eﬀective mass of exciton is much smaller than that of atom, the required electric ﬁeld is four to ﬁve orders of magnitude smaller, which is quite feasible in experiments [29–32]. The vortex and anti-vortex in the m= 1,−1 compo- nents can be detected by the method of time of ﬂight. First one can split the three spin components with the Stern-Gerlach eﬀect. The appearance of vortex or anti- vortex in the m= 1,−1 components is signaled by a ring structure in the time of ﬂight image. After a suﬃ- ciently long time of expansion, the ring structure should be clearly visible. V. CONCLUSION In summary, we have studied the stability of a pure spin current of a spin-1 BEC. In the planar ﬂow, the system always suﬀers from dynamical instability. The\n5 origin of the instability is the interaction process that converts two particles in the m= 1,−1 components into them= 0 component. Based on this, we propose a method to stabilize the pure spin current by utilizing the quadratic Zeeman eﬀect. In the circular ﬂow, we have proposedtouse spin-orbitcouplingtomakethepurespin current stable. For weak spin-orbit coupling, we have found that the ground state of the system is a superﬂuid ofpurespincurrent. Theexperimentalschemestorealizeand detect these pure spin currents have been discussed. Acknowledgements This work is supported by the NBRP of China (2013CB921903,2012CB921300) and the NSF of China (11274024,11274364,11334001,11429402). [1] D. Hall, M. Matthews, J. Ensher, C. Wieman, and E. Cornell, Phys. Rev. Lett. 81, 4531 (1998). [2] D. Hall, M. Matthews, C. Wieman, and E. Cornell, Phys. Rev. Lett. 81, 1543 (1998). [3] M. Matthews et. al., Phys. Rev. Lett. 81, 243 (1998). [4] J. Stenger et. al., Nature (London) 396, 345 (1998). [5] T.-L. Ho, Phys. Rev. Lett. 81, 742 (1998). [6] T. Ohmi, and K. Machida, J. Phys. Soc. Jpn. 67, 1822 (1998). [7] Seefor example, D. M. Stamper-Kurnand M. Ueda, Rev. Mod. Phys. 85, 1191 (2013) and references therein. [8] Q.-F. Sun, Z.-T. Jiang, Y. Yu, and X. C. Xie, Phys. Rev. B84, 214501 (2011). [9] Z.-Q. Bao, X. C. Xie, and Q.-F. Sun, Nat. Commun. 4, 2951 (2013). [10] K. Fujimoto and M. Tsubota, Phys. Rev. A 85, 033642 (2012). [11] C. K. Law, C. M. Chan, P. T. Leung, and M.-C. Chu, Phys. Rev. A 63, 063612 (2001). [12] A. B. Kuklov and B. V. Svistunov, Phys. Rev. Lett. 90, 100401 (2003). [13] V. I. Yukalov and E. P. Yukalova, Laser Phys. Lett. 1, 50 (2004). [14] M. A. Hoefer, J. J. Chang, C. Hamner, and P. Engels, Phys. Rev. A 84, 041605(R) (2011). [15] C. Hamner, J. J. Chang, P. Engels, and M. A. Hoefer, Phys. Rev. Lett. 106, 065302 (2011). [16] H. Takeuchi, S. Ishino, and M. Tsubota, Phys. Rev. Lett. 105, 205301 (2010).[17] S. Ishino, M. Tsubota, and H. Takeuchi, Phys. Rev. A 83, 063602 (2011). [18] L. Y. Kravchenko and D. V. Fil, J. Low Temp. Phys. 155, 219 (2009). [19] M. Abad, A. Sartori, S. Finazzi, and A. Recati, Phys. Rev. A89, 053602 (2014). [20] M. Vengalattore, S. R. Leslie, J. Guzman, and D. M. Stamper-Kurn, Phys. Rev. Lett. 100, 170403 (2008). [21] R. W. Cherng, V. Gritsev, D. M. Stamper-Kurn, and E. Demler, Phys. Rev. Lett. 100, 180404 (2008). [22] A. Crubellier et. al., Eur. Phys. J. D 6, 211 (1999). [23] C. Wang, C. Gao, C.-M. Jian, and H. Zhai, Phys. Rev. Lett.105, 160403 (2010). [24] C. Cohen-Tannoudji, B.Diu, andF. Laloe, Quantum Me- chanics, Vol. 1, Wiley, 1991. [25] Q.-F. Sun and X. C. Xie, Phys. Rev. B 72245303 (2005). [26] Q.-F. Sun, X. C. Xie, and J. Wang, Phys. Rev. B 77 035327 (2008). [27] M. Ueda, Fundamentals and New Frontiers of Bose- Einstein Condensation , World Scientiﬁc, 2010. [28] J. Dalibard, F. Gerbier, G. Juzeli¯ unas, and P. ¨Ohberg, Rev. Mod. Phys. 83, 1523 (2011). [29] C. Weisbuch, M. Nishioka, A. Ishikawa, and Y. Arakawa, Phys. Rev. Lett. 69, 3314 (1992). [30] J. Kasprzak et al., Nature 443, 409 (2006). [31] K.G. Lagoudakis et al., Nat. Phys. 4, 706 (2008). [32] A. Amo et al., Nat. Phys. 5, 805 (2009).\n",
  "metadata": {
    "paper_id": "1501.01362v1",
    "downloaded_at": "2025-08-24T23:37:04.787505+00:00"
  },
  "processed_at": "2025-08-24T23:37:04.787523+00:00"
}