{
  "content": "1 Is “ L-valine ferric chloride” a new nonlinear optical ma terial? Bikshandarkoil R. Srinivasan 1, Zbigniew Tylczy ński 2 1Department of Chemistry, Goa University, Goa 403206 , India, Email: srini@unigoa.ac.in 2Faculty of Physics, Adam Mickiewicz University, Umu ltowska 85, 61-614 Pozna ń, Poland, Email: zbigtyl@amu.edu.pl Abstract We argue that “ L-valine ferric chloride” crystal reported by Geetha et al [Curr. Appl. Phys. 15 (2015) 201-207] is not a new nonlinear optical material bu t instead a dubious crystal. Keywords: L-valine ferric chloride; crystal growth; L-valine; nonlinear optical; dubious crystal. Comment The authors of a recent paper (title paper hereinaf ter) report to have grown a so called “ L-valine ferric chloride” ( 1) crystal by the slow evaporation of an aqueous sol ution containing L-valine ( L-val) and ferric chloride in 1:1 ratio [1] . Despite the claims of single crystal and powder X -ray diffraction, infrared and UV-visible spectra and thermal studies , the authors have not assigned any chemical formula for 1 excepting an unusual code LVFC for the so called n ew semi organic nonlinear optical crystal. In recent papers we have shown that use of abbreviations or codes as alternates for molecular formula of new compounds is an unscientific method of product characterization [2, 3]. In this comment we show that the authors have characterized the title crystal not based on valid scientific proof but based on an incorrect assumption that mix ing of L-valine and ferric chloride in 1:1 ratio will result in the formation of 1. In the discussion of single crystal X-ray diffracti on analysis the authors reported “The axial length of unit cells are with a = 24.38 Å, b = 24.3 8 Å, c = 24.38 Å, the inter axial angles are α = β = γ = 90 o and volume of the grown crystal is V = 14485 Å3. LVFC crystallise in Cubic P system ”. In addition to an unusual way of reporting a cubic sys tem (in this system there are 15 space groups with primitive unit cell), it is noted that neither the temperature of cell measurement nor any ESD’ values for the cell parameters are given. The volume of un it cell of 1 is incredibly large, almost 24 times more than the unit cell of L-valine which is one of the reactants used for the crystal growth. Although the cell appears to differ from that of L-valine [4], this cannot be considered as an accept able scientific proof for the formation of a new compound. It is we ll documented that formulating new crystals based only on unit cell leads to erroneous conclusions [5]. We do not consider this experiment as acceptable \n2 single crystal X-ray diffraction result as the auth ors have not reported any refinement parameters and a CIF file to substantiate their work. Under the heading ‘powder X-ray diffraction the aut hors have mentioned, “ The sample was scanned in the range between 10 and 100 oC. Fig. 2 represents the indexed powder diffractogr am for the grown crystal of L-Valine Ferric Chloride. The sharp intensity peaks found in spectra shows good crystalline nature and purity of the grown crystal ”. Since, the reported powder pattern (not spectrum ) in the 2 θ range 10 to 100 o (not oC) shows a few spurious unindexed lines amidst lot of noise, we do not agree that such a pattern is a proof for the pu rity of the crystal. In our opinion such a poor qua lity powder pattern should not be used to make a scienti fic conclusion. In an earlier paper we have shown that a so called L-valine zinc sulphate is actually L-valine based on the coincidence of both infrared spectra [6]. For the title crystal, authors reported infrared absorption signals to an accuracy of 0.01 cm -1 and made assignments which are both questionable a nd incorrect. For example a band at 3377.36 cm -1 assigned for OH - vibration indicates that L-valine does not exist as a zwitter ion in 1. Although the authors report, “ The presence of other functional groups is verified from their respective absorption bands and they are in good agreement with those found in some complex amino acids ”, we do not agree with this because it is inapprop riate to make such conclusions based on a single spectrum. In this cas e, the IR spectrum matches with the spectrum of pure L-valine [6] indicating that the sample under study is the unre acted amino acid and not any so called “ L-valine ferric chloride”. Moreover, there are no bo nds connecting Fe and Cl ions with C and H ones. The authors write “The crystal has very low absorption in the entire visible and NIR region. From 400 to 600 nm the absorption is absence its sh ows the material exhibiting NLO property” . But from the reported fig.1 in the title paper, one can see that this crystal is dark yellow almost brown in colour. The dubious nature of this brown crystal ca n be evidenced from its optical spectrum which according to authors shows no absorption in the ent ire visible region. The authors used LCR HIOKI HITESTER 3532-50 meter t o investigate the dielectric properties and write: - “The material is characterized to load a resonant c avity and the sample permittivity is evaluated from the shift of the resonant frequency value compared to that of the empty cavity” . This sentence is meaningless because this device measures the capacitance of the capacitor filled with the tested substance. - “The variations of the dielectric constant and diel ectric loss as a function of frequency and dielectric constant are show in Fig. 9” . In this figure we can see only the values of dielectric constant. \n3 - “The dielectric constant and dielectric loss increa se with increase of temperature” . In fig.9 of the title paper the dielectric constant is almos t temperature independent in the range 50- 90 oC. - “The characteristic of low dielectric constant with high frequency for a given sample suggests that the sample possess optical quality” . The dielectric constant is very high, about 350, at the highest frequency 5 MHz. - “The metals are capable of decreasing the capacitan ce; the metal complex has a lower dielectric constant” . This claim is unscientific. In view of the above mentioned contradictory experi mental data, namely an infrared spectrum matching with that of pure L-valine, a very large unexplained unit cell volume compared to that of L- valine, a highly questionable powder pattern, a bro wn coloured solid showing no absorption in the visible region and inappropriate dielectric data th e so called “ L-valine ferric chloride” cannot be considered as a new semi organic material but shoul d be declared as a dubious crystal. A list of several dubious NLO crystal based on L-valine has been given recently [2] and most of these were characterized on similar lines. The so called “ L-valine ferric chloride” is a new addition to the l ist of improperly characterized amino acid based crystal. In summary , we have shown that a so called L-valine ferric chloride” is not a new nonlinear optical material but instead a dubious crystal. References [1] P. Geetha, S. Krishnan, R.K. Natarajan, V. Chit hambaram, Growth and characterization of semi organic nonlinear optical L-Valine Ferric Chlo ride single crystal by solution growth technique, Curr. Appl. Phys. 15 (2015) 201-207. [2] B.R. Srinivasan, S. Natarajan, G. Gururaja, Com ments on the papers recently published by Sangeetha et al., J. Therm. Anal. Calorim. 120 (2015) 1071-1075. [3] B.R. Srinivasan, Z. Tylczy ński, Comments on the paper “Growth and characteriza tion of semi- organic nonlinear optical crystal: Urea thiourea cadmium sulfate”, J. Therm. Anal. Calorim. (2015) DOI: 10.1007/s10973-015-4636-7. [4] M. Fleck, A.M. Petrosyan, Salts of Amino Acids: Crystallization, Structure and Properties, Springer, Dordrecht, 2014. [5] M. Fleck, A.M. Petrosyan, Difficulties in the g rowth and characterization of non-linear optical materials: a case study of salts of amino aci ds, J. Cryst. Growth 312 (2010) 2284-2290. [6] B.R. Srinivasan, R.N. Jyai, Reinvestigation of growth of L-valine zinc sulfate crystal, Spectrochim Acta A 120 (2014) 621-624. \n",
  "metadata": {
    "paper_id": "1506.00488v1",
    "downloaded_at": "2025-08-24T23:45:58.588684+00:00"
  },
  "processed_at": "2025-08-24T23:45:58.588699+00:00"
}