{
  "content": "Sujata Ghosh and R. Ramanujam: M4M9 EPTCS 243, 2017, pp. 91–103, doi:10.4204/EPTCS.243.7© M. Ma and A.-V . Pietarinen This work is licensed under the Creative Commons Attribution License.Graphical Sequent Calculi for Modal Logics Minghui Ma Institute of Logic and Cognition, Sun Yat-Sen University, G uangzhou, China mmh.thu@gmail.com Ahti-Veikko Pietarinen Chair of Philosophy, Tallinn University of Technology, Tal linn, Estonia ahti.pietarinen@gmail.com The syntax of modal graphs is deﬁned in terms of the continuou s cut and broken cut following Charles Peirce’s notation in the gamma part of his graphical logic of existential graphs. Graphical calculi for normal modal logics are developed based on a refo rmulation of the graphical calculus for classical propositional logic. These graphical calcul i are of the nature of deep inference. The relationship between graphical calculi and sequent calcul i for modal logics is shown by translations between graphs and modal formulas. 1 Introduction Sequent calculi for normal modal logics can be obtained unif ormly from a basic calculus, as has been observed in [23]. The search for generalized cut-free seque nt calculi for modal logics has produced display calculus ([3]), hypersequent calculus ([2]), labe lled sequent calculus ([10]), hybrid logic calculus ([18]), and deep sequent calculus ([7, 8, 21, 22]). Among the se efforts, there are two main approaches. One is the semantic approach; the other largely syntactic. I n the semantic approach, labelled calculi exist for a number of complete modal logics. The syntactic approac h does not use labels. Each sequent has an obvious corresponding formula. Ordinary sequent calculi a nd hypersequent calculi for modal logics are syntactic. Deep inference systems for modal logics, such as deep sequen t calculi developed by Br¨ unnler [7, 8] and Stouppa [22], are also largely syntactic. There exists a lso deep inference for hybrid logic ([19]). The syntax of deep sequents is deﬁned by assuming the negatio n normal form in classical modal logic and nested sequents. The central idea of deep inference is th at deep structures are transformed into appropriate shapes at any position in a derivation that allo ws the transformation. It has turned out that cut-free sequent calculi can be developed systematically a nd modularly for normal modal logics. As often is the case, what is syntactic and what semantic may i nterestingly overlap, as is the case in the hybrid and two-sided approaches. Also in the graphica l and diagrammatic systems the distinction between syntax and semantics is not, and was not originally m eant to be by Peirce, razor-sharp, which professes to gain some ﬂexibility when dealing with some mor e complicated and non-standard systems. The aim of the present paper is to provide a different kind of d eep inference system for normal modal logics. The language is given by Peirce’s alpha and gam ma graphs as presented in his theory of existential graphs (see e.g. [13, 14, 17, 24]). Graphs are sc ribed on the sheet of assertion. Inference rules are formulated as transformation rules from one graph to ano ther graph. In non-modal propositional logic (alpha graphs) and ﬁrst-order logic (beta graphs), th ere are basically only two general kinds of transformations: insertions to the graphs and erasures fro m the graphs. In graphical modal logic, there are two additional kinds of transformations: merges and spl its. In a sense also merges and splits are\n92 Graphical Sequent Calculi for Modal Logics instances of the operations of insertions and erasures. Thu s the fundamental proof rules also in the modal extensions of graphical logic can be classiﬁed into tw o general classes. As usual, these operations are allowed only in certain positions in a graph. It is the not ion of a position that is made explicit in graphical logic. This makes such graphical calculi the natu ral home for deep inference. Peirce’s theory of existential graphs was generalized into conceptual graphs by Sowa [20] in 1984. Since then conceptual graphs have been widely used within ar tiﬁcial intelligence and cognitive science. Diagrammatic reasoning and their history and philosophy ha s been studied for many years (see e.g. [1, 15, 16]). As far as modal logics are concerned, van den Berg [4 ] deﬁnes a graphical system for modal logic Kwhich is complete with respect to the Hilbert-style axiomat ic system of K. Bra¨ uner [5] deﬁnes a Peircean graphical system for the modal logic S5, which is also complete with respect to the Hilbert-style axiomatic system of S5. This type of graphical system is also extended by Bra¨ uner a nd Øhrstrøm [6] to modal logics S4andKD45 . In distinction from the above works, the graphical systems for modal logics presented in this paper are shown to be equivalent to algebra ic sequent systems. This means that a range of modal graphical systems can be developed in a systematic a nd modular fashion. 2 The syntax of modal graphs We ﬁx a denumerable set of simple propositions Prop the elements of which are primitive graphs. They occur in a compound graph as basic parts. According to Peirce , the sheet of assertion, or the blank where nothing is scribed on it, is also a primitive graph. It corres ponds to tautology ⊤. Henceforth, we denote the blank by SAor omit it altogether when no confusion arises. A primitive graph is a simple proposition or the blank ( SA). The modal graphs are deﬁned inductively from primitive grap hs using two special notations: the continuous cut and the broken cut . The continuous cut means negation. The broken cut means logical contingency (non-necessity). The continuous and b roken cuts are called primitive cuts uniformly. There are four combinations of cuts: (1) Double continuous cut: ; (2) Double broken cut: ; (3) Possibility cut: ; (4) Necessity cut: . The compound cuts consist of two cuts, one nested within the o ther, with nothing between them. The two primitive cuts and the four compound cuts stated above ar e called cuts uniformly. They are used as single graph operations that form new graphs from the given o nes. Deﬁnition 1. The set of all modal graphs GMis deﬁned inductively by: GM∋G::=p|SA|G|G|G1G2 where p∈Prop . The graphs G and G are read as “the continuous cut of G” and “the broken cut of G” respectively. The graph G 1G2is called the juxtaposition of G 1and G 2on the sheet of assertion. Henceforth, when we talk about graphs we mean modal graphs. G iven two graphs GandH, we deﬁne shorthand notations G/oveeH,G⊃HandG≡Has below: G/oveeH:=GH;G⊃H:=GH;G≡H:=GH HG. Deﬁnition 2. For any graph G, the parsing tree of G, denoted by T (G), is deﬁned inductively as follows: 1. T(p)is a single root node p.\nM. Ma and A.-V . Pietarinen 93 2. T(SA)is a single root node SA. 3. T(G1G2)is a root node G 1G2with children nodes T (G1)and T(G2). 4. T(G)is a root node G with one child node T (G). 5. T(G)is a root node G with one child node T (G). Apartial graph of a graph G is a node in T (G). For any graph G, the history of a node JinT(G), denoted by h(J), is the unique path from the root toJ. The position of the root is always on the sheet of assertion. We say that Jis a positive (negative) node of T(G)if there is an even (odd) number of cuts in h(J). Aposition is a point on the area of a graph (but not on the boundary of the c ut). Given any graph G, a position in Gispositive (negative ) if it is enclosed by an even (odd) number of cuts. Graph are sc ribed at positions. No two graphs, or their parts, can be scribed at the same position. Agraph context is a graph G{}with a single slot{}, the empty context, which can be ﬁlled by other graphs. The notation G{H}stands for the graph obtained from the graph context G{}by ﬁlling the slot byH. An occurrence of a graph Jin a graph Gis called positive (negative ), notation G{J+}(G{J−}), if it is a positive (negative) node in T(G). 3 The graphical calculi K g Graphical calculi for modal logics are presented by graphic al rules. In general, a graphical rule is of the form G H where GandHare graphs. The graph Gis called the premiss , and His called the conclusion . On the sheet of assertion, the syntax of graphs becomes diagr ammatic. This means that the syntax is two-dimensional, it has no separate notation for parenthes es, and that its well-formed graphs are scribed in the ambient space which is continuous, compact, open and n on-oriented. The following equalities can be thought of as identifying graphs: (PM)G{H1H2}=G{H2H1};(AS)G{H1(H2H3)}=G{(H1H2)H3}. The permutation (PM) says that to distinguish positions of H1andH2in a partial graph H1H2ofGhas no signiﬁcance. The associativity (AS) says that the order of f orming the graphs indicated by the parentheses in these rules is likewise immaterial. After all, these equa lities follow from the basic properties of the space and therefore need no separate statement in the system . Likewise, if two graphs, GandH, are asserted on the sheet of assertion, the the juxtaposition of them, G H, is at once also asserted. The continuous and broken cuts have different meanings in ge neral. However, the continuous cut of SAis tantamount to the broken cut of SAin the sense that it is impossible to falsify a tautology. Hen ce we assume the following equality: (Normality )= This equality says that contradiction is impossible. Its al gebraic meaning is the normality condition in modal algebras (Section 5). Deﬁnition 3. The graphical calculus Kgfor the minimal normal modal logic Kconsists of the following axiom and graphical rules:\n94 Graphical Sequent Calculi for Modal Logics 1. Axiom: SA (The Sheet of Assertion) 2. Alpha rules: •Deletion : G{H+} G{SA}(DEL) Every positive partial graph H in a graph G can be deleted. •Insertion : G{H−} G{(JH)−}(INS) Any graph can be inserted into a negative position in a graph G . •Double cut : G{H}(DC1) G{H}G{H}(DC2)G{H} Any partial graph H of a graph G can be replaced by the double cu t of H, and vice versa. •Iteration/deiteration : K{GH{J}} K{GH{GJ}}(IT)K{GH{GJ}} K{GH{J}}(DEIT) where H{ }is a broken-cut-free graph context, namely, no broken cut oc curs in H { }. In a graph K{GH{J}}, the partial graph G can be iterated or deiterated at any posi tion in H. 3. Modal rules: J{GH}(K1) J{G H}J{G H}(K2) J{GH}J{(G⊃H)+}(DMN)J{(H⊃G)+} (K1)and(K2)mean that the necessity cut distributes over juxtaposition . We call the rule (K1) splitting and(K2)merging .(DMN)is the rule of downward monotonicity . Aproof of a graph GinKgis a ﬁnite sequence of graphs G0,..., Gnsuch that Gn=G, and each Giis eitherSAor derived from previous graphs by a rule in Kg. A graph Gisprovable inKg, notation ⊢KgG, if it has a proof in Kg. A graphical derivation of Hfrom Gisadmissible inKg, if⊢KgGimplies⊢KgH. Remark 1. The restriction on the context H { }in (IT) and (DEIT) rules is signiﬁcant. Iteration/de- iteration in a modal context may lead to invalid inferences. For example, consider the following two inferences where the rules (IT) and (DEIT) are applied into t he broken cut: pq⊃pq pq⊃ppq(I)pq⊃pq pp q⊃pq(II) The premisses of (I) and (II) are valid, but their conclusion s are not valid in the algebraic semantics forKg(Section 5). (I) is a counterexample to the validity of itera tion into broken cut, and (II) is a counterexample to the validity of deiteration from a broken cut. Lemma 1. The graphs G ⊃SAand G⊃G are derivable in Kg.\nM. Ma and A.-V . Pietarinen 95 Proof. We have the following proofs: SA(DC1) (INS)GSA(DC1) (INS)G(IT) GG This completes the proof. Proposition 1. The following rules are admissible in Kg: 1. De Morgan rules: GH(DM1)G/oveeHG/oveeH(DM2)GH 2. Contraposition and transitivity rules: G⊃H H⊃G(CP)G⊃H H⊃J G⊃J(TR) 3. Preﬁxing and Modus Ponens: G H⊃G(PF)G G⊃H H(MP) 4. Lattice rules: Gi⊃H G1G2⊃H(&L)G⊃H G⊃J G⊃HJ(&R)G⊃J H⊃J G/oveeH⊃J(/oveeL) G⊃Hi G⊃H1/oveeH2(/oveeL)G⊃H/oveeJ H G⊃J(NL)GH⊃J H⊃G/oveeJ(NR) 5. Residuation rules: GH⊃J G⊃(H⊃J)(RG1)G⊃(H⊃J) GH⊃J(RG2) 6. Distributivity: GHJ(D1) G H G JG H G J(D2) GHJ 7. Upward monotonicity: G⊃H(UMN) G⊃HG⊃H(UMP) G⊃HG⊃H(UMDB) G⊃H 8. Replacement of equivalents: G≡H J{G}≡J{H}(RE) 9. Necessitation rule:G G(Nec)\n96 Graphical Sequent Calculi for Modal Logics Proof. For (DM1) and (DM2), we have the following simple proofs that only use the double-cut rules: GH(DC1) G H (DC1) G HG H (DC2) G H (DC2)GH (TR) is shown as follows: GJ JH (IT) GJJH (DEIT) GJH (DEL) G H (DC2) GH For (D1) and (D2), we have the following proofs ([9]): GHJ(IT) GGH J(IT) GGH GJ(DEL) GH GJGH GJ(IT) GH GJ GH GJ(4 times DEL ) GG HJ(DEIT) G HJ(DC2) GHJ The rule (RE) is shown by induction on the construction of J{}as follows. Assume G≡H. IfJ{}={}, the conclusion is the same as the premiss. Suppose J{ }=J′{}. By induction hypothesis, we have J′{G} ≡J′{H}. Then it is easy to show J′{G} ≡ J′{H}. Assume J{ }=J1J2{ }. By induction hypothesis, we have J2{G}≡J2{H}. Then it is easy to show J1J2{G}≡J1J2{H}. The rule (UMN) is obtained from (DMN) by the rule of contrapos ition (CP). (Nec) is shown by (PF), (UMN) and (TR). The other rules are easily shown. Theorem 1 (Cut-elimination) .The following cut-elimination rule J{GG}(Cut-E)J{SA} is admissible in Kg. Proof. Clearly GG≡SAis provable in Kg. By (RE), we have J{GG} ≡ J{SA}. Assume ⊢KgJ{GG}. By (TR), we have ⊢KgJ{SA}. 4 Extensions Extensions of Kgcan be obtained by adding some characteristic rules. The for mulation of these char- acteristic rules will make use of the cuts, including the six cuts (two primitive and four combined ones)\nM. Ma and A.-V . Pietarinen 97 we introduced in Section 2. We say that the occurrence of a cut in a graph is positive (negative ) if it is enclosed evenly (oddly) by primitive cuts (continuous or br oken cuts). Anormal modal graphical calculus is an extension of Kgwith a set of graphical rules. Given a set of rules Σ={Ri|i∈I}, the notation KΣdenotes the calculus generated by rules in Σ. Let us have the following rules of transformation as the basic rules for var ious systems of graphical modal logic: (D)Any positive necessity cut can be transformed into a possibi lity cut. Any negative possibility cut can be transformed into a necessity cut. J{G+} J{G+}(D+)J{G−} J{G−}(D−) (T)Any positive continuous cut can be transformed into a broken cut. Any negative broken cut can be transformed into a continuous cut. J{G+} J{G+}(T+)J{G−} J{G−}(T−) (4)Any positive necessity cut can be doubled. Any negative poss ibility cut can be doubled. J{G+} J{G+ }(4+)J{G−} J{G− }(4−) (B)Any positive double broken cut can be deleted. Any double bro ken cut can be inserted into a negative position. J{G+} J{G+}(B+)J{G−} J{G−}(B−) (5)Any positive double broken cut can be transformed into a nece ssity cut. Any negative possibility cut can be transformed into a double broken cut. J{G+} J{G+}(5+)J{G−} J{G−}(5−) Deﬁnition 4. Let(X)={(X+),(X−)}for X∈{D,T,4,B,5}. We deﬁne the following graphical calculi: KD g=Kg(D) KBg=Kg(B) K4g=Kg(4) K5g=Kg(5) KT g=Kg(T) KDB g=KD g(B) KB4 g=KBg(4) KD4 g=KD g(4) KD5 g=KD g(5) KB5 g=KBg(5) K45 g=K4g(5) KTB g=KT g(B) S4g=KT g(4) S5g=KT g(5) LetSbe any one of the systems in Deﬁnition 4. Let S+andS−be the systems obtained from Sby dropping the negative and positive rules respectively. Theorem 2. S+=S=S−.\n98 Graphical Sequent Calculi for Modal Logics Proof. Consider KT+=Kg(T+). It sufﬁces to show that (T−)is provable in KT+. Assume that J{G−}is provable in KT+. There are two cases: Case 1. J{G−}=J′HG. First, it is easy to prove G⊃GinKT+. Then we have the following proof: G⊃G(&L)HG⊃G G⊃G(TR)HG⊃GH⊃H(&L)HG⊃H(&R)HG⊃HG(DMN) HG⊃HG(Alpha rules) J′HG⊃J′HG Case 2. J{G−}=J′HG. We have the following proof: G⊃G(Alpha rules)HG⊃HG(CP) HG⊃HG(Alpha rules) J′HG⊃J′HG Hence(T−)is provable in KT+. The remaining cases of Sare shown similarly. 5 Graphical and sequent calculi The set of all modal formulas LMis deﬁned by the following inductive rule: LM∋α::=p|⊤|¬ α|(α∧α)|/squareα, where p∈Prop . Other propositional connectives ⊥,∨,→and↔are deﬁned as usual. The dual operator of♦is deﬁned as ♦α:=¬/square¬α. Abasic sequent is an expression of the form α⊢β. Deﬁnition 5. The basic sequent calculus SKconsists of the following axioms and rules: (1)Axioms: (Id)α⊢α,(⊤)α⊢⊤,(D)α∧(β∨γ)⊢(α∧β)∨(α∧γ), (Em)⊤⊢α∨¬α,(Gen)⊤⊢/square⊤,(/square∧)/squareα∧/squareβ⊢/square(α∧β). (2)Rules for propositional connectives: ¬α⊢β(¬L)¬β⊢αα⊢¬β(¬R)β⊢¬αα⊢β β⊢γ α⊢γ(Tr) αi⊢β(∧L)(i=1,2)α1∧α2⊢ββ⊢α1β⊢α2(∧R)β⊢α1∧α2 (3)Modal rule: α⊢β /squareα⊢/squareβ(/square)\nM. Ma and A.-V . Pietarinen 99 By the standard Lindenbaum–Tarski construction, one can ea sily obtain the following completeness result: Theorem 3. A sequent is derivable in SKiff it is valid in all modal algebras. We shall present the translations between the modal languag eLMand the graphical language GM, and then prove the connections between the graphical calcul usKgand the sequent calculus SK. Deﬁnition 6. The translation π:GM→LMis deﬁned inductively by π(p)=p;π(SA)=⊤;π(G)=¬π(G); π(G)=♦¬π(G);π(G1G2)=π(G1)∧π(G2). The translation σ:LM→GMis deﬁned inductively by σ(p)=p;σ(⊤)=SA;σ(¬ϕ)= σ(ϕ); σ(/squareϕ)= σ(ϕ);σ(ϕ1∧ϕ2)=σ(ϕ1)σ(ϕ2). The two translations πandσare related to each other. The relationship can be presented by the following result: Proposition 2. There are functions δ:LM→LMandρ:GM→GMsuch that the following diagrams commute: /Bullet /Bullet /BulletLM GM LMσ δπ (I)/Bullet /Bullet /BulletGM LM GMπ ρσ (II) i.e.,π◦σ=δandσ◦π=ρ. Proof. As we are using them later on, let us ﬁrst deﬁne the two (redund ant) functions δandρas follows. Deﬁne the function δinductively by: δ(p)=p,δ(⊤)=⊤,δ(ϕ1∧ϕ2)=δ(ϕ1)∧δ(ϕ2), and δ(/squareφ)= ¬♦¬ϕ. By induction on the construction of a modal formula ϕone can easily show σ(π(ϕ))= δ(ϕ). Hence(I)commutes. Deﬁne the function ρinductively as follows: ρ(p)=p, ρ(SA)=SA, ρ(G1G2)=G1G2, ρ(G)= G, ρ(G)= G. By induction on the construction of a graph Gone can easily show that σ(π(G)) = ρ(G). Hence(II) commutes. Aformula context is a formula structure α{}with a single slot {}which can be ﬁlled with a formula. Letα{β}be the formula obtained from α{ }by ﬁlling the slot by β. The notation α{β+}stands for thatβis positive in α, i.e., βis in the scope of an even number of negation symbols. Similar ly we use the notation α{β−}. Lemma 2. The following hold in SK:\n100 Graphical Sequent Calculi for Modal Logics (1)ifα{β+}andβ⊢SKγ, then α{β}⊢SKα{γ}. (2)ifα{β−}andβ⊢SKγ, then α{γ}⊢SKα{β}. (3)ifβ⊢SKγandγ⊢SKβ, then α{β}⊢SKα{γ}andα{γ}⊢SKα{β}. Proof. By induction on the construction of α{ }. We sketch the proof of (1) and (2) by simultaneous induction. The case α{}={}is obvious. Suppose α{β}:=¬α′{β}andβ⊢SKγ. There are two cases: Case 1.¬α′{β+}. Then α′{β−}. By induction hypothesis, we have α′{γ} ⊢ SKα′{β}. Then ¬α′{β}⊢SK¬α′{γ}. Case 2.¬α′{β−}. Then α′{β+}. By induction hypothesis, we have α′{β} ⊢ SKα′{γ}. Then ¬α′{γ}⊢SK¬α′{β}. The case α{}=α1{}∧ α2orα{}=α1∧α2{}is obvious. Suppose α{}=/squareα′{}andβ⊢SKγ. Assume/squareα′{β+}. Then by induction hypothesis we have α′{β} ⊢ SKα′{γ}. Then by (/square)we have /squareα′{β}⊢SK/squareα′{γ}. The case for /squareα′{β−}is similar. Lemma 3. For any graph G, if ⊢KgG, then⊤⊢ SKπ(G). Proof. Assume⊢KgG. Let G0,..., Gn=Gbe a proof of G. We show ⊤ ⊢ SKπ(Gi)by induction on i≤n. IfGiisSA, clearly we have ⊤⊢ SKπ(Gi). Assume that Giis obtained from G′by a rule (R). If (R)is an alpha rule, it is easy to get the conclusion by induction hypothesis and Lemma 2. Suppose that (R)is a modal rule. (1).(R)=( K1)or(K2). Let Gi=J{H K}andG′=J{HK}. By induction hypothesis, we have⊤⊢ SKπ(J){π(HK)}, i.e.,⊤⊢ SKπ(J){¬♦¬(π(H)∧π(K))}. Clearly ¬♦¬(π(H)∧π(K))⊢SK ¬♦¬π(H)∧¬♦¬π(K)and¬♦¬π(H)∧¬♦¬π(K)⊢SK¬♦¬(π(H)∧π(K)). By Lemma 2 (3), we get ⊤⊢ SKπ(Gi). The case for (K2)is similar. (2).(R) =( DMN). Let Gi=J{(K⊃H)+}andG′=J{(H⊃K)+}. By induction hypothesis, we have⊤⊢ SKπ(J{(H⊃K)+}), i.e.,⊤⊢ SKπ(J){¬(π(H)∧π(K))}. Clearly, ¬(π(H)∧¬π(K))⊢SK ¬(♦¬π(K)∧♦¬¬π(H)). By Lemma 2 (1), we get ⊤⊢ SKπ(Gi). Lemma 4. For any formula α, if⊤⊢ SKα, then⊢Kgσ(α). Proof. By induction on the derivation of ⊤⊢αinSK. The proof is omitted. Lemma 5. For any graph G, ⊢KgG iff⊢Kgρ(G). Proof. By induction on the proof of GinKg. The proof is omitted. Theorem 4. For any graph G, ⊢KgG iff⊤⊢ SKπ(G). Proof. The ‘only if’ part is obtained by Lemma 3. Assume ⊤ ⊢ SKπ(G). By Lemma 4, we have ⊢Kg σ◦π(G). By Proposition 2, ⊢Kgρ(G). By Lemma 5, ⊢KgG. Deﬁnition 7. Amodal algebra is an algebra A=(A,∧,¬,/square,1)where(A,∧,¬,1)is a Boolean algebra, and/squareis a unary operator on A satisfying the conditions: 1. Additivity: for all a ,b∈A,/square(a∧b)=/squarea∧/squareb; 2. Normality: /square1=1.\nM. Ma and A.-V . Pietarinen 101 Any formula αis interpreted as a function αAin a modal algebra A. A sequent α⊢βisvalid inA ifαA≤βAwhatever elements of Aare assigned to variables in αorβ. By the standard Lindenbaum– Tarski construction, one can show the completeness of SKwith respect to the class of all modal algebras, i.e.,α⊢SKβif and only if α⊢βis valid in all modal algebras (Theorem 3). A graph Gis interpreted as the function GA=π(G)A. A graph Gisvalid in a modal algebra Aif ⊤⊢π(G)is valid in A. Then one can obtain the following completeness result: Theorem 5. A graph G is provable in Kgiff it is valid in all modal algebras. Proof. The soundness is shown by induction on the proof of G. For completeness, assume /ne}ationslash⊢KgG. By Theorem 4, we have ⊤ /ne}ationslash⊢ SKπ(G). By the completeness of SK, there is a modal algebra Awith 1/ne}ationslash≤π(G)A. Then Gis not valid in A. For any set of modal formulas Σ, letΣ≤={⊤⊢ α|α∈Σ}. Then we have the basic sequent calculus SKΣ⊢which is obtained from SKby adding all sequents in Σ≤as axioms. Let Alg(Σ)be the class of all modal algebras that validate all sequents in Σ⊢. Then the sequent system SKΣ⊢, if consistent, is sound and complete with respect to Alg(Σ). For any set of modal formulas Σ, consider the set of graphical rules Σg={⊤⊢ σ(α)|α∈Σ}. Let KgΣgbe the graphical calculus obtained from Kgby adding all rules in Σg. ForΣ⊆ {D,T,4,B,5}, where D=♦⊤,T=/squareα→α, 4=/squareα→/square/squareα,B=α→/square♦αand 5= ♦α→/square♦α, one can show that the calculus KgΣgis equivalent to SKΣ⊢by the translation π. The proof is similar to Theorem 4. Moreover, the graphical calculi KgΣgare sound and complete with respect to Alg(Σ). 6 Conclusion Graphical calculi for modal logics developed in the present paper are systematic and modular. They are modal graphical versions of Gentzen-style sequent syst ems. They follow closely Peirce’s original presentation in another sense as well: the rules arise syste matically from Peirce’s presentation of broken- cut gamma graphs and their rules (R 467, 478). Only (DMN), (B) and (5) are new.1In the basic system Kg, identifying a vacant broken-cut with a vacant continuous c ut dispenses with necessitation as a primitive rule. Moreover, the basic rules are perfectly symmetrical. Thanks to the diagrammatic syntax, graphs need not assume negation normal form. Thus th ere are good prospects for developing deep inference proof systems for non-normal and intuitioni stic modal logics in a similar fashion. The notions of position in the areas of cuts and the polarity of po sitions likewise result immediately from the diagrammatic language that these systems are built upon. Th us diagrammatic syntax can be considered 1We ﬁnd Peirce’s own remarks suggesting that he was not keen to have (B) or (5) as rules in his modal gamma systems: “There is not much utility in a double broken cut . Yet it may be worth notice that gandgcan neither of the be inferred from the other. The outer of the two broken cuts is not only relativ e to a state of information but to a state of reﬂection. The gra ph gasserts that it is possible that the truth of the graph gis necessary. It is only because I have not sufﬁciently reﬂec ted upon the subject that I can have any doubt of whether it is so or not” (R 467, 1903). The rule (5) uses a principle that is contrary to Peirce’s own rules of ( T+) and ( T−). Since Peirce’s preferred interpretation of the broken cu t modality was an epistemic one, he would not have recommended (5) as a good rule for knowl edge. The previous quotation indeed continues as follows: “It becomes evident, in this way, that a modal proposition is a simple assertion not about the universe of things but about the universe of facts that one is in a state of information sufﬁci ent to know. The graph gwithout any selective, merely asserts that there is a possible state of information in which the kno wer is not in a condition to know that the graph gis true, while g asserts that there is no such possible state of information” .\n102 Graphical Sequent Calculi for Modal Logics to be an advantage when compared to languages and notations t hat are used in other deep inference systems. Labels are likewise not needed. As to some other future work, the speciﬁc sense of the cut-eli mination process suggests that there are interesting decision procedures that we can get from pro of searches in the proposed calculi. The desirable property is the subformula property, as well as a s yntactic calculation of interpolants, among others. Acknowledgements. We want to thank the three reviewers for their helpful commen ts. The work of the ﬁrst author is supported by the Chinese National Found ation for Social Sciences and Humani- ties (grant no. 16CZX049). The work of the second author is su pported by the Academy of Finland (project 1270335) and the Estonian Research Council (proje ct PUT 1305) (Principle Investigator A.-V . Pietarinen). References [1] G. Allwein and J. Barwise (eds.) Logical Reasoning with Diagrams . Oxford University Press, 1996. [2] A. Avron. The method of hypersequents in the proof theory of propositional non-classical logics. In: W. Hodges, M. Hyland, C. Steinhorn, J. Truss (eds.) Logic: From Foundations to Applications . Proceedings of the Logic Colloquium, Keele, UK, 1993, pp. 1–32. Oxford Univ ersity Press, New York, 1996. [3] N. D. Belnap. Display logic. Journal of Philosophical Logic , 11:375–417, 1982. doi:10.1007/BF00284976. [4] H. van den Berg. Modal logics for conceptual graphs. In: Proceedings of First International Conference on Conceptual Structures . LNAI, vol. 699, pp. 413-429. Springer-Verlag, Berlin, 199 3. [5] T. Bra¨ uner. Peircean graphs for the modal logic S5. In: M .-L. Mugnier and M. Chein (eds.), Conceptural Structures: Theory, Tools and Applications, Proceedings o f Sixth International Conference on Conceptual Structures . LNAI, vol. 1453, pp. 255–269. Springer-Verlag, Berlin, 19 98. doi:10.1007/BFb0054919 [6] T. Bra¨ uner and P. Øhrstrøm. Towards a diagrammatic form ulation of modal and temporal logic. In: F. Daoud (ed.), Working notes of AAAI’99 Fall Symposium on Modal and Tempora l Logic-based Planning for Open Networked Multimedia Systems . AAAI, pp. 61–67. AAAI Press, North Falmouth, 1999. [7] K. Br¨ unnler. Deep inference and symmetry in classical proofs . PhD thesis, Technische Universit¨ at Dresden, 2003. [8] K. Br¨ unnler. Deep sequent systems for modal logic. Archive for Mathematical Logic , 48:551–577, 2009. doi:10.1007/s00153-009-0137-3 [9] M. Ma and A.-V . Pietarinen. Peirce’s sequent proofs of di stributivity. In: S. Ghosh and S. Prasad (eds.), Logic and Its Applications: Proceedings of the 7th Indian Lo gic Conference , LNCS 10119, 2017. doi:10.1007/978-3-662-54069-5 13. [10] S. Nergi. Proof analysis in modal logic. Journal of Philosophical Logic , 34:507–544, 2005. [11] C. S. Peirce. Lowell Lectures of 1903. Lecture IV . Manuscript at the Houghton Library of Harvard University, 1903. (R 467) [12] C. S. Peirce. Lowell Lectures of 1903. Syllabus for Certain Topics of Logi c. Manuscript at the Houghton Library of Harvard University, 1903. (R 478) [13] A.-V . Pietarinen. Peirce’s diagrammatic logic in IF pe rspective. In: A. Blackwell, K. Marriott and A. Shimojima (eds.), Diagrammatic Representation and Inference: Third Interna tional Conference, Diagrams 2004 . LNAI, vol. 2980, pp. 97–111. Springer-Verlag, Berlin, 200 4. doi:10.1007/978-3-540-25931-2 11 [14] A.-V . Pietarinen. Signs of Logic: Peircean Themes on the Philosophy of Languag e, Games, and Communi- cation , Springer, Dordrecht, 2006.\nM. Ma and A.-V . Pietarinen 103 [15] A.-V . Pietarinen. Moving Pictures of Thought II: Graph s, Games, and Pragmaticism’s Proof. Semiotica , 2011(186), 315–331, 2011. doi:10.1515/semi.2011.058 [16] A.-V . Pietarinen. Extensions of Euler Diagrams in Peir ce’s Four Manuscripts on Logical Graphs. In: M. Jamnik, Y . Uesaka and S. E. Schwartz (eds.), Diagrammatic Representation and Inference: Ninth In- ternational Conference, Diagrams 2016 . LNAI, vol. 9781, pp. 139–156. Springer-Verlag, Berlin, 20 16. doi:10.1007/978-3-319-42333-3 11 [17] D. D. Roberts. The Existential Graphs of Charles S. Peirce . Mouton, The Hague, 1973. [18] J. Seligman. The Logic of Correct Description. In: M. de Rijke (ed.), Advances in Intensional Logic , pp. 107-135. Kluwer, Dordrecht, 1997. doi:10.1007/978-94-01 5-8879-9 5 [19] L. Straßburger. Deep Inference for Hybrid Logic. Proceedings of International Workshop of Hybrid Logic 2007 , pp. 13–22. [20] J. F. Sowa. Conceptual Structures: Information Processing in Mind and Machine . Addison-Wesley, Reading, 1984. doi:10.1016/0004-3702(88)90069-0 [21] C. Stewart and P. Stouppa. A systematic proof theory for several modal logics. In: R. Schmidt, I. Pratt- Hartmann, M. Reynolds and H. Wansing (eds.). Advances in Modal Logic , vol. 5, pp. 309–333. King’s Col- lege Publications, London, 2005. [22] P. Stouppa. A deep inference system for the modal logic S 5.Studia Logica , 85(2):199–214, 2007. doi:10.1007/s11225-007-9028-y [23] H. Wansing. Sequent systems for modal logics. In: Gabba y, D., Guenther, F. (eds.) Handbook of Philosoph- ical Logic , vol. 8, 2nd edition, pp. 61–145. Kluwer, Dordrecht, 2002. d oi:10.1007/978-94-010-0387-2 2 [24] J. Zeman. The Graphical Logic of Charles S. Peirce . Ph.D. dissertation. University of Chicago, 1964. [25] J. Zeman. Peirce’s Graphs . In: D. Lukose et al. (eds), Proceedings of Fifth International Conference on Conceptual Structures , LNCS 1257, pp. 12–24. Springer-Verlag, Berlin, 1997. doi: 10.1007/BFb0027877\n",
  "metadata": {
    "paper_id": "1703.02197v1",
    "downloaded_at": "2025-08-24T21:03:47.256510+00:00"
  },
  "processed_at": "2025-08-24T21:03:47.256528+00:00"
}