{
  "content": "Graphical Games and Decomposition? Laura Arditti\u0003Giacomo Como\u0003Fabio Fagnani\u0003 \u0003Department of Mathematical Sciences, Politecnico di Torino Corso Duca degli Abruzzi 24, 10129 Torino, Italy (e-mail:flaura.arditti,giacomo.como,fabio.fagnani g@polito.it). Abstract: We consider graphical games as introduced by Kearns et al. (2001). First we analyse the interaction of graphicality with a notion of strategic equivalence of games, providing a minimal complexity graphical description for games. Then we study the interplay between graphicality and the classical decomposition of games proposed by Candogan et al. (2011), characterizing the graphical properties of each part of the decomposition. Keywords: Game theory, Graph theoretic models, Interconnected systems, Networks, Networked Systems. 1. INTRODUCTION Graphical games, which were rst introduced in Kearns et al. (2001), are games equipped with a network structure among players that speci es the pattern of dependence of their utilities. More precisely, in a graphical game the utility of a player is made to depend only on her own action and the action of her out-neighbour players. They have recently become prominent as a unifying theory to study the emergence of global phenomena in socio-economic net- works like peer e ects, technology adoption, and consensus formation (Jackson and Zenou (2015)). They are also a natural model in engineering and computer science to describe the interactions in multi-agent systems and a powerful tool to design distributed algorithms (Daskalakis and Papadimitriou (2006)). While there is already a large amount of literature focusing on speci c graphical games (e.g. coordination and anti- coordination games), it is still missing a general theory. How the graphicality of a game re ects on its properties is still largely unexplored. A remarkable exception is constituted by the paper by Babichenko and Tamuz (2016) where authors prove that a potential graphical game admits a potential re ecting the graphical structure, that can be decomposed as a sum of terms de ned on the cliques of the graph. For non potential games, at the best of our knowledge, there is no such general analysis. In this paper we focus on a concept of strategic equivalence for games and on a classical decomposition of games in terms of non-strategic, potential and harmonic parts introduced in Candogan et al. (2011). An analysis of some strategical aspects of such decomposition has been carried out in Abdou et al. (2019) where authors point out some drawback of it and propose a generalization to overcome those issues. In our work, instead, we undertake a fundamental analysis on how such concepts interact with the graphicality of a game. ?This work was partially supported by MIUR grant Dipartimenti di Eccellenza 2018{2022 [CUP: E11G18000350001].In many contexts, it is natural to consider games up to strategic equivalence, meaning that we are only concerned with variations of the utility of a player when she modi es her action rather then their absolute values. This is typical in technological contexts where the game is the result of an explicit design rather then an intrinsic model. Classical evolutionary dynamics associated to games like the best- response dynamics or the log-likelihood dynamics are invariant with respect to this equivalence. Our rst result, Corollary 2, determines the minimal graph with respect to which a game is graphical up to strategic equivalence. It is a sort of minimal complexity result showing that certain interactions in the game are ctitious and can consequently be removed. Our main results regard the way the decomposition re ects the graphicality of a game. While the non-strategic part is always graphical with respect to the same graph than the original game, the same is not true in general for the potential and harmonic parts that are instead graphical with respect to a larger graph where out-neighbourhoods have become cliques. Intuitively, this means that there are short range hidden strategic interactions which involve only players that directly in uence the utility of some common player in G. This is the content of our main result, Theorem 4. This \\interaction enlargement\" not always happens and we show that for the important class of pairwise-separable graphical games (where utility of players is the sum of utilities of 2-players games played with their neighbours) actually the potential and harmonic components maintain the original graphicality on G. We present an explicit example where this phenomenon shows up. 2. GRAPHICAL GAMES AND STRATEGIC EQUIVALENCE 2.1 Graph-theoretic notation A (directed) graph G= (V;E) is the pair of a nite node setVand a link setE\u0012V\u0002V , whereby a link ( i;j)2E is meant as directed from its tail node ito its head nodearXiv:2003.13123v1 [cs.GT] 29 Mar 2020\nj. We shall assume that the graph Gcontains no sel oops, i.e., that (i;i)=2E for everyi2V and we shall denote byNi=fj2 V : (i;j)2 Eg andN\u000f i=Ni[fig the open and, respectively, closed out-neighbourhoods of a nodeiinG. The intersection of two graphs G1= (V;E1) andG2= (V;E2) is the graphG1\\G2= (V;E) where E=E1\\E2. Note that we shall consider undirected graphs as a special case where ( i;j)2Eif and only of ( j;i)2E. We shall often consider certain supergraphs of a graph G= (V;E), all undirected and obtained by keeping the same node setVand augmenting the link set Eas follows. First, letG$= (V;E$) where E$=E[f (j;i) : (i;j)2Eg be the graph obtained by making all links in Gundirected. On the other hand, let G4= (V;E4) be the graph whose link setE4is obtained from Eby adding links among all pair of outneighbours of every node, i.e., E4=E$[[ i2Vf(j;l) :j6=l2Nig: In fact, we shall consider a more general notion of exten- sion of a graphG= (V;E) de ned as follows. Consider a covering Ni=ki[ h=1Sh i (1) of the open neighbourhood of each node i2V. We denote the array of such coverings as S=fSh igi2V;1\u0014h\u0014ki, and we callSasplitting ofG. Then, de ne the graph GS= (V;ES) with the same node set as Gand link set ES=E$[[ i2Vki[ h=1\b (j;l) :j6=l2Sh i : Observe thatG$andG4are special cases of GSwhen, for every node i2V,ki=jNijandSh iare all singletons, and respectively, when ki= 1 andS1 i=Ni. 2.2 Graphical games Throughout the paper, we shall consider strategic form games with a nite set of players V, where each player i2V has nite action set Ai. We shall denote by X=Q i2VAithe space of all players' strategy pro les. For a playeri2V, letX\u0000i=Q j2Vnf igAjbe the set of strategy pro les of all players except for i. As customary, for a strategy pro le x2X, the strategy pro le of all players except foriis denoted by x\u0000i2X\u0000i. When two strategy pro lesx;y2X coincide except for possibly in their i-th entry, i.e., when x\u0000i=y\u0000i, we shall say that xandyare i-comparable and we shall write x\u0018iy. Let each player i2Vbe equipped with a utility function ui:X !R. We shall identify a game with player set V and strategy pro le space Xwith the vector uassembling all the players' utilities. Notice that, in this way, the set of all games with player set Vand strategy pro le space X, to be denoted by \u0000, is isomorphic to the vector space RV\u0002X. Graphical games (Kearns et al. (2001)) are de ned im- posing suitable restrictions on the way utilities depend on strategies. Precisely, a game uis said to be graphical on a graphG= (V;E) (or, brie y, aG-game ) if the utility ofeach player i2Vdepends only on her own action and the actions of fellow players in her neighbourhood in G, i.e., if ui(x) =ui(y);8x;y2X s.t.xNi=yNi:(2) Notice that if a game uis graphical with respect to two graphsG1= (V;E1) andG2= (V;E2), it is also graphical with respect toG1\\G2. Considering that every game u is trivially graphical on the complete graph on V, we can conclude that to each game u2\u0000 one can always associate the smallest graph on which uis graphical. We shall refer to such graph as the minimal graph of the game uand denote it asGu. A special case of graphical games are the pairwise- separable graphical games (cf. Daskalakis and Papadim- itriou (2009); Cai and Daskalakis (2011)) whereby, for a given graphG= (V;E), the utility of player i2Vis in the form ui(x) =X j2Niuij(xi;xj)8x2X; (3) whereuij:Ai\u0002A j!Rfori;j2E. Notice that the utilities in (3) clearly de ne a G-game. In fact, such a game can be interpreted as one in which the players are located at the nodes of Gwhose links are to be interpreted as two-player games between their endpoints (with the convention that uji(xj;xi) = 0 for every ( j;i)=2E such that (i;j)2E). Every player i2V can chose a unique actionxi2Aito be used in all games she simultaneously participates in and gets a utility that is the aggregate of the utilities from all her outgoing links. Every graphical game possesses some separability proper- ties, pairwise separability being the nest possible case. It is then useful to treat in a uni ed way all graphical games by introducing the notion of S-separability. More precisely, given aG-gameuand a splittingS=fSh igi2V;1\u0014h\u0014kiof G, we say that the game uisS-separable if for every player i2Vthe utility function can be decomposed as ui=u0 i+kiX h=1uh i; (4) whereu0 idepends only on the actions of players in Ni, i.e., u0 i(x) =u0 i(y) ifxNi=yNiand each term uh idepends only on the action of iitself and of players in Sh i, i.e.,uh i(x) = uh i(y) ifxi=yiandxSh i=ySh i. Separable graphical games are an extension of pairwise-separable graphical games, where we consider that players have separate interactions with di erent groups of their neighbours. Such partition of their neighbourhoods is described by the splitting S. 2.3 Strategic equivalence and graphicality A gameuis referred to as non-strategic if the utility of each player i2Vdoes not depend on her own action, i.e., if ui(x) =ui(y);8x;y2X s.t.y\u0018ix: (5) The set of non-strategic games will be denoted by N. Two gamesuand ~uare referred to as strategically equivalent if their di erence is a non-strategic game, i.e., if ui(x)\u0000~ui(x) =ui(y)\u0000~ui(y);8x;y2X s.t.y\u0018ix:(6) Strategic equivalence is in fact an equivalence relation on games and we shall denote the strategic equivalence class of a game uby [u]. It follows from the de nition that\nstrategically equivalent games are separable with respect to the same splittings. A gameuis referred to as normalized ifX y\u0018ixui(y) = 0;8x2X;i2V: (7) For a game u, one can de ne its normalized version as the gameuwith utilities ui(x) =ui(x)\u00001 jX\u0000ijX y\u0018ixui(y);8x2X;i2V:(8) It is then easily veri ed that the game uis both normalized and strategically equivalent to u. In fact,uis the unique normalized game in the class [ u] (Candogan et al., 2011, Lemma 4.6.). Two strategically equivalent games uand ~umight have quite di erent minimal graphs GuandG~u. Indeed, it is easy to see that every game uadmits a strategically equivalent game ~usuch thatG~uis the complete graph. It is then less obvious that a strategic equivalence class [ u] always contains a game whose minimal graph is contained in the minimal graph of every other game ~ uin [u]. This property turns out to hold true, as a consequence of the following result. Proposition 1. Letube a game, uits normalized version. Then, Gu\u0012Gu: (9) The following is a direct consequence of Proposition 1 and of the fact that the normalized version of any strategically equivalent game ~ u2[u] coincides with the normalized versionuofu. Corollary 2. Letube a game, uits normalized version. Then, Gu\u0012G ~u: (10) for every strategically equivalent game ~ u2[u]. Corollary 2 implies that there exists a game in [ u] that is graphical on the intersection G[u]=\\ ~u2[u]G~u of the minimal graphs of all the strategically equivalent games [u]. In fact, the graph G[u]=Gu may be interpreted as the minimal topological complexity needed to represent a game in the class [ u], namely a game up to non-strategic equivalence. 3. DECOMPOSITION OF GRAPHICAL GAMES We now introduce the two classes of potential games (Mon- derer and Shapley (1996)) and harmonic games (Candogan et al. (2011)). A game u2\u0000 is as an (exact) potential game if there exists a function :X!Rsuch that ui(x)\u0000ui(y) = (x)\u0000 (y);8i2V;8x\u0018iy2X;(11) whileu2\u0000 is an harmonic game ifX i2VX y\u0018ix[ui(x)\u0000ui(y)] = 0;8x2X: (12) Notice that a normalized game is harmonic if and only ifX i2VjAijui(x) = 0;8x2X: (13)Hence, in particular, if the action sets of all players have the same cardinality jAij=a, then a normalized game u is harmonic if and only if it is a 0- sum game , i.e.,X i2Vui(x) = 0;8x2X: (14) Babichenko and Tamuz (2016) showed that the potential of a potentialG-game possesses a special structure that re ects the one of the underlying graph G. Corollary 2 allows us to improve such result by re ning the decompo- sition proposed therein. Indeed, all strategically equivalent games to a potential game uare still potential with the same potential function. So the graphical structure of the potential is determined by the smallest graphG[u]. Corollary 3. Letube a potentialG-game with potential . Then can be decomposed as (x) =X C2C(G[u]) C(xC) (15) for some functions C: \u0005i2CAi!Rcalled local potentials and whereC(G[u]) is the set of maximal cliques of G[u]. It has been proven in (Candogan et al., 2011, Theorem 4.1.) that the space of games can be decomposed as a direct sumP\bN\bH , wherePis the space of normalized potential games, Nis the space of non-strategic games, His the space of normalized harmonic games. We are interested in characterizing graphicality properties of such decomposition. In particular, our main result, stated as Theorem 4 below, provides a generalization and re nement of the one in Candogan et al. (2011). Theorem 4. A nite game u2\u0000 isS-separable if and only if it can be decomposed as u=uN+uP+uH; where \u000fuNis a non-strategic Gu-game; \u000fuPis a normalizedS-separable potential GS [u]-game; \u000fuHis a normalizedS-separable harmonic GS [u]-game. Here we state a few direct consequences of Theorem 4. First, recall that, for every splitting SofG[u], we have thatGS [u]\u0012G4 [u], so that Theorem 4 directly implies the following. Corollary 5. Every nite game u2\u0000 can be decomposed as u=uN+uP+uH; where \u000fuNis a non-strategic Gu-game; \u000fuPis a normalized potential G4 [u]-game; \u000fuHis a normalized harmonic G4 [u]-game. Corollary 5 implies that GuPandGuHare subgraphs of G4 [u]. So, in general, the decomposition does not preserve graphicality, but in the graphs describing the interactions among players in the potential and harmonic component of a gameuthere may be a direct in uence only among players which belong to a common out-neighbourhood inG[u]. Comparing Theorem 4 and Corollary 5 we see that the separated dependence of utility functions on\nFig. 1. Interaction graph Gfor example 3.1. Fig. 2. Minimal graphs associated to the potential (left) and harmonic (right) component of the game in example 3.1 (up to strategic equivalence) neighbours allows to exclude the presence in the potential and harmonic component of direct interactions between players belonging to di erent groups. In fact, often the graphGS [u]is much smaller than G4 [u]. In particular, for the special case of pairwise-separable graphical games, Theorem 4 implies the following result. Corollary 6. Letu2\u0000 be a pairwise-separable graphical game on a graph G= (V;E), with utilities as in (3). Then, u=uN+uP+uHwhere \u000fuNis a non-strategic G-game; \u000fuPis a pairwise-separable normalized potential G$- game; \u000fuHis a pairwise-separable normalized harmonic G$- game. This result shows that for pairwise-separable graphical games the decomposition in potential and harmonic part preserves the original graphical structure as it does not create any link between players that were not directly interacting in the original game. 3.1 Example As an example of the results, consider the following G- game. Eight players connected through the graph Gas in Figure 1 decide of acquiring (action 1) or not acquiring (action 0) some good. All players but one are assumed to have an imitative behaviour, in that they just bene t from taking the same action as the majority of their neighbours. Accordingly, they play a majority game, with utility functions ui(x) =jfj2Ni:xj=xigji= 2;:::; 8: Player 1 plays a so called \\public good game\",8 < :u1(x) = 1\u0000cifx1= 1 u1(x) = 1 if x1= 0;xj= 1 for some j2N(1) u1(x) = 0 if x1= 0;xj= 0 for allj2N(1); i.e., she prefers to borrow the good from some of her neighbours rather than buying it and paying the cost c. Figure 2 shows the minimal graphs associated to the po- tential and harmonic components of the game. Accordingto the theorem, they are subgraphs of G4and in this case they are proper subgraphs. Actually we see some additional feature of the decomposition. The game is not potential but is indeed a local perturbation of a potential game, the majority game: the locality of the perturbation is preserved by the decomposition. Indeed, we see that players which are far from the perturbation are only linked in the graph of the potential component and that the only additional edges with respect to Gare between neighbours of player 1. 4. CONCLUSION We analysed the interaction between graphicality and strategic equivalence, proving the remarkable fact that there exists a minimal graph associated to a game up to strategic equivalence. The core of our analysis has been the understanding of the interplay between graphicality and decomposition, yielding our major result which shows that the potential and harmonic components of a game u are graphical games with respect to the undirected graph G4 [u]. Current work includes the interpretation of the role of hidden strategic interactions and the application of these techniques to the theory of Markov Random Fields (in the spirit of Babichenko and Tamuz (2016)) and as a tool for studying Nash equilibria of perturbations of potential games. REFERENCES Abdou, J., Pnevmatikos, N., Scarsini, M., and Venel, X. (2019). Decomposition of games: some strategic considerations. arXiv:1901.06048 . Babichenko, Y. and Tamuz, O. (2016). Graphical potential games. Journal of Economic Theory , 163, 889{899. Cai, Y. and Daskalakis, C. (2011). On minmax theorems for multiplayer games. In Proceeding Proceedings of the twenty-second annual ACM-SIAM symposium on Discrete algorithms (SODA '11) , 217{234. Candogan, O., Menache, I., Ozdaglar, A., and Parrilo, P. (2011). Flows and decompositions of games: Harmonic and potential games. Mathematics of Operations Re- search , 36(3), 474{503. Daskalakis, C. and Papadimitriou, C. (2006). Computing pure Nash equilibria in graphical games via Markov ran- dom elds. In Proceedings of the 7th ACM Conference on Electronic Commerce , 91{99. Daskalakis, C. and Papadimitriou, C. (2009). On a network generalization of the minmax theorem. In Proceedings of the 36th Internatilonal Collogquium on Automata, Languages and Programming (ICALP '09): Part II , 423{434. Jackson, M.O. and Zenou, Y. (2015). Handbook of game theory with economic applications , volume 4, chapter Games on networks, 95{163. Elsevier. Kearns, M., Littman, M.L., and Singh, S. (2001). Graph- ical models for game theory. In Proceedings of the Seventeenth Conference on Uncertainty in Arti cial In- telligence (UAI2001) , 253{260. Monderer, D. and Shapley, L. (1996). Potential games. Games and Economic Behavior , 14, 124{143.\n",
  "metadata": {
    "paper_id": "2003.13123v1",
    "downloaded_at": "2025-08-24T21:19:45.833391+00:00"
  },
  "processed_at": "2025-08-24T21:19:45.833414+00:00"
}