{
  "content": "arXiv:2108.01611v4 [math.FA] 16 Jun 2022FACIAL STRUCTURE OF MATRIX CONVEX SETS IGOR KLEP AND TEA ˇSTREKELJ Abstract. This article investigates the notions of exposed points and (expose d) faces in the matrix convex setting. Matrix exposed points in ﬁnite dimension s were ﬁrst deﬁned by Kriel in 2019. Here this notion is extended to matrix conve x sets in inﬁnite- dimensional vectorspaces. Then aconnectionbetween matrixexp osed pointsand matrix extreme points is established: a matrix extreme point is ordinary exp osed if and only if it is matrix exposed. This leads to a Krein-Milman type result for matrix exposed points that is due to Straszewicz-Klee in classical convexity: a compact ma trix convex set is the closed matrix convex hull of its matrix exposed points. Severalnotions of a ﬁxed-level as well as a multicomponent matrix f ace and matrix ex- posed face are introduced to extend the concepts of a matrix ext reme point and a matrix exposedpoint,respectively. Theirpropertiesresemblethoseof( exposed)facesintheclas- sical sense, e.g., it is shown that the C∗-extreme (matrix extreme) points of a matrix face (matrix multiface) of a matrix convex set Kare matrix extreme in K. As in the case of extreme points, anyﬁxed-level matrix face is ordinaryexposedif a nd only if it is a matrix exposed face. From this it follows that every ﬁxed-level matrix fac e of a free spectrahe- dron is matrix exposed. On the other hand, matrix multifaces give ris e to the noncom- mutative counterpart of the classical theory connecting (archim edean) faces of compact convex sets and (archimedean) order ideals of the corresponding function systems. Contents 1. Introduction ...................................... ............................ 2 1.1. Matrix convex sets ................................. ..................... 2 1.1.1. Matrix extreme points .............................. ............... 4 1.1.2. Matrix exposed points .............................. ............... 4 1.2. Main results ....................................... ...................... 4 1.2.1. Exposed points of state spaces...................... ............... 5 1.2.2. Matrix faces and matrix exposed faces................. ........... 6 1.2.3. Matrix multifaces and matrix exposed multifaces........... ...... 7 1.3. Reader’s guide..................................... ...................... 9 Acknowledgments..................................... ......................... 9 2. Preliminaries........................................ .......................... 9 2.1. Free spectrahedra ................................ ....................... 11 3. Matrix exposed points................................ ........................ 11 3.1. Deﬁnition and basic properties......................... ................. 12 3.2. Interplay between matrix extreme points and matrix exposed p oints.. 13 2020Mathematics Subject Classiﬁcation. 46N10, 47L07, 52A30. Key words and phrases. matrix convex set, matrix extreme point, matrix exposed point, ma trix face, matrix exposed face, Straszewicz–Klee theorem, free spectrah edron. IK was supported by the Slovenian Research Agency grants J1-24 53, N1-0217, J1-3004 and P1-0222. This is a part of the PhD thesis written by the second author under t he supervision of the ﬁrst author at the University of Ljubljana, Faculty of Mathematics and Physics . 1\n2 IGOR KLEP AND TEA ˇSTREKELJ 3.3. Straszewicz-Klee theorem for matrix convex sets......... .............. 20 3.4. Matrix exposed points of matrix state spaces ............. ............. 24 4. Matrix faces and matrix exposed faces................... .................... 26 4.1. Fixed-level matrix faces............................. .................... 26 4.2. Matrix exposed faces............................... ..................... 29 4.3. Interplay between matrix faces and matrix exposed faces... ........... 31 4.3.1. Matrix faces and matrix exposed faces in free spectrahedra ...... 34 5. Multilevel matrix faces ................................ ....................... 35 5.1. Matrix multifaces................................... ..................... 35 5.2. Matrix exposed multifaces ............................ .................. 40 5.2.1. Interplaybetweenmatrixmultifacesandmatrixexposedmultif aces 41 References......................................... ................................ 42 1.Introduction In the classical theory of convexity an important role is played by dis tinguished points andsubsets of therelative boundaryof a convex set. The extrem e points ext Cofa convex setCin a locally convex vector space are those points c∈Cthat cannot be expressed as a nontrivial convex combination of the elements of C.Equivalently, the set C\\{c}is convex. Geometrically, any line with an extreme point in its relative interior has a t least one of its endpoints outside C.A compact convex set Cis the closed convex hull of ext Cby the Krein-Milmantheorem[ Bar02,SectionIII.4],sointhiscasetheextremepointsgenerate C. Another type of boundary points of interest are the exposed poin ts expC.These are the ones that can beweakly separated from Cby anaﬃne hyperplane andthey areeasily seen tobe extreme. In(ﬁnite-dimensional) polyhedra the exposed ande xtreme pointscoincide, but in general the exposed points form a proper subset of the ext reme boundary. If Cis a compactconvex setinanormedvectorspace, theexposedpoints alsorecover Castheyare dense in ext Cby the Straszewicz theorem (see [ Bar02, Section II.2] and [ Kle58]). Hence a compactconvexsetinanormedvectorspaceistheclosedconvex h ullofitsexposedpoints. Extending the concept of extremeness from points to sets leads t o the notion of faces. A faceF⊆Cis a convex subset that contains the endpoints of all the lines in Cwhich intersect the relative interior of F. Equivalently, faces are those subsets FofCfor which C\\Fis convex. Trivially, ∅andCare faces, but any other proper face F⊂noteqlCis contained in the relative boundary of C. If the face Fis a singleton {x}, thenxis an extreme point, meaning that faces extend the concept of extreme points to sets . A key feature of faces is that their extreme points are extreme in the convex set they are contained in. This property features prominently in the proof of the Krein-Milman the orem. In this article these notions are explored in the matrix convex setting. 1.1.Matrix convex sets. Matrix convex sets are the noncommutative counterpart to clas- sicalconvexsets, andwereﬁrstintroducedbyWittstock[ Wit84]. Astheyarecategorically dual to operator systems [ WW99, Proposition 3.5], they introduce convex-geometric ideas and tools to the study operator systems. A Hahn-Banach separa tion theorem for matrix convex sets was proved by Eﬀros-Winkler [ EW97], the matricial Krein-Milman theorem\nFACIAL STRUCTURE OF MATRIX CONVEX SETS 3 is due to Webster-Winkler [ WW99], and further fundamental results were developed re- cently by a plethora of authors: representations of convex sets by linear matrix inequal- ities [HV07,HM12,FNT17], further results on free spectrahedra including the convex Positivstellensatz [ HKM12], inclusion problems and dilation theory [ HKM13,DDOSS17 , HL21], minimal and maximal matrix convex sets [ PSS18] and matrix convex hull approx- imation [ HKM16], (absolute) extreme points of matrix convex sets and free spect rahedra [EHKM18 ,EH19] and matrix exposed points of free spectrahedra [ Kri19], the theory of C∗-convexity, i.e., ﬁxed-dimension matrix convexity, via operator sys tems and the corre- spondence between C∗-extreme points and pure states [ FM97,Far04,Mag16], noncom- mutative Choquet theory [ DK+] and the connection between nonunital operator systems and noncommutative (nc) convex sets [ KKM+], the correspondence between compact rectangular matrix convex sets and operator spaces [ FHL18], etc. LetVbe a complex vector space with predual space V′.We will usually refer to Vas a dual vector space without explicitly mentioning the predual V′.Denote byMm,n(V) the space ofm×nmatrices over Vand use the abbreviation Mn(V) =Mn,n(V).To simplify notation we write Mm,n=Mm,n(C),Mn=Mn,n(C),andIn∈Mnfor the identity matrix. Unless mentioned otherwise, we endow Vwith the weak topology and the corresponding matrix spaces with the product topology. We say a set S= (Sn)n∈N⊆(Mn(V))n∈N is closed (compact) if it is levelwise closed (compact), i.e., each compon entSnis closed (compact). Deﬁnition 1.1. Suppose for each n∈Nthe setKnis a subset of Mn(V) and denote by Kthe graded family ( Kn)n∈N. (a) LetA1,...,A k∈KwithAi∈Kni. An expression of the form (1.1)k∑ i=1γ∗ iAiγi, whereγi∈Mni,nare complex matrices with∑textk i=1γ∗ iγi=In, is amatrix convex combi- nationof the points A1,...,A k. (b)Wecall Kamatrixconvexset inVifitisclosedundermatrixconvexcombinations. (c) A setC⊆Mn(V) is aC∗-convex set if it is closed under formation of C∗-convex combinations , i.e., matrix convex combinations ( 1.1) withAi∈Candγi∈Mn. Equivalently, aset Kismatrixconvex ifandonlyifitisclosedunderformationofdirect sums and conjugations by isometries. If 0 ∈K1,thenKis closed under conjugations by arbitrary contractions (see Proposition 2.3below for a proof of this simple observation). Note that for a matrix convex set K, eachKnis a convex set in the classical sense. For any graded set S= (Sn)n∈NwithSn⊆Mn(V),the intersection of all matrix convex sets containing Sis called the matrix convex hull ofSand is denoted by mconv S. Its closure is denoted by mconvS. Deﬁnition 1.2. A morphism between matrix convex sets KandLover spaces VandW respectively, a matrix aﬃne map , is a continuous linear map Φ : V→Wthat satisﬁes Φr(Kr)⊆Lrfor allr∈Nand Φr(gk∑ i=1γ∗ iAiγi)g =k∑ i=1(γ∗ i⊗Ir)Φri(Ai)(γi⊗Ir) for allk-tuples (Ai)k i=1and (γi)k i=1such thatAi∈Kriandγi∈Mri,rfori= 1,...,kwith the property∑textk i=1γ∗ iγi=Ir. Here for any positive integer randB= (Bi,j)∈Mr(V) we\n4 IGOR KLEP AND TEA ˇSTREKELJ denote by Φr(B) =( Φ(Bi,j)) ther-thampliation of Φ.We call Φ a matrix aﬃne homeomorphism if each of the Φ ris a homeomorphism. 1.1.1.Matrix extreme points. We recall the deﬁnition of the matrix counterparts of classi- cal extreme points: matrix extreme points were introduced by Web ster-Winkler [ WW99], whileC∗-extreme points already appeared earlier in [ FM97]. Deﬁnition 1.3. LetKbe a matrix convex set. (a) A matrix convex combination ( 1.1) isproperif all of the matrices γiare onto. (b) A point A∈Knismatrix extreme if from any expression of Aas a proper matrix convex combination of elements Ai∈Kniit follows that ni=nand each of the Aiis unitarily equivalent to A. (c) A point A∈Knis aC∗-extreme point if any expression of Aas a proper C∗-convex combination of elements Ai∈Knimplies each of the Aiis unitarily equivalent to A. Any matrix extreme point of a compact matrix convex set is extreme in the classical sense by [ WW99, Corollary 3.6]. This also holds for non-compact sets; it is e.g. an easy corollary of the characterization [ EHKM18 , Proposition 4.6] (see also [ HL21]). 1.1.2.Matrix exposed points. In this paper we study the notions of exposed points and (exposed) faces in the matrix convex setting. While matrix exposed points in the ﬁnite dimensional setting were ﬁrst introduced by Kriel [ Kri19], in Section 3we generalize the notion to arbitrary, inﬁnite-dimensional vector spaces, and then investigate their proper- ties and streamline some of the arguments appearing in [ Kri19]. Deﬁnition 3.1.LetK= (Kn)n∈Nbe a matrix convex set in a dual vector space V.An ele- mentA∈Knis called a matrix exposed point ofKif there exist a continuous linear map Φ :V→Mnand a self-adjoint matrix α∈Mnsuch that the following conditions hold: (a) for all positive integers randB∈Krwe have Φ r(B)/precedesequalα⊗Ir; (b){B∈Kn|α⊗In−Φn(B)/{ollowsequal0 singular }={U∗AU|U∈Mnunitary}. It is straightforward that any exposed point in the classical sense is extreme, although the proof of the matricial analogue, stated as Proposition 3.5, is more involved, and needs some careful preliminary observations on the exposing map Φ given in Proposition 3.4. As expected, matrix exposed points form a proper subset of the m atrix extreme points in general (Example 3.6). 1.2.Mainresults. InspiredbytheEﬀros-WinklermatricialHahn-Banachseparationt ech- niques developed in [ EW97], we establish our ﬁrst main result, Theorem A, giving the precise connection between matrix extreme points and matrix expo sed points via classical exposed points. Theorem A. LetK= (Kn)n∈Nbe a matrix convex set. Then a point A∈Knis matrix exposed if and only if it is a matrix extreme point, which is ordinary expo sed inKn. The part of Theorem Aasserting that matrix exposed points are matrix extreme is the above mentioned Proposition 3.5, while the remaining claims are stated and proved separately as Theorem 3.8. Here the idea in [ Kri19] of introducing non-archimedean real closed ﬁelds is key to allow the Eﬀros-Winkler separation techniques t o apply in the context of a general (not necessarily closed) matrix convex set. The idea of separating\nFACIAL STRUCTURE OF MATRIX CONVEX SETS 5 over a real closed ﬁeldextension of Ralso appearsinthetheoryofconvexity over arbitrary ordered ﬁelds, developed in [ SMR10], the related separationtechniques in [ Rob91] and the realclosedseparationtheoremforconvex setsin[ NT13]. The methodsusedintheproofof Theorem 3.8also yield an Eﬀros-Winkler type weak separation theorem for (non- closed) matrix convex sets. Corollary 3.11(Weak separation theorem for matrix convex sets) .LetKbe a matrix convex set in a dual space Vwith0∈K1andA /∈Kn.Suppose there is a continuous linear functional ϕ:Mn(V)→Cand real number a >0such that Reϕ|Kn< aand ϕ(A) =a.Then there exists a continuous linear map Φ :V→Mnsuch that In⊗Ir−ReΦr(B)≻0 for every positive integer randB∈Kr,but ker( In⊗In−ReΦn(A)) /\\e}atio\\slash={0}. The second important result in Section 3is Theorem 3.14giving a matrix analogue of the classical Straszewicz theorem [ Bar02, Section II.2], more precisely, its generalisation to compact convex sets in normed spaces due to Klee [ Kle58]. Theorem 3.14(The Straszewicz-Klee theorem for matrix convex sets ).LetKbe a compact matrix convex set in a normed vector space V.ThenmexpK/\\e}atio\\slash=∅and K=mconv(mexp K). The proof goes along the lines of the Webster-Winkler matricial Krein -Milman theorem [WW99] in combination with the techniques in [ HL21] of assigning to a matrix convex set Ka family of convex sets, whose exposed points are shown to be in cor respondence with the matrix exposed points of K. 1.2.1.Exposed points of state spaces. A (concrete) operator system Ris a closed self- adjoint subspace of the operators on a Hilbert space that contain s the identity. As before, for positive integers r,nand a linear map ϕ:R →Mn,ther-th ampliation ϕr:Mr(R)→ Mr(Mn) is deﬁned by applying ϕentrywise, i.e., ϕr( (Ai,j)) =( ϕ(Ai,j)) for (Ai,j)∈Mr(R).The mapϕiscompletely positive (cp) if for all r∈N,ther- th ampliation ϕris positive, meaning that if A∈Mr(R) is positive semideﬁnite, so is ϕr(A)∈Mr(Mn)∼=Mrn.The collection of all unital completely positive (ucp) maps from an operator system Rto the matrix spaces Mnforn∈Nis referred to as the matrix state space ofRand is easily seen to be matrix convex. In fact, it is the core example o f a compact matrix convex set by the categorical duality established in [WW99, Proposition 3.5]. Further, the matrix extreme points of the state space of an o perator system Rare precisely the pure states on R(see [Far04]). InSubsection 3.4wegivesomeinsightintothematrixexposedpointsofthematrixstat e space of an operator system R, while keeping in mind that by [ Far04, Theorem 2.2], the extreme rays in the space of cp maps on Rare determined by the matrix extreme points of the state space of R. Proposition 3.16presents the analogous connection between the exposed rays and matrix exposed points of the respective sets. I fR=Ais a separable C∗-algebra, then every matrix extreme point of the matrix state spa ce ofAis matrix exposed (Example 3.18).\n6 IGOR KLEP AND TEA ˇSTREKELJ 1.2.2.Matrix faces and matrix exposed faces. To investigate the facial structure of a ma- trix convex set Kwe discuss several possible notions of a face and an exposed face o f K. Here the main distinction is whether one considers subsets of a sing le component Kn for somen∈Nor multicomponent subsets of a matrix convex set K. Section 4ﬁrst introduces three concurrent deﬁnitions of a ﬁxed-level matrix fa ce, which aim to extend the concepts of a matrix extreme point or a matrix exposed point, a nd demonstrates their suitableness to the theory of matrix convexity. Deﬁnition 4.1.LetK= (Kr)r∈Nbe a matrix convex set in the space VandFa convex subset ofKnfor somen∈N. (a)ThenFisamatrixface ifforevery tupleofpoints A1,...,A kfromKwithAi∈Kni and every tuple of surjective matrices γi∈Mni,nsatisfying∑textk i=1γ∗ iγi=In,the condition (1.2)k∑ i=1γ∗ iAiγi∈F, impliesni=nandAi∈Ffori= 1,...,k. (b) IfFis aC∗-convex matrix face, then it is a C∗-face. (c) The set Fis aweak matrix face if for every tuple of points A1,...,A kfromKwith Ai∈Kniand every tuple of surjective matrices γi∈Mni,nsatisfying∑textk i=1γ∗ iγi=In,the condition k∑ i=1γ∗ iAiγi∈F, impliesni=nand eachAiis unitarily equivalent to some element in F.We will denote byU(F) ={U∗AU|A∈F, U∈Mnunitary}the unitary orbit of F. We show that a key hereditary property of extreme points of class ical faces has its matrix counterpart. Proposition 4.4.LetKbe a matrix convex set and F⊆Kna matrix face of any type. EveryC∗-extreme point of Fis a matrix extreme point of K. InSubsection 4.2, thecorresponding three types ofmatrixexposed faces areintr oduced. Deﬁnition 4.5.LetK= (Kr)r∈Nbe a matrix convex set in a dual vector space VandF a convex subset of Kn. (a)ThenFisamatrixexposed face ifthereexists a continuouslinear mapΦ : V→Mn and a self-adjoint matrix α∈Mnsatisfying the following conditions: (i) for every positive integer mandB∈Kmwe have Φ m(B)/precedesequalα⊗Im; (ii) for any m<nandB∈Kmwe have Φ m(B)≺α⊗Im; (iii){B∈Kn|α⊗In−Φn(B)/{ollowsequal0 is singular }=F. (b) IfFis aC∗-convex matrix exposed face, then it is a C∗-exposed face . (c) We call Faweak matrix exposed face if there exists a continuous linear map Φ :V→Mnand a self-adjoint matrix α∈Mnsatisfying the following conditions: (i) for every positive integer mandB∈Kmwe have Φ m(B)/precedesequalα⊗Im; (ii) for any m<nandB∈Kmwe have Φ m(B)≺α⊗Im; (iii){B∈Kn|α⊗In−Φn(B)/{ollowsequal0 is singular }=U(F). After adapting the observations in Proposition 3.4on the exposing maps for matrix exposed pointstothe matrixfacesetting, we prove the followingex pected, yet not entirely obvious result.\nFACIAL STRUCTURE OF MATRIX CONVEX SETS 7 Proposition 4.11.LetKbe a closed matrix convex and F⊂noteqlKna matrix exposed face of any type. Then Fis a matrix face of the corresponding type. We proceed by giving a generalisation of Theorem 3.8for faces, namely Theorem 4.12, presenting an interplay between matrix faces and matrix exposed f aces. Theorem 4.12.LetKbe a matrix convex set and F⊆Kna matrix face of any type that is also an exposed face. Then Fis a matrix exposed face of the corresponding type. Finally, Proposition 4.13and Corollary 4.14give a suﬃcient condition for a point to lie in a weak matrix face and a matrix face, respectively. This leads to a f amily of examples of weak matrix faces presented in Example 4.15. We then observe in Subsection 4.3.1 that as a corollary of Theorem 4.12, every matrix face of a free spectrahedron is matrix exposed. 1.2.3.Matrix multifaces and matrix exposed multifaces. In Section 5we discuss two as- pirant notions of a multicomponent face of a matrix convex set. The main attribute of multilevel faces is their role in the noncommutative counterpart to t he classical theory connecting (archimedean) faces of compact convex sets and (ar chimedean) order ideals of the corresponding function systems presented in [ Alf71, Section II.5]. While our aim is to extend the properties of a matrix extreme point, a n otion similar to that of a matrix multiface, but mimicking absolute extreme points ( see [EHKM18 ]), was recently explored under the name nc face in [ KKM+]. Deﬁnition 5.1.LetK= (Kr)r∈Nbeamatrixconvexsetinthespace VandF= (Fr)r∈N⊆ Ka levelwise convex subset of K. (a) Then Fis amatrix multiface if for every tuple of points A1,...,A kfromKand every tuple of surjective matrices γi∈Mni,nsatisfying∑textk i=1γ∗ iγi=In,the condition (1.3)k∑ i=1γ∗ iAiγi∈F, impliesAi∈Ffori= 1,...,k. (b) IfFis a matrix convex matrix multiface, then it is a matrix convex multiface . Inspired by [ Alf71, Section II.5] we give a family of examples of matrix convex multi- faces. For a compact matrix convex set Kwe denote by A(K) :={θ= (θn:Kn→Mn)n∈N|θcontinuous matrix aﬃne } its dual operator system, which is abstractly characterized by th e Choi-Eﬀros axioms as a matrix-ordered ∗-vector space with an Archimedean matrix order unit (see [ Pau02, Chap- ter 13]). Recall that by [ WW99, Proposition 3.5], Kis matrix aﬃnely homeomorphic to UCP(A(K)) by the evaluation map sending X∈Kto the ucp map Φ X∈UCP(A(K)), where ΦX(θ) =θ(X) for anyθ∈A(K).Now suppose Φ is a ucp map on A(K) with kernel Jand let (1.4) J⊥ n:={A∈Kn|θn(A) = 0∀θ∈J} forn∈N.We show in Example 5.3that ifJis spanned by its positive elements, i.e., J=J+−J+,thenJ⊥:= (J⊥ n)n∈Nis a matrix convex multiface of K. In Remark 5.4we then observe how this construction gives a suﬃcient condition for a point to be contained in some matrix multiface.\n8 IGOR KLEP AND TEA ˇSTREKELJ The matrix convex version of the interplay between classical faces and order ideals is stated as Proposition 5.7. Let us say that a multicomponent subset F⊆Kof a compact matrix convex set Ksatisﬁes condition ( ∗) if for each n∈Nandθ∈Mn(A(K)) with θ|F/{ollowsequal0 there is a positive element ψ∈Mn(A(K))+such that ψ/{ollowsequalθandψ|F=θ|F. Further, a ucp map Φ : A(K)→Mnis called partially order reﬂecting if it satisﬁes Φm( Mm(A(K))+) = Φm( Mm(A(K)))+ for allm∈N, i.e., for every m∈NandA∈Mm(A(K)) with Φ m(A)/{ollowsequal0 there exists a B/{ollowsequal0 such that Φ m(A) = Φm(B). Proposition 5.7.LetKbe a compact matrix convex set. (a)Letn∈NandΦ :A(K)→Mnbe a partially order reﬂecting ucp map with kernel Jspanned by its positive elements. Then J⊥⊆Kis a closed matrix convex multiface that satisﬁes condition (∗). (b)SupposeF⊆Kis a closed matrix convex multiface that satisﬁes (∗). Then J:={θ∈A(K)|θ|F= 0} is spanned by its positive elements and is the kernel of a ucp m apΦ :A(K)→ R for some operator system R,whereΦsatisﬁes the partially order reﬂecting property Φn( Mn(A(K))+) = Φn( Mn(A(K)))+for alln∈N. Example 5.9thenexplainshowevery vertex ofa simplex SinanEuclideanspace Rnlies in a matrix convex multiface of mconv( S).More precisely, each vertex deﬁnes a partially order reﬂecting evaluation map whose kernel is spanned by its posit ive elements. Next, a hereditary property of matrix extreme points is establishe d. Proposition 5.10.LetKbe a matrix convex set and F⊆Ka matrix (convex)multiface of any type. Every matrix extreme point of Fis a matrix extreme point of K. Section5.2introduces the exposed counterparts of the multilevel matrix fac es and investigates their properties. For instance, in Proposition 5.15every component of a matrix exposed multiface is shown to be an ordinary exposed face. Deﬁnition 5.12.LetK= (Kr)r∈Nbe a matrix convex set in a dual vector space Vand Fa levelwise convex subset of K. (a) Then Fis amatrix exposed multiface if there exists a positive integer r,a contin- uous linear map Φ : V→Mrand a self-adjoint matrix α∈Mrsatisfying the following conditions: (i) for every positive integer nandB∈Knwe have Φ n(B)/precedesequalα⊗In; (ii) for each n∈Nwe have{B∈Kn|α⊗In−Φn(B)/{ollowsequal0 is singular }=Fn. (b)IfFisamatrixconvexmatrixexposedmultiface, thenitisa matrixconvexexposed multiface. Subsection 5.2.1is an extension of Subsection 4.3and explores the connection between matrix multifaces and matrix exposed multifaces.\nFACIAL STRUCTURE OF MATRIX CONVEX SETS 9 1.3.Reader’s guide. This paper is organized as follows. Section 2contains basic def- initions and preliminaries in both classical and matrix convexity. Sectio n3then deals with generalising the notion of an exposed point and its properties to the matrix setting. It includes the proofs of Proposition 3.5and Theorem 3.8giving the interplay between matrix extreme and matrix exposed points. Subsection 3.3is dedicated to the proof of the Straszewicz-Klee theorem for matrix convex sets (Theorem 3.14), while Subsection 3.4 dealswithexposed pointsof statespaces. Section 4introducesﬁxed-level matrixfacesand matrix exposed faces and establishes their connection in Propositio n4.11and Theorem 4.12. The extreme points hereditary property of matrix faces is prove d as Proposition 4.4, and in Subsection 4.3.1the correspondence between matrix faces and matrix exposed faces for free spectrahedra is deduced. Section 5covers matrix multifaces and matrix ex- posed multifaces. Their correspondence with the kernels of partia lly order reﬂecting ucp maps is established in Proposition 5.7, while the hereditary property of matrix extreme points is stated as Proposition 5.10. Acknowledgments. We express our special thanks to Eric Evert for his insightful com- ments and valuable suggestions and are appreciative of the helpful comments on the earlier versions of the manuscript provided by Jurij Volˇ ciˇ c and S cott McCullough. We thank Rapha ¨el Clouˆ atre for notifying us of an issue in an earlier version of the pa per and we thank the anonymous referee for their detailed reading and tho ughtful suggestions. 2.Preliminaries We recall the formal deﬁnitions of extreme and exposed points fro mthe classical theory, as well as of their set analogues, faces and exposed faces (see [ Bar02]). We then present a convenient translation argument and a property of interior points of matrix convex sets. Lastly, we give some background on free spectrahedra in Subsect ion2.1. Deﬁnition 2.1. LetK⊆Vbe a convex set. (a) A point x∈Kis called an extreme point ofKif any expression x=ty+(1−t)z for somey,z∈Vand 0<t<1 forcesx=y=z.Equivalently, the set K\\{x}is convex. (b) A point x∈Kis anexposed point ofKif there exists a continuous functional ϕ:V→Cand a real number asuch thatϕ(x) =aandϕ(y)<afor ally∈K\\{x}. Every exposed point is extreme, while the converse holds, e.g., for ( ﬁnite-dimensional) polyhedra, but not in general (see Figure 1below). The next deﬁnition extends the concepts of extreme and exposed points to sets. Deﬁnition 2.2. LetK⊆Vbe a convex set. (a) A convex subset F⊆Kis called a faceofKiftx+(1−t)y∈Ffor somex,y∈K and 0<t<1 forcesx,y∈F.Equivalently, the set K\\Fis convex. (b) A convex subset F⊆Kis anexposed face ofKif there exists a continuous functionalϕ:V→Cand a real number asuch thatϕ(x) =afor allx∈Fandϕ(y)<a for ally∈K\\F. Every exposed face is indeed a face and it is straightforward that f or a singleton (ex- posed) face F={x},the pointxis extreme (exposed). We now explain some technical assumptions on the matrix convex set Kwe are considering that will appear throughout the paper. If convenient, we may assume 0 ∈K1since one can instead consider the matrix convex set −λ+Kfor someλ∈K1.This assumption is usually made without loss of generality as translations preserve matrix extreme points, etc.\n10 IGOR KLEP AND TEA ˇSTREKELJ Proposition 2.3. A matrix convex set Kin a dual space Vwith0∈K1is closed under conjugation by contractions. Proof.LetA∈Krand letα∈Mr,nbe a contraction. Since 0 ∈K1,we have 0 n=⊕n0∈ Kn.Lettingβ= (In−α∗α)1 2,we haveα∗α+β∗β=Inand α∗Aα= (α∗β∗)(A⊕0n−r)(g α β)g ∈Kn. /square Proposition 2.4. IfKis a matrix convex set and v∈intK1,then⊕nv∈intKn. Proof.We may without loss of generality assume that v= 0∈intK1.Otherwise Kcan be replaced by −v+Kso that 0 ∈int(−v+K1).Then⊕n0∈int(−⊕nv+Kn) implies ⊕nv∈intKn. Recall that open neighbourhoods of 0 in the weak topology are of th e form Uv′,ǫ={w∈V| |/a\\}bracketle{tw,v′/a\\}bracketri}ht|<ǫ} wherev′∈V′, ǫ >0 and/a\\}bracketle{t·,·/a\\}bracketri}ht:V×V′→Cdenotes the pairing of VandV′.Also, for eachn∈N,a pairing of the matrix spaces Mn(V) andMn(V′) can be deﬁned by /a\\}bracketle{t/a\\}bracketle{tB,B′/a\\}bracketri}ht/a\\}bracketri}ht=∑ i,j/a\\}bracketle{tBi,j,B′ i,j/a\\}bracketri}ht forB∈Mn(V) andB′∈Mn(V′).A net inMn(V) converges weakly if and only if it converges entrywise (see, e.g., [ EW97, Section 2]) and open neighbourhoods of 0 in the weak topology of Mn(V) are of the form Un B′,ǫ={B∈Mn(V)| |/a\\}bracketle{tBi,j,B′ i,j/a\\}bracketri}ht|<ǫfori,j= 1,...,n}, whereB′∈Mn(V′) andǫ>0. As 0∈intK1,there is av′∈V′andǫ>0 such that Uv′,ǫ⊆K1.Letw∈Uv′,ǫ=−Uv′,ǫ. Matrix convexity of Kand the unitary similarity of(g 0 1 1 0)g and(g 1 0 0−1)g , as well as of (g 0 1 −1 0)g and(g i0 0−i)g imply (g 0w w0)g ,(g 0w −w0)g ∈K2. Whence (g 0w 0 0)g =1 2(g(g 0w w0)g +(g 0w −w0)g)g ∈K2. It is easy to see that also wEi,j∈Kn,where (Ei,j)i,jdenote the standard n×nmatrix units. Now takeB′=(v′ n2) i,j∈Mn(V′) and observe that for any B∈Un B′,ǫ, n2Bi,jEi,j∈Kn for alli,j.Then again by (matrix) convexity, B=1 n2∑ i,jn2Bi,jEi,j∈Kn. We deduce that ⊕n0∈Un B′,ǫ⊆Kn. /square\nFACIAL STRUCTURE OF MATRIX CONVEX SETS 11 2.1.Freespectrahedra. We now describe an important class of matrix convex sets arising fromspectrahedra. Taking V=Cgfor someg∈Nwe getMn(V)∼=Mg n.Fork∈Ndenote bySg kthe space of g-tuples of complex self-adjoint k×kmatrices. For A= (A0,...,A g)∈ Sg k,the corresponding linear matrix-valued polynomial LA=A0+g∑ i=1Aixi in the noncommuting variables x1,...,x gis called a linear pencil . It can be evaluated at a pointx∈Rg,producing a Linear Matrix Inequality LA(x)/{ollowsequal0 with the solution set {x∈Rg|LA(x)/{ollowsequal0}called aspectrahedron (see, e.g., [ RG95,HV07,HM12]). Similarly, Lis evaluated at a tuple X∈Sg nas LA(X) =A0⊗In+g∑ i=1Ai⊗Xi, where⊗denotes the Kronecker (tensor) product. Then the matricial so lution set DA=( DA(n)) n,where DA(n) ={X∈Sg n|LA(X)/{ollowsequal0} is referred to as a free spectrahedron (see, e.g., [ HKM12,HKM13,FNT17,EH19,Kri19]) and is easily seen to be matrix convex. We will often assume that DA(1) has nonempty interior. This may be done without loss of generality as we now explain. Since DA(1) is a ﬁnite-dimensional convex set, it has nonempty relative interior, i.e., nonempty interior in the relative t opology of its aﬃne span. This means it is contained in a proper aﬃne subspace of Rg,i.e., (2.1) ϕ|DA(1)=a for some functional ϕ:Rg→Randa∈R,which implies ϕn|DA(n)=a⊗In for alln∈N(see [HKM16, Corollary 3.6]). So if DA(1) has no interior points, we can use the relations given by ( 2.1) to express some of the variables xiin terms of the others and thus reduce dimensions. The assumption int DA(1)/\\e}atio\\slash=∅in turn implies that Lcan be assumed to be monic, meaningA0=Ik(see [HKM13, Proposition 2.1]). Then by the Eﬀros-Winkler matricial Hahn-Banach separation theorem [ EW97,HM12], a spectrahedron is the matrix analogue of an aﬃne half-space with the corresponding aﬃne hyperplane bein g ∂DA(n) ={X∈Sg n|LA(X)/{ollowsequal0 singular }. 3.Matrix exposed points In this section we introduce and study matrix exposed points in matr ix convex sets, a notion originating in [ Kri19]. We generalise the notion to arbitrary inﬁnite-dimensional vector spaces while at the same time streamlining many of the argume nts from [ Kri19]. The mainresults areTheorem 3.8asserting the connectionbetween matrix exposed points and matrix extreme points and Theorem 3.14giving a matrix analogue of the classical Straszewicz theorem, more precisely, its generalisation due to Klee stating that every compact convex set in a normed space is the closed convex hull of its exposed points.\n12 IGOR KLEP AND TEA ˇSTREKELJ 3.1.Deﬁnition and basic properties. The deﬁnition of a matrix exposed point aims to simulate properties of an exposed point in the classical sense. Thro ughout we assume thatKis a matrix convex set in a dual vector space V,endowed with the corresponding weak topology with respect to which the involved linear maps are assu med continuous. We will also assume that K1has more than one point and (after a translation if needed) that 0∈K1. Deﬁnition 3.1. LetK= (Kn)n∈Nbe a matrix convex set in a dual vector space V. An ele- mentA∈Knis called a matrix exposed point ofKif there exist a continuous linear map Φ :V→Mnand a self-adjoint matrix α∈Mnsuch that the following conditions hold: (a) for all positive integers randB∈Krwe have Φ r(B)/precedesequalα⊗Ir; (b){B∈Kn|α⊗In−Φn(B)/{ollowsequal0 singular }={U∗AU|U∈Mnunitary}. We say that a pair (Φ ,α)matricially exposes the pointAand denote the set of all matrix exposed points of Kby mexp K. Remark 3.2. (a) For any linear map Φ : V→Mnthe corresponding family (Φ r|Kr: Kr→Mr(Mn))r∈Nof restricted canonical ampliations deﬁnes a matrix aﬃne map, i.e., it satisﬁes: Φr(gk∑ i=1γ∗ iAiγi)g =k∑ i=1(γ∗ i⊗Ir)Φri(Ai)(γi⊗Ir) for allk-tuples (Ai)k i=1and (γi)k i=1such thatAi∈Kriandγi∈Mri,rfori= 1,...,kwith the property∑textk i=1γ∗ iγi=Ir. (b) Recall that an ordinary exposed point A∈Kcan be weakly separated from the other points of a convex set Kby an aﬃne hyperplane. In other words, for the functional ϕ:V→Canda,which determine the hyperplane, we have that Ais the only point of K in the kernel of the map a−ϕ,while for all xinKwe haveϕ(x)≤a.On the other hand, if a linear map Φ, matrix α∈MnandA∈Knare as in Deﬁnition 3.1, then we have for any unitary matrix U∈Mn, α⊗In−Φn(U∗AU) = (U∗⊗In)( α⊗In−Φn(A)) (U⊗In). Notethat if the matrix α⊗In−Φn(A) is singular, then so is α⊗In−Φn(U∗AU).Condition (b) of Deﬁnition 3.1additionally demands for the points of the unitary orbit of Ato be exactly the ones from Knin the kernel of the map α⊗In−Φn. We conclude that if Ais matrix exposed, then so is any point from its unitary orbit (being exp osed by the same pair (Φ,α) asA). (c) From Deﬁnition 3.1we see that for r<nandB∈Krthe strict inequality Φ r(B)≺ α⊗Irholds as we now explain. If r < nandB∈Krare such that α⊗Ir−Φr(B) is singular (while also positive semideﬁnite), then for any C∈Kn−r, α⊗In−Φn(B⊕C) =( α⊗Ir−Φr(B)) ⊕( α⊗In−r−Φn−r(C)) , and from the singularity of α⊗Ir−Φr(B),the singularity of α⊗In−Φn(B⊕C) follows. But then for any choice of C∈Kn−rfor whichB⊕Cis not unitarily equivalent to A, the last statement contradicts part (b) of Deﬁnition 3.1. To prove the existence of such aCwe proceed as follows. As explained above, without loss of generality K1contains a nonzerov∈Vas well as 0 ∈V.In particular, by convexity, wt=⊕n−r i=1tv∈Kn−rfor every t∈[0,1]. IfC∈Kn−rwith the required properties does not exist, then for any w∈Kn−r,the direct sum B⊕wis unitarily equivalent to A,hence all the B⊕wtfort∈[0,1] are\nFACIAL STRUCTURE OF MATRIX CONVEX SETS 13 unitarily equivalent. Now any functional ϕonVwithϕ(v)/\\e}atio\\slash= 0 gives rise to a nonzero diagonal matrix ϕn−r(w1) =⊕n−r i=1ϕ(v) and thus yields a continuous family of complex matrices ϕn(B⊕wt) =(g ϕr(B) 0 0tϕn−r(w1))g ∈Mn, which areall unitarilyequivalent. But this isa contradictionby a simple e igenvalue count. Note that the strict inequality Φ r(B)≺α⊗Irfor allB∈Krdoes not hold when r≥n, since the singularity of α⊗In−Φn(A) implies the singularity of α⊗In+s−Φn+s(A⊕C) for anys∈NandC∈Ks. Proposition 3.3. LetK= (Kn)n∈Nbe a matrix convex set. Then the matrix exposed points inK1coincide with the ordinary exposed points of K1. Proof.Firstassume Aisamatrixexposedpointin K1.Conditions(a)and(b)inDeﬁnition 3.1for the case n= 1 imply the existence of a continuous linear functional ϕ:V→C and a real number αsuch that: ϕ(B) =ϕ1(B)≤αfor allB∈K1, ϕ−1(α) ={A}.(3.1) SoAis ordinary exposed in K1. For the converse, assume Ais an ordinary exposed point in K1andϕ:V→Ca continuouslinearfunctionalsatisfying( 3.1). Weneedtoprovethatforanypositiveinteger randB∈Krthe ampliation ϕrsatisﬁesϕr(B)/precedesequalα⊗Ir=αIr.Assume otherwise. Then there is an r >1 andB∈Kr,for whichϕr(B)/notprecedesoreqlαIr,meaning that for some unit vector x∈Crwe have (3.2) x∗( ϕr(B)−αIr) x=/angbracketleftbig( ϕr(B)−αIr) x,x/angbracketrightbig ∈C\\{t∈R|t≤0}. Since (ϕn)n∈Nis matrix aﬃne, we also have x∗ϕr(B)x=ϕ(x∗Bx)≤α,from which we deduce x∗( ϕr(B)−αIr) x=x∗ϕr(B)x−α≤0, contradicting ( 3.2). We conclude that the pair ( ϕ,α) satisﬁes the conditions in Deﬁnition 3.1, i.e., it matricially exposes AinK. /square 3.2.Interplay between matrix extreme points and matrix exposed points.While in the classical theory it is straightforward to see that any exposed poin t is extreme, we need some preliminary observations (given in Proposition 3.4) to prove the matrix analogue of this claim in Proposition 3.5. Theorem 3.8then asserts when the converse holds: a matrix extreme point that is ordinary exposed is in fact matrix exposed. Proposition3.4. LetA∈Knbe a matrix exposed point with an exposing pair (Φ,α). Then the following statements hold. (a)For any nonzero x=∑textn j=1xj⊗ej∈Cn⊗Cnin the kernel of α⊗In−Φn(A),the components x1,...,x nform a basis of Cn. (b)The kernel of α⊗In−Φn(A)is one-dimensional. Proof.(a) Letx=∑textn j=1xj⊗ej∈Cn⊗Cnbe an arbitrary nonzero vector in the kernel ofα⊗In−Φn(A) and suppose that the matrix ( x1,...,x n)∈Mnis singular, say of rank r <n. Without loss of generality assume its rank is achieved in the ﬁrst rcolumns. Let\n14 IGOR KLEP AND TEA ˇSTREKELJ P∈Mr,nbe the projection of Cnonto span {x1,...,x r},so that (P⊗In)x=∑textr j=1xj⊗ej. Then by denoting x(r)=∑textr j=1xj⊗ej,we can express: (α⊗Ir−Φr(PAP∗))x(r)= (P⊗In)(α⊗In−Φn(A))(P∗⊗In)x(r) = (P⊗In)(α⊗In−Φn(A))x= 0. Wededuce that α⊗Ir−Φr(PAP∗) issingular, which by part(c) ofRemark 3.2contradicts the fact that Ais matrix exposed. (b) Suppose there are two linearly independent vectors x=∑textn j=1xj⊗ejandy=∑textn j=1yj⊗ejin the kernel of α⊗In−Φn(A).IfP∈Mr,nis a projection of rank rthen PAP∗∈Kr,and we have Ir⊗α−Φr(PAP∗) = (P⊗In)(α⊗In−Φn(A))(P∗⊗In).Assume r<n.If there exists a complex number λfor which the linear combination λx+ylies in the image of P∗⊗In,i.e.λx+y= (P∗⊗In)zfor somez∈Cr⊗Cn,then the vector z lies in the kernel of Ir⊗α−Φr(PAP∗).But this contradicts Abeing matrix exposed. To ﬁnd such a λand projection Pconsider the matrices M= (x1,...,x n) andN= (y1,...,y n).They are both invertible by part (a), whence det(λM+N) = det(M−1)det(λIn+M−1N). Since theinvertible matrix M−1Nhasa nonzero eigenvalue, there isa λforwhichλM+N is singular. Taking Pto be the projection onto span {λx1+y1,...,λx n+yn}then ﬁnishes the proof. /square Proposition 3.5. LetK= (Kn)n∈Nbe a matrix convex set. Then every matrix exposed point ofKis matrix extreme. Proof.LetA∈Knbe matrix exposed and (Φ , α) the corresponding exposing pair. Sup- pose we can express Aas a proper matrix convex combination: (3.3) A=k∑ i=1V∗ iAiVi fork-tuples (Ai)k i=1and (Vi)k i=1,whereAi∈Kniand the matrices Vi∈Mni,nare surjective (implyingni≤n) with the property∑textk i=1V∗ iVi=In. By assumption we have Ini⊗α− Φni(Ai)/{ollowsequal0 fori= 1,...,k,and α⊗In−Φn(A) =k∑ i=1(V∗ i⊗In)( Ini⊗α−Φni(Ai)) (Vi⊗In). (3.4) Suppose one of the Ai(without loss of generality A1) is not unitarily equivalent to Aand hence satisﬁes In1⊗α−Φn1(A1)≻0.We will prove that this implies V1= 0. First notice that for i= 1,...,kwe have (V∗ i⊗In)( Ini⊗α−Φni(Ai)) (Vi⊗In)/{ollowsequal0.By Proposition 3.4, there isx=∑textn j=1xj⊗ej∈Cn⊗Cnfrom the kernel of α⊗In−Φn(A) such that itscomponents x1,...,x nspanCn.From(3.4) we can deduce (using thepositive semideﬁniteness of the summands on the right-hand side) that xlies in the intersection of the kernels of ( V∗ i⊗In)( Ini⊗α−Φni(Ai)) (Vi⊗In) fori= 1,...,k.In particular, we have (V∗ 1⊗In)( In1⊗α−Φn1(A1)) (V1⊗In)x= 0.Now the positive deﬁniteness of the middle factor and injectivity of ( V∗ 1⊗In) imply that xlies in the kernel of V1⊗In,i.e., (V1⊗In)x= (V1⊗In)(gn∑ j=1xj⊗ej)g =n∑ j=1V1xj⊗ej= 0. SoV1xj= 0 forj= 1,...,nand henceV1= 0. /square\nFACIAL STRUCTURE OF MATRIX CONVEX SETS 15 Example 3.6. We give an example of a matrix convex set Kwith a matrix extreme point that is not matrix exposed. It is a free spectrahedrop (i.e., a coord inate projection of a free spectrahedron), whose ground level component K1is the set in Figure 1. This is a convex set with an extreme point that is not exposed. x2=x3 1 x1x2 0 −1 11 Figure 1. The origin of the coordinate system is an extreme point, which is not exposed. As proved in [ NPS10, Example 3.7], the intersections of the depicted set with the ﬁrst and second quadrant admit a so-called exact Lasserre relaxation , this being a suﬃcient condition for them and also their convex hull, i.e., their union, to be des cribed by a spectrahedrop. So there is a linear pencil L=C+2∑ i=1Aixi+g∑ j=1Bjyj in variables ( x1,x2,y1,...,y g) such that K1={x∈R2| ∃y∈Rg:L(x,y)/{ollowsequal0}. Then K=/uniondisplay n∈N{X∈S2 n| ∃Y∈Sg n:L(X,Y)/{ollowsequal0} is a free spectrahedrop with a matrix extreme point that is not matr ix exposed. ♦ Example3.7. Inanalogytotheequality between extreme andexposed pointsofp olyhedra in Euclidean spaces Rn,every matrix extreme point of a free spectrahedron is matrix exposed as showed in [ Kri19, Corollary 6.21] (cf. Subsection 4.3.1). ♦ We now state a partial converse to Proposition 3.5, which will be proved after two technical lemmas. Theorem 3.8. LetK= (Kn)n∈Nbe a matrix convex set. Then: (a)Every matrix exposed point AinKnis ordinary exposed in Kn. (b)Every point AinKn,which is both exposed and matrix extreme, is a matrix exposed point ofK.\n16 IGOR KLEP AND TEA ˇSTREKELJ Denote by S(Mn) ={p:Mn→C|punital positive }the state space of Mn. Each positivefunctional p∈S(Mn)isoftheform p(α) = tr(γα)foraﬁxedpositivesemideﬁnite matrixγ∈Mnwith trace 1 and so S(Mn) is a compact convex subset of M∗ n.The next lemma concerns the set we just introduced; it is a strict-positivity a nalogue of [ EW97, Lemma 5.2] along the lines of [ Kri19, Lemma 2.16]. In fact, [ EW97, Lemma 5.2] is a key result leading to the Eﬀros-Winkler matricial Hahn-Banach separat ion theorem [ EW97], but the matricial separation there originates from the ability to sep arate a closed convex set from an outer point. On the other hand, to obtain the desired m atricial separation in Theorem 3.8, we will implicitly use the idea that any (not necessarily closed) convex set can be separated from an outer point by a functional with values in a n ordered extension ﬁeld ofR(cf. [NT13, Theorem 2.1]). This, together with a ﬁnite intersection property [BCR98, Theorem 2.7.2]motivatestheintroductionofreal closed ﬁeldsinth enext lemma. For a real closed ﬁeld Rwe will denote >Rthe order relation on R.Forx,y > R0 we writex≫yifx>Rnyfor alln∈N.Forx∈ Rwith ann∈Nsuch that −n<Rx<Rn we denote by st( x)∈Rthe standard part of x(for more about real closed ﬁelds see [BCR98]). Lemma 3.9. LetCbe a (convex) cone of continuous real aﬃne functions on the st ate space S(Mn)⊆M∗ nsuch that for every f∈ Cthere is a state pf∈S(Mn)withf(pf)>0.Then there exists a real closed ﬁeld Rcontaining R,and a unital positive R-linear functional p0:Mn→ R[i]satisfyingfR(p0)>R0for allf∈ C\\{0}(hereR[i]stands for the algebraic closure of RandfRis the unique extension of fto anR-linear map Mn(R[i])∗→ R[i]). Proof.Denote the set of unital positive R-linear functionals p:Mn→ R[i] bySR(Mn) and for a given function f∈ C\\{0}consider the following family {f >0}:={(R,p)| Rreal closed ﬁeld over R, p∈SR(Mn), fR(p)>0}, which is a type as we now explain (see [ Hod93] as a reference for model theory). By assumption we have {f >0} /\\e}atio\\slash=∅for anyf∈ C\\{0}and we need to prove ∈tersectiondisplay f∈C\\{0}{f >0} /\\e}atio\\slash=∅. If we show that all ﬁnite intersections of the sets {f >0}are nonempty, then by a compactness argument as in [ BCR98, Theorem 2.7.2], there is a real closed ﬁeld Rover R,and a state p∈SR(Mn) such that for all f∈ C\\{0}we havef(p)>0.So suppose there is an n∈Nand functions f1,...,f n∈ Csuch that: n∈tersectiondisplay i=1{fi>0}=∅. Deﬁne the map θ:S(Mn)→Rnwithθ(p) =( f1(p),...,f n(p)) .This is clearly a continuous aﬃne map, from which we see that θ(S(Mn)) is a compact convex subset of Rn.On the other hand we have by assumption that: θ(S(Mn))∩Rn +=∅, whereRn +:= [0,∞)n. ByageometricversionoftheHahn-Banachtheorem(seee.g.[ Bar02, Section III.1]), the sets θ(S(Mn)) andRn +can be strictly separated, i.e., there is a linear functiong(x1,...,x n) =c1x1+···+cnxnonRnand a real number bsuch thatg(y)≥b for ally∈Rn +andg(z)<bfor allz∈θ(S(Mn)). Moreover, since Rn +is a cone, we have b= 0.\nFACIAL STRUCTURE OF MATRIX CONVEX SETS 17 For every standard unit vector ei∈Rnwe haveg(ei) =ci≥0.So the function f◦θ=c1f1+···+cnfnis a conic combination of f1,...,f nand hence an element of C.Butfsatisﬁes{p∈S(Mn)|f(p)>0}=∅,which contradicts the assumption of the lemma. /square Lemma 3.10. LetK= (Kn)n∈Na matrix convex set for which 0∈K1.Suppose there exist a linear functional ϕ:Mn(V)→Cand a real number a>0such that Reϕ|Kn<a.Then there is a state p:Mn→Csuch that Reϕ(α∗Bα)<ap(α∗α) for allB∈Kr, nonzero matrices α∈Mr,nand positive integers r. Proof.LetCbe the set of all continuous aﬃne functions on S(Mn) of the form: fv,α(p) =ap(α∗α)−Reϕ(α∗vα) for a matrix α∈Mr,n, v∈Krandr∈N.The setCis a cone as we can express fv,α+fw,β=fx,γ, cfv,α=fv,√cα for any real number c≥0,where the matrix γis deﬁned to be γ∗= (α β)∈Mr,2nand x=v⊕w. Let us prove that for any f=fv,α∈ Cthere is a state pf∈S(Mn) withf(pf)>0. Supposeα/\\e}atio\\slash= 0 and let pfbe the state on Mn,for whichpf(α∗α) =/bardblα/bardbl2.Then for the matrixβ=α /bardblα/bardblthe pointβ∗vβlies inKnand by considering the assumption Re ϕ|Kn<a, we have that Reϕ(α∗vα) =/bardblα/bardbl2Reϕ(β∗vβ)<apf(α∗α). By Lemma 3.9there exist a real closed ﬁeld RoverRand a unital positive functional p:Mn→ R[i] withfv,α(p)>R0 for allfv,α∈ Cwithα/\\e}atio\\slash= 0. Nowusingtheproceduredescribedin[ Kri19, Corollary2.17]weconstructfrom pastate onMnwith required properties. Since pis positive, it is of the form p(A) = tr(CA) for a positive semideﬁnite matrix C∈Mn(R) with trC= 1.LetD∈Mn(R) be its positive square root, i.e., C=D2withDbeing positive semideﬁnite, and deﬁne q∈SR(Mn) by q(A) = tr(DA). By [Kri19, Lemma 2.14] there exist r∈Nandλ1≫...≫λr>0 in Ralong with D1,...,D r∈SR(Mn) such that D=∑textr i=1λjDj(hereλ1D1= stDis the standard part of D). In the case r= 1,the stateqis already all we need; so assume r≥2 and letqj(A) = tr(D2 jA) forj= 1,...,r. Sinceq(In) = 1,we can take λ1= 1.The goal is to prove we can replace the matrix C, which deﬁnes p,withE2+D2 r,whereE=∑textr−1 j=1λjDj.Note that for every f∈ Cwe have stf(p) =f(q1)≥0 andf(qr)≥0.LetqE(A) = tr(E2A) and suppose there was an f∈ C, for whichf(qE+qr)≤R0.Thenf(q1)+f(qr) = stf(qE+qr)≤0 and hence f(qr) = 0. We deduce f(qE+qr) =f(p)>R0,which contradicts our assumption. Hence we have f(qE+qr)>R0 for allf∈ C. Now continue the above procedure, i.e., in the next step replace the matrixE2+D2 r with (∑textr−2 j=1λjDj)2+D2 r−1+D2 retc. By induction we conclude that the state qFwith the corresponding matrix F=∑textr j=1D2 rhas the desired properties. /square Proof of Theorem 3.8.(a) LetA∈Knbe matrix exposed with the pair Φ : V→Mn andα∈Mnexposing it as in Deﬁnition 3.1. By Proposition 3.4, there is a vector x=∑textn j=1xj⊗ej∈Cn⊗Cnspanning the kernel of α⊗In−Φn(A) and whose components x1,...,x nare linearly independent. Deﬁne the functional ϕ:Mn(V)→Cby: ϕ(B) =x∗Φn(B)x,\n18 IGOR KLEP AND TEA ˇSTREKELJ anda=x∗(α⊗In)x∈R.Since the pair (Φ ,α) matricially exposes A,we have a−ϕ(B) =x∗( α⊗In−Φn(B)) x≥0 for allB∈Knanda>ϕ(B) for eachBnot in the unitary orbit of A. Let us check that a>ϕ(B) also for any B∈Kn\\{A},which is unitarily equivalent to A.LetU∈Mnbe a unitary matrix such that a=ϕ(U∗AU).Then 0 =x∗( α⊗In−Φn(U∗AU)) x=( (U⊗In)x)∗( α⊗In−Φn(A)) (U⊗In)x. The above together with the positive semideﬁniteness of α⊗In−Φn(A) implies that (U⊗In)xlies in the one-dimensional kernel of α⊗In−Φn(A) and is hence a multiple ofx.But then the unitary Uis a scalar multiple of the identity and so U∗AU=A.We conclude that the pair ( ϕ,a) exposesAinKn. (b) We may assume A∈Knis a nonzero exposed and matrix extreme point and that 0∈K1as explained in the introductory section. It is clear from the deﬁnitio n of a matrix extreme point that Ais not contained in the matrix convex set L:= mconv(Kn\\{U∗AU|U∈Un}).SinceAis nonzero, we have 0 ∈L1and hence Lis closed under conjugation by contractions by Proposition 2.3. By assumption there is a continuous linear functional ϕ:Mn(V)→Rand real number awithϕ(A) =aand ϕ(B)<afor allB∈Kn\\{A}.Since 0∈K1,we have 0 = ϕ(0)≤a. As in the proof of the Eﬀros-Winkler matricial Hahn-Banach theore m in [EW97, The- orem 5.4] we divide our reasoning in three parts. First we gather tog ether the key tools givenbythepreviouslemmas, thenweconstruct acandidateforth eexposingpair. Finally we prove it does satisfy the desired separating conditions. By Lemma 3.10, there is a state p:Mn→Cwith: (3.5) Re ϕ(α∗Bα)<ap(α∗α) for anyB∈Lr,nonzero matrix α∈Mr,nand positive integer r.Since 0∈K1,we have 0<ap(α∗α) for any nonzero α∈Mr,nso thatpis a faithful state. The condition 0 ∈K1 also implies Kis closed under conjugation by contractions, so we see by the prop erties of ϕthat (3.6) Re ϕ(α∗Bα)≤ap(α∗α) holds for any positive integer r,B∈Krand contraction α∈Mr,nsuch thatp(α∗α) = 1. By the GNS construction the map pis determined by a representation π:Mn→ B(H), whereHis a ﬁnite-dimensional Hilbert space, and a cyclic and separating vect orx∈ H so that we have for arbitrary γ∈Mnthe expression: p(γ) =/a\\}bracketle{tπ(γ)x,x/a\\}bracketri}ht. We now proceed to construct of the candidate Φ : V→Mnfor the map that matricially exposesA.To a row matrix α= [α1,...,α n]∈M1,nassign the matrix ˜ α∈Mn, deﬁned by ˜α= α1α2···αn 0 0···0 ............ 0 0···0 . Denote by /tildewideM1,nthe vector space consisting of matrices of such form and let H0:= π(/tildewideM1,n)x. Sincexis separating, the space H0is clearly an n-dimensional subspace of\nFACIAL STRUCTURE OF MATRIX CONVEX SETS 19 H. We deﬁne on H0a family of sesquilinear forms: Ψv(π(˜α)x,π(˜β)x) =ϕ(α∗vβ) indexed by vectors vfromV.For eachv∈Vthe form Ψ vis well-deﬁned. Indeed, suppose we have π( ˜α1)x=π( ˜α2)xfor matrices α1andα2fromM1,n. Linearity of πgives π( ˜α1−˜α1)x= 0 and hence: /angbracketleftbig π( ˜α1−˜α2)x,x/angbracketrightbig =p(α1−α2) = 0. Sincepis a faithful state, we have α1=α2,which implies that Ψ vis well-deﬁned. Each sesquilinear form Ψ von the ﬁnite-dimensional space H0overRis uniquely deter- mined by the linear map Φ( v) :H0→ H0as follows: ϕ(α∗vβ) =/angbracketleftbig Φ(v)π(˜α)x,π(˜β)x/angbracketrightbig . We thus get a map Φ : V→ B(H0),which is both linear and weakly continuous. After choosing an orthonormal basis for H0, we identify H0withCnand the bounded operators B(H0) on it with Mn. Now by letting ( ei)n i=1bethe standardbasis of Cnanddenoting fi:=e∗ ifori= 1,...,n, we can express any matrix B= (Bi,j)i,j∈Mn(V) (using the bimodule action on V) as a combination of the form: B=∑ i,jeiBi,jfj. Hence ϕ(B) =∑ i,jϕ(eiBi,jfj) =∑ i,j/angbracketleftbig Φ(Bi,j)π(˜fj)x,π(˜fi)x/angbracketrightbig =/angbracketleftbig Φn(B)η0,η0/angbracketrightbig , where η0= π(˜f1)x ... π(˜fn)x  is a vector from Hn 0satisfying /bardblη0/bardbl2=n∑ i=1/bardblπ(˜fi)x/bardbl2=n∑ i=1p(f∗ ifi) =p(gn∑ i=1f∗ ifi)g =p(In) = 1. In the last part of the proof we argue that Φ is the desired map. For this we need to check that for all B∈Krandr∈Nthe condition Φ r(B)/precedesequalaIn⊗Ir=aIn·rholds or equivalently, (3.7) Re/angbracketleftbig Φr(B)η,η/angbracketrightbig =/angbracketleftbig ReΦr(B)η,η/angbracketrightbig ≤a/a\\}bracketle{tη,η/a\\}bracketri}ht holds for every vector η∈(Cn)r.Sincexis cyclic, we can write any η∈(Cn)ras η= π( ˜α1)x ... π( ˜αr)x , (3.8) whereαi∈M1,nfori= 1,...,r. In addition, we can express the norm of ηthrough the values ofpby (3.9) /bardblη/bardbl2=n∑ i=1/bardblπ(˜αi)x/bardbl2=n∑ i=1p(α∗ iαi) =p(α∗α),whereα= α1 ... αr ∈Mr,n.\n20 IGOR KLEP AND TEA ˇSTREKELJ Ifηis a unit vector, then for every z∈Cnwe have by the Cauchy-Schwarz inequality that: (3.10) /bardblαz/bardbl2=n∑ i=1|αiz|2≤ /bardblη/bardbl/bardblz/bardbl= 1 showingαis a contraction. We can ﬁnally check the validity of condition ( 3.7) for any unit vector η∈(Cn)rusing the property ( 3.6) ofϕand the just established connection ( 3.9): /angbracketleftbig ReΦr(B)η,η/angbracketrightbig =∑ i,j/angbracketleftbig ReΦ(Bi,j)π(˜αj)x,π(˜αi)x/angbracketrightbig =∑ i,jReϕ(α∗ iBi,jαj) = Reϕ(α∗Bα) ≤ap(α∗α) =a/bardblη/bardbl2=a. Sinceϕweakly separates the point Afrom the set K, we have: /angbracketleftbig Φn(A)η0,η0/angbracketrightbig =ϕ(A) =a, so the matrix aIn2−Φn(A) is singular. Then by part (a) of Remark 3.2,aIn2−Φn(U∗AU) is singular for any U∈Un.To ﬁnish the proof we argue that for any B∈Knnot in the unitary orbit of A,the matrix aIn2−Φr(B) is not singular. Indeed, if a unit vectorη∈Cn2of the form ( 3.8) satisﬁes/angbracketleftbig ReΦn(B)η,η/angbracketrightbig = Reϕ(α∗Bα) =ap(α∗α) =a, thenαis a contraction by ( 3.10). Henceα∗Bα∈LnasLis closed under conjugation of its elements by contractions. But then we have by the strong se paration ( 3.5) that Reϕ(α∗Bα)< ap(α∗α), which is a contradiction. We conclude that the pair (Φ ,aIn) matricially exposes A. /square Combining the techniques used in the proofsof Lemma 3.10and Theorem 3.8we obtain anEﬀros-Winkler type weak Hahn-Banachseparation theoremfor (not necessarily closed) matrix convex sets analogous to [ Kri19, Corollary 2.17]. Corollary 3.11 (Weak separation theorem for matrix convex sets) .LetKbe a matrix convex set in a dual space Vwith0∈K1andA /∈Kn.Suppose there is a continuous linear functional ϕ:Mn(V)→Cand real number a >0such that Reϕ|Kn< aand ϕ(A) =a.Then there exists a continuous linear map Φ :V→Mnsuch that In⊗Ir−ReΦr(B)≻0 for every positive integer randB∈Kr,but ker( In⊗In−ReΦn(A)) /\\e}atio\\slash={0}. 3.3.Straszewicz-Klee theorem for matrix convex sets. A classical result on exposed points due to Straszewicz [ Bar02, Section II.2] states that the exposed points of a ﬁnite- dimensional compact convex set Kform a dense subset of the extreme points and hence their closed convex hull equals K. This section extends the Straszewicz theorem, more precisely, its generalisation for normed spaces [ Kle58] due to Klee, to the matrix convex setting.\nFACIAL STRUCTURE OF MATRIX CONVEX SETS 21 We proceed by following the idea in [ HL21] associating to a matrix convex set K= (Kr)r∈Nin the space Va family of convex sets {Γn(K)}n∈Ngiven by (3.11) Γ n(K) ={(γ∗γ,γ∗Aγ)|γ∈Mk,n,tr(γ∗γ) = 1,k∈N,A∈Kk} ⊆Mn×Mn(V). The set Γ n(K) is indeed convex as we can express tγ∗Aγ+(1−t)δ∗Bδ=(g t1/2γ∗(1−t)1/2δ∗)g(g A0 0B)g(g t1/2γ (1−t)1/2δ)g for elements ( γ∗γ,γ∗Aγ) and (δ∗δ,δ∗Bδ) from Γ n(K),whereA∈Kr, B∈Ksandγ∈ Mr,n, δ∈Ms,nare matrices satisfying tr( γ∗γ) = tr(δ∗δ) = 1,and arbitrary real number t in [0,1].SinceKis closed under direct sums, and we have tr(g(g t1/2γ (1−t)1/2δ)g∗(g t1/2γ (1−t)1/2δ)g)g =ttr(γ∗γ)+(1−t)tr(δ∗δ) = 1, the convex combination t( γ∗γ,γ∗Aγ) +(1−t)( δ∗δ,δ∗Bδ) lies in Γ n(K). Additionally we can assume for any element ( γ∗γ,γ∗Aγ) fromΓ n(K), whereAis inKr, that the matrix γ∈Mr,nis surjective (and hence r≤n) as we now explain. Let γ∈Mr,n be an arbitrary matrix of rank s∈Nwith the property tr( γ∗γ) = 1.Letξ∈Mr,sbe an isometry from Csto the range of γ.Then (3.12) γ∗Aγ= (ξγ)∗(ξAξ∗)(ξγ), whereξAξ∗lies inKsand the matrix ξγis surjective with tr(( ξγ)∗(ξγ)) = 1. The following variant of the Douglas Lemma [ Dou66] will be often used to establish well-deﬁnedness of objects and maps in the remainder of this sectio n. Lemma 3.12. Letγ∈Mr,nandδ∈Ms,nbe surjective matrices. Then γ∗γ=δ∗δif and only ifr=sand there exists a unitary matrix U∈Mrsuch thatγ=Uδ. We now state a correspondence between matrix exposed points of Kat levelnand ordinary exposed points of Γ n(K) (cf. [HL21, Proposition 2.14]). Proposition 3.13. LetK= (Km)m∈Nbe a matrix convex set and A∈Kr. (a)Letγ∈Mr,nbe a surjective matrix with tr(γ∗γ) = 1such that the point (γ∗γ,γ∗Aγ) is exposed in Γn(K).ThenAis a matrix exposed point of K. (b)IfAis matrix exposed in K, then for any invertible γ∈Mrwithtr(γ∗γ) = 1,the point(γ∗γ,γ∗Aγ)is exposed in Γr(K). Proof.To prove (a)suppose that( γ∗γ,γ∗Aγ) isanexposed pointof Γ n(K),whereA∈Kr andγ∈Mr,nis a surjective matrix satisfying tr( γ∗γ) = 1.By assumption there exists a continuous linear functional ϕ:Mn×Mn(V)→Cand a real number asuch that ϕ(γ∗γ,γ∗Aγ) =aandϕ(δ,C)>afor all (δ,C)∈Γn(K)\\{(γ∗γ,γ∗Aγ)}. Note thatϕcan be written as ϕ=ϕ1+ϕ2,whereϕ1:Mn→Candϕ2:Mn(V)→C. By the Riesz representation theorem there is a matrix β∈Mnsuch that for all δ∈Mn we haveϕ1(δ) = tr(βδ).It is easy to check that βneeds to be self-adjoint and that every matrixη= (η1,...,η n)∈Mm,nand its corresponding vectorization (3.13) vη=n∑ i=1e′ i⊗ηi∈Cn⊗Cm satisfy ϕ1(η∗η) = tr(βη∗η) = tr(ηβη∗) =v∗ η(β⊗Im)vη.\n22 IGOR KLEP AND TEA ˇSTREKELJ By the canonical correspondence between linear functionals on Mn(V) and linear maps V→Mn,the functional ϕ2gives rise to a map Ψ : V→Mn.For everyB∈Mm(V), matrixη= (η1,...,η n)∈Mm,nand its vectorization vηas in (3.13) we have ϕ2(η∗Bη) =e∗Ψn(η∗Bη)e=v∗ ηΨm(B)vη, wheree=∑textn i=1e′ i⊗e′ i∈Cn⊗Cnande′ iare standard basis vectors of Cn. Soforeverypositiveinteger m,elementB∈Kmandmatrix η∈Mm,nwiththeproperty tr(η∗η) = 1, v∗ η( (β−aIn)⊗Im−Ψm(B)) vη=ϕ(η∗η,η∗Bη)−a≥0. (3.14) Since tr(η∗η) = 1 if and only if vη∈Cmnis a unit vector, the above implies that the matrix (β−aIn)⊗Im−Ψm(B) is positive semideﬁnite. We also have: v∗ γ( (β−aIn)⊗Ir−Ψr(A)) vγ=ϕ(γ∗γ,γ∗Aγ)−a= 0, (3.15) which gives that ( β−aIn)⊗Ir−Ψr(A) is singular (as it is positive semi-deﬁnite). From Lemma 3.12, the points ( η∗η,η∗Bη) and (γ∗γ,γ∗Aγ) from Γ n(K) are equal if and only if there is a unitary matrix U∈Mrsuch thatη=UγandA=U∗BU.Hence: ϕ(η∗η,η∗Bη)−a=ϕ(γ∗γ,γ∗Aγ)−a =v∗ γ( (β−aIn)⊗Ir−Ψr(A)) vγ =v∗ γ( (β−aIn)⊗Ir−Ψr(U∗BU)) vγ (3.16) = ((In⊗U)vγ)∗( (β−aIn)⊗Ir−Ψr(B)) (In⊗U)vγ =v∗ η( (β−aIn)⊗Ir−Ψr(B)) vη. Using the properties of ϕwe deduce that for B∈Kmthe matrix ( β−aIn)⊗Im−Ψm(B) is singular if and only if m=randBis unitarily equivalent to A. It remains to correct the target space of Ψ and the size of β, i.e., we need a pair (Φ,α) with Φ : V→Mrandα∈Mrthat matricially exposes A.Letδ∈Mr,nbe any surjective matrix such that the range of δ∗⊗Ircontainsvγ(that is in the kernel of (β−aIn)⊗Ir−Ψr(A)). Then the compression (Φ ,α) =δ(Ψ,β−aIn)δ∗deﬁnes anexposing pairforA;thepositivesemi-deﬁniteness inallthepointsof Kisclear, deﬁniteness outside of the unitary orbit of Afollows from the injectivity of δ∗,and singularity at the unitary conjugates of Aholds by the choice of δ(cf. equations ( 3.14) – (3.16)). In fact, we can takeδ=γ.To see that, write vγ=∑textr i=1˜γi⊗ei,where ˜γiis thei-th row ofγandeiare standard basis vectors of Cr.Then for any y=∑textr i=1yi⊗ei∈ker(γ⊗Ir), /a\\}bracketle{tvγ,y/a\\}bracketri}ht=r∑ i=1/a\\}bracketle{t˜γi,yi/a\\}bracketri}ht= 0. Hence,vγlies in the orthogonal complement of ker( γ⊗Ir), i.e., in the range of γ∗⊗Ir. To prove (b) assume that A∈Kris matrix exposed and Φ : V→Mrtogether with α∈Mrare as in Deﬁnition 3.1. Letγ∈Mrbe an invertible matrix with tr( γ∗γ) = 1.We claim that ( γ∗γ,γ∗Aγ) is exposed in Γ r(K). By Proposition 3.4, there is a vector x=∑textr j=1xj⊗ej∈Cr⊗Crthat spans the kernel ofα⊗Ir−Φr(A) and whose components x1,...,x rare linearly independent. The pair (Φ,α) produces another pair (Ψ ,β) =γ∗(Φ,α)γand denoting by δthe inverse of γ, we can express (Φ,α) =δ∗(Ψ,β)δ.\nFACIAL STRUCTURE OF MATRIX CONVEX SETS 23 Now deﬁne a functional ϕ:Mr×Mr(V)→C,which is for C∈Mr(V) andµ∈Mrgiven by ϕ(µ,C) =y∗( β⊗µ−Ψr(C)) y, wherey= (δ⊗δ)x∈Cr⊗Cr.The calculations in the above proof of (a) together with the fact that Ψ is a matrix aﬃne map show that for any positive integer m,elementB∈Km and surjective matrix η∈Mm,rwith tr(η∗η) = 1, ϕ(η∗η,η∗Bη) =( (Ir⊗η)y)∗( β⊗Im−Ψm(B)) (Ir⊗η)y≥0. Nextweshowthatif( η∗η,η∗Bη)isdiﬀerent from( γ∗γ,γ∗Aγ),thenϕ(η∗η,η∗Bη)>0.IfB isnot unitarilyequivalent to A,the positive deﬁniteness of β⊗Im−Ψm(B) (following from thepositivedeﬁnitenessof α⊗Im−Φm(B)andtheinvertibilityof γ)implies( Ir⊗η)y= 0or ϕ(η∗η,η∗Bη)>0.But (Ir⊗η)y= (δ⊗ηδ)x/\\e}atio\\slash= 0 for nonzero ηsince span {x1,...,x r}=Cr andδis invertible. On the other hand, if B=U∗AUfor some unitary U∈Mrand ϕ(η∗η,η∗Bη) = 0,then 0 =ϕ(η∗η,η∗Bη) = ((Ir⊗η)y)∗( β⊗Ir−Ψr(B)) (Ir⊗η)y = ((Ir⊗Uη)y)∗( β⊗Ir−Ψr(A)) (Ir⊗Uη)y = ((γ⊗Uη)y)∗( α⊗Ir−Φr(A)) (γ⊗Uη)y = ((Ir⊗Uηδ)x)∗( α⊗Ir−Φr(A)) (Ir⊗Uηδ)x. By part (b) of Proposition 3.4, the kernel of α⊗Ir−Φr(A) is spanned by x, hence (Ir⊗Uηδ)x=λxfor some nonzero λ∈C.Since the components of xform a basis of Cn, this implies Uηδ=λIr,i.e.,Uη=λγ.A comparison of Hilbert-Schmidt norms now yields |λ|= 1,which in turn implies ( η∗η,η∗Bη) = (γ∗γ,γ∗Aγ),a contradiction. It remains to observe that ϕ(γ∗γ,γ∗Aγ) = ((Ir⊗γ)y)∗( β⊗Ir−Ψr(A)) (Ir⊗γ)y = ((δ⊗Ir)x)∗( β⊗Ir−Ψr(A)) (δ⊗Ir)x =x∗( δ∗βδ⊗Ir−(δ∗Ψrδ)(A)) x =x∗( α⊗Ir−Φr(A)) x= 0, which proves that the pair ( −ϕ,0) exposes the point ( γ∗γ,γ∗Aγ) in Γn(K). /square Using the results established above we can prove, applying similar tec hniques as in [WW99, Theorem 4.3], a version of the Krein-Milman matricial theorem featu ring matrix exposed points. Theorem 3.14 (The Straszewicz-Klee theorem for matrix convex sets ).LetKbe a compact matrix convex set in a normed vector space V.ThenmexpK/\\e}atio\\slash=∅and K=mconv(mexp K). Proof.LetK= (Kn)n∈Nbe a compact matrix convex set in a normed space V. By the classical Straszewicz-Klee theorem (see [ Bar02, Section II.2] and [ Kle58]), the set of exposed points of K1is non-empty, so by Proposition 3.3, also mexp K/\\e}atio\\slash=∅.The inclusion mconv(mexp K)⊆Kholds by deﬁnition, so we only need to prove K⊆mconv(mexp K). We can assume 0 ∈mconv(mexp K),otherwise translate each Knby an element a⊗In for some ﬁxed a∈K1(as translations preserve matrix exposed points).\n24 IGOR KLEP AND TEA ˇSTREKELJ Supposethereis AinKn\\(mconv(mexp K))n.BythematricialHahn-Banachseparation theorem[ EW97, Theorem5.4]thereexistsacontinuouslinearmapΦ : V→Mnsuchthat: (3.17) ReΦ r(B)/precedesequalIn·r for every positive integer randB∈(mconv(mexp K))r,but: (3.18) ReΦ n(A)/notprecedesoreql In2. The idea in the following is to reduce the problem to a point where the cla ssical Straszewicz theorem [ Bar02, Section II.2], more precisely, its generalisation for normed spaces due to Klee [ Kle58], applies. For that we use the fact that the map Φ associates to every pair of matrices γ,δ∈Mr,na continuous linear functional ϕ2:Mn(V)→Cwith: ϕ2(γ∗Bδ) =v∗ γΦr(B)vδ forB∈Mr(V). Herevγandvδfrom (Cn)rare the vectorizations of γandδas in (3.13). Let (δ,C) be an exposed point of Γ n(K). By Proposition 3.13it can be expressed as (δ,C) = (η∗η,η∗Bη) for some matrix exposed point B∈Kr,matrixη∈Mr,nwith tr(η∗η) = 1 (hence its vectorization vηsatisﬁesv∗ ηvη= 1) and positive integer r≤n. Accordingly we extend ϕ2to a functional ϕ:Mn×Mn(V)→Cby ϕ(η∗η,η∗Bη) =v∗ η(In·r+Φr(B))vη. Inequality ( 3.17) now gives Reϕ(η∗η,η∗Bη) = Re( v∗ η(In·r+Φr(B))vη) = 1+v∗ ηReΦr(B)vη ≤1+v∗ ηIn·rvη= 2. Since the above holds for every ( δ,C) in Γ n(K) and the compactness of Kimplies the compactness of Γ n(K), we have by the Klee generalisation of the Straszewicz theorem [Kle58] that (3.19) Re ϕ(ǫ,D)≤2 for every (ǫ,D)∈Γn(K) (sinceϕis linear and every such ( ǫ,D) is a limit of a sequence of convex combinations of exposed points). Equation ( 3.19) implies that for every positive integerr,unit vector vη∈Cr·nandB∈Kr, 1+v∗ ηReΦr(B)vη= Reϕ(η∗η,η∗Bη)≤2 = 1+v∗ ηIn·rvη, which in turn implies ReΦ r(B)/precedesequalIn·r. But this contradicts condition ( 3.18), hence mconv(mext K) =K. /square 3.4.Matrixexposed pointsofmatrixstate spaces. Foranoperatorsystem Rlet CP n(R) denote the set of all completely positive (cp) maps and UCP n(R) the set of all unital completely positive (ucp) maps from RtoMnrespectively. We identify both sets in a canonicalway with subsets of Mn(R∗).Thenthefamily CP(R) = (CP n(R))n∈Nisaweak∗ closed matrix convex cone in R∗meaning it is closed under formation of the following combinations: (3.20)k∑ i=1V∗ iψiVi∈Mn(R∗) fork∈N,elementsψi∈CPni(R) and matrices Vi∈Mni,n.On the other hand, the family UCP(R) = (UCP n(R))n∈N,usually referred to as the matrix state space of the operator systemR,is a weak∗compact matrix convex set in R∗,i.e., closed under matrix convex\nFACIAL STRUCTURE OF MATRIX CONVEX SETS 25 combinations ( 3.20), where∑textk i=1V∗ iVi=In. Moreover, by [ Far04, Proposition 1.2] we see thatCP(R) is the matrix conic hull of UCP(R) as we have CPn(R) ={γ∗ϕγ|γ∈Mn, ϕ∈UCPn(R)}. For every positive integer nthe component CP n(R) is a convex cone and the set UCPn(R) is convex. In this section we describe the relationship between mat rix exposed points of UCP(R) and the exposed rays of CP(R) while keeping in mind the analogous connection between matrix extreme points and extremal rays (se e [Far04]). We begin by recalling some of the known results. A cp mapϕ:R →Mnis calledpureif for every cp map ψ:R →Mn,for whichϕ−ψ is completely positive, we have that ψ=tϕfor some real number t∈[0,1]. It turns out (see [Bar02, Section II.8]) that pure cp maps in CP n(R) determine the extremal rays of this cone, i.e., the extremal rays are exactly rays of the form {tϕ|t≥0}for some pure cp mapϕ.The following proposition explains the interplay between pure cp maps and pure states, i.e., pure ucp maps. Proposition 3.15 ([Far04, Theorem 2.2]) .Letψ∈CPn(R)be pure. Then there exists a positive integer k≤n, a pure state ϕ∈UCPk(R)and a matrix γ∈Mk,nsuch that ψ=γ∗ϕγ. If the matrix γin this proposition is invertible, then the reverse implication holds, i.e., for a pure state ϕ∈UCPk(R) the mapψ=γ∗ϕγ∈CPn(R) is pure (ψis clearly completely positive even with no condition on γ). Indeed, let θ∈CPn(R) satisfyψ−θ∈ CPn(R).Then the map ( γ∗)−1θγ−1lies in CP k(R) and: (γ∗)−1(ψ−θ)γ−1=ϕ−(γ∗)−1θγ−1∈CPk(R). Sinceϕis pure, there is a t∈[0,1] such that ( γ∗)−1θγ−1=tϕand henceθ=tψ. To conclude this short summary we note the fact that the pure sta tes on the operator systemRcorrespond to matrix extreme points in UCP(R) (see [Far04]). We now turn our attention to the case of matrix exposed points. Proposition 3.16. Suppose for a completely positive map ψ∈CPn(R)the corresponding ray{tψ|t≥0}is exposed in CPn(R).Then there exists a positive integer k≤n, a state ϕ∈UCPk(R)and a matrix γ∈Mk,nsuch thatψ=γ∗ϕγ,andϕis a matrix exposed point inUCP(R). Proof.Sinceψ∈CPn(R) determines the exposed ray {tψ|t≥0}in CP n(R),there is a linear functional F:Mn(R∗)→CsatisfyingF(tψ) = 0 for all t≥0 andF(θ)>0 for allθ∈CPn(R)\\{tψ|t≥0}.By Proposition 3.15, there is a positive integer k≤n, a pure stateϕ∈UCPk(R) andγ∈Mk,nsuch thatψ=γ∗ϕγ; soϕis matrix extreme in UCP(R).If we prove that ϕis an exposed point in UCP k(R),the by part (b) of Theorem 3.8it is also matrix exposed. To prove ϕis exposed deﬁne the functional G:Mk(R∗)→C by G(θ) =F(γ∗θγ) forθ∈Mk(R∗).By the properties of Fwe haveG(θ)≥0 for allθ∈UCPk(R) (since γ∗θγ∈CPn(R)) andG(ϕ) = 0.Asϕis the only unital element of the ray {tψ|t≥0}, we haveG(θ)>0 for allθ∈UCPk(R)\\{ϕ}.Hence the pair ( G,0) exposesϕ. /square Remark 3.17. To give a partial converse to Proposition 3.16, analogousto that of Proposi- tion3.15, letγ∈Mnin the above notation be invertible and let ϕ∈UCPn(R) be matrix exposed. Then ϕis both matrix extreme and exposed in the classical sense; so the re mark\n26 IGOR KLEP AND TEA ˇSTREKELJ after Proposition 3.15implies that the map γ∗ϕγis pure completely positive. Suppose we are in the special case when the pair ( G,0) for some functional G:Mn(R∗)→Cexposes ϕin UCP n(R).We now claim that F(θ) =G( (γ∗)−1θγ−1) deﬁnes a functional F:Mn(R∗)→Cwhich exposes the ray {tγ∗ϕγ|t≥0}.Clearly, F(tγ∗ϕγ) =tG(ϕ) = 0.Forθ∈CPn(R) denotetθ=/bardblθ(1)/bardblso that we have F(θ tθ) = G( (γ∗)−1θ tθγ−1) ≥0 (sinceθ tθ∈UCPn(R)) implying F(θ)≥0.On the other hand, we haveF(θ tθ) =G( (γ∗)−1θ tθγ−1) = 0 (soF(θ) = 0) if and only if ( γ∗)−1θγ−1=tθϕ,whence θ=tθγ∗ϕγ. Example 3.18. LetAbe a separable unital C∗-algebra. Then the matrix extreme points, i.e., pure matrix states, of the matrix state space UCP(A) are matrix exposed. Indeed, by part (b) of Theorem 3.8, it is enough see that every ordinary extreme point ϕof CPn(A) is ordinary exposed. By the canonical correspondence between lin ear maps A →Mn and linear functionals on Mn(A) (see [Pau02, Chapter 6]), such a ϕdetermines a state ˜ϕ:Mn(A)→Cgiven by ˜ϕ(X) =1 n/a\\}bracketle{tϕn(X)e,e/a\\}bracketri}ht, wheree=e1⊕···⊕enand theeiare standard basis vectors of Cn.The above correspon- dence is in fact a linear bijection and as such it preserves extreme an d exposed points. Hence,ϕbeingextreme inCP n(A)implies that ˜ ϕisa purestateofthe C∗-algebraMn(A). But then by [ AS01, Corollary 3.55], ˜ ϕis exposed in Mn(A)∗, which in turn implies that ϕis an exposed point of CP n(A). ♦ 4.Matrix faces and matrix exposed faces We proceed by discussing several possible notions of a face and an e xposed face of a matrix convex set. The main distinction is whether one considers su bsets of a single component Knfor somen∈Nor multicomponent subsets of a matrix convex set K. All the presented deﬁnitions aim to extend the concepts of a matrix ex treme point or a matrix exposed point. We also explain how their properties resemble those o f the (exposed) faces in the classical sense and investigate the interplay between the not ions of a matrix face and a matrix exposed face. 4.1.Fixed-level matrix faces. In this section we present three aspirant deﬁnitions of a non-graded matrix face and explore the resemblance of their prop erties with the classical theory: Proposition 4.4states that the C∗-extreme points of a matrix face of a matrix convex set Kare matrix extreme in Kand in Theorem 4.12we prove that any matrix face that is ordinary exposed is in fact a matrix exposed face. As a c orollary of the latter we observe that every matrix face or C∗-face of a free spectrahedron is matrix exposed. Although it is not clear whether they are ordinary faces, weak matr ix face are included in the list as the most straightforward generalisation of a matrix ext reme point. Deﬁnition 4.1. LetK= (Kr)r∈Nbe a matrix convex set in the space VandFa convex subset ofKn.\nFACIAL STRUCTURE OF MATRIX CONVEX SETS 27 (a)ThenFisamatrixface ifforevery tupleofpoints A1,...,A kfromKwithAi∈Kni and every tuple of surjective matrices γi∈Mni,nsatisfying∑textk i=1γ∗ iγi=In,the condition (4.1)k∑ i=1γ∗ iAiγi∈F, impliesni=nandAi∈Ffori= 1,...,k. (b) IfFis aC∗-convex matrix face, then it is a C∗-face. (c) The set Fis aweak matrix face if for every tuple of points A1,...,A kfromKwith Ai∈Kniand every tuple of surjective matrices γi∈Mni,nsatisfying∑textk i=1γ∗ iγi=In,the condition k∑ i=1γ∗ iAiγi∈F, impliesni=nand eachAiis unitarily equivalent to some element in F.We will denote byU(F) ={U∗AU|A∈F, U∈Mnunitary}the unitary orbit of F. Remark 4.2. (a) It is clear from the deﬁnition that a matrix face or C∗-faceFis itself a face in the classical sense and that the matrix convex set mconv( Kn\\F) is disjoint from F.Similarly, in the case of a weak matrix face, the set mconv( Kn\\U(F)) is disjoint from F. (b) Since in dimension 1 unitary equivalence implies equality and C∗-convexity implies classical convexity, thematrixfacesofalltypesin K1coincidewithitsfacesintheclassical sense. Also, K1itself is a matrix face, however Knforn>1 is never a matrix face of any type. Indeed, for any v∈K1we have ⊕nv=n∑ i=1eive∗ i∈Kn, where (ei)iis the standard basis of Cnsatisfying∑textn i=1eie∗ i=In. In general, a matrix face ( C∗-face)F⊆Kn(or its unitary orbit in the case of a weak matrix face) does not contain any reducible elements of the form A⊕B∈Mr+s(V) for r,s<nas we can express A⊕B=(g Ir 0)g A(Ir0) +(g 0 Is)g B(0Is) . This gives the intuition that just as points of a matrix convex set are only sporadically matrix extreme, there are in general very few (boundary) points that are contained in a matrix face. (c) A matrix face Fis closed under unitary conjugation. Indeed, for A∈F, B∈Kn and a unitary matrix U∈Mn,by (4.1) the condition U∗BU=A∈FimpliesB∈F. (d) IfA∈Knis matrix extreme, then its unitary orbit U(A) ={U∗AU|U∈ Mnunitary}, though in general not convex, satisﬁes the matrix face condition (4.1). Indeed, if for a tuple of points A1,...,A kfromKand a tuple of surjective matrices γi∈Mni,nwith∑textk i=1γ∗ iγi=Inwe have U∗AU=k∑ i=1γ∗ iAiγi, whereU∈Mnis a unitary matrix, then A=∑textk i=1Uγ∗ iAiγiU∗andAbeing matrix extreme forces all Aito be unitarily equivalent to A.\n28 IGOR KLEP AND TEA ˇSTREKELJ (e) A singleton F={A}is a weak matrix face if and only if Ais a matrix extreme point. (f) To get rid of the surjectivity of the matrices γiin (4.1), an equivalent condition for a convex set F⊆Knto be a matrix face demands that for every tuple of points A1,...,A k, where each Aibelongs to Knifor someni≤n,and every tuple of nonzero matricesγi∈Mni,nsatisfying∑textk i=1γ∗ iγi=Inthe condition (4.2)k∑ i=1γ∗ iAiγi∈F, impliesni=nandAi∈Ffori= 1,...,k.It is easy to check that ( 4.1) and (4.2) are equivalent. The analogous deﬁnitions for C∗-faces and weak matrix faces can be formulated similarly. The next example will show that as in the case of matrix extreme point s, some of the components Knneed not contain any matrix faces. Example 4.3 (all types) .Given a pair of real numbers aandbwitha < bdeﬁne the corresponding matrix interval [aI,bI] := ([aIn,bIn])n∈N,where [aIn,bIn] :={α∈Mn|aIn/precedesequalα/precedesequalbIn}. A simple argument in [ WW99, Example 2.2] shows the only matrix extreme points of [aI,bI] are the numbers a,b∈[aI,bI]1= [a,b].EachA∈[aI,bI]ncan be expressed as a matrix convex combination of aandb.So none of the [ aI,bI]nforn >1 contains any matrix face. ♦ In general, a compact matrix convex set Kover a ﬁnite-dimensional space is the (al- ready closed) matrix convex hull of its matrix extreme points by a ve rsion of the matricial Krein-Milman theorem [ WW99, Theorem 4.3] (see also [ HL21, Theorem 2.9]), and ev- ery pointA∈Kncan be expressed as a matrix convex combination of matrix extreme points from the sets K1,...,K n.Hence by part (f) of Remark 4.2, a component Knwhich contains a matrix face of any type must also contain a matrix extrem e point. Moreover, the elements of a matrix face or a C∗-face can only be described by matrix convex com- binations of matrix extreme points of K, which lie in F.Similarly, only matrix convex combinations of matrix extreme points that lie in U(F) can describe points in a weak matrix face F. An important property of classical faces is that their extreme poin ts are also extreme in the whole set and the next proposition gives a matrix version of it. W hile the notion of aC∗-extreme point in a (not necessarily C∗-convex) convex set might not be natural, this hereditary property of C∗-extreme points holds for all types of matrix faces. Proposition 4.4 (all types) .LetKbe a matrix convex set and F⊆Kna matrix face. EveryC∗-extreme point of Fis a matrix extreme point of K. Proof.First suppose that F⊆Knis a matrix face or a C∗-face andAis aC∗-extreme point inF.Suppose we can express Aas (4.3) A=k∑ i=1γ∗ iAiγi∈F fork-tuples (Ai)k i=1and (γi)k i=1, where each Aiis inKniandγi∈Mni,nare surjective matrices with∑textk i=1γ∗ iγi=In. SinceFis a matrix face, we deduce ni=nandAi∈Ffor\nFACIAL STRUCTURE OF MATRIX CONVEX SETS 29 i= 1,...,k.But thenAbeingC∗-extreme implies that all the Aiare unitarily equivalent toA. IfFis a weak matrix face, the condition ( 4.3) impliesni=nandAi∈ U(F) for i= 1,...,k.So eachAiis of the form U∗ iBiUifor some unitary Ui∈MnandBi∈F. Then asAisC∗-extreme, all the Biand therefore all the Ai,too, are unitarily equivalent toA. /square 4.2.Matrixexposedfaces. Thissectiongivesthreepossiblegeneralisationsoftheconcept of a matrix exposed point to a set, namely a matrix exposed face. Deﬁnition 4.5. LetK= (Kr)r∈Nbe a matrix convex set in a dual vector space VandF a convex subset of Kn. (a)ThenFisamatrixexposed face ifthereexists a continuouslinear mapΦ : V→Mn and a self-adjoint matrix α∈Mnsatisfying the following conditions: (i) for every positive integer mandB∈Kmwe have Φ m(B)/precedesequalα⊗Im; (ii) for any m<nandB∈Kmwe have Φ m(B)≺α⊗Im; (iii){B∈Kn|α⊗In−Φn(B)/{ollowsequal0 is singular }=F. (b) IfFis aC∗-convex matrix exposed face, then it is a C∗-exposed face . (c) We call Faweak matrix exposed face if there exists a continuous linear map Φ :V→Mnand a self-adjoint matrix α∈Mnsatisfying the following conditions: (i) for every positive integer mandB∈Kmwe have Φ m(B)/precedesequalα⊗Im; (ii) for any m<nandB∈Kmwe have Φ m(B)≺α⊗Im; (iii){B∈Kn|α⊗In−Φn(B)/{ollowsequal0 is singular }=U(F). We call (Φ,α) in the notation above an exposing pair of the matrix exposed face F. Remark 4.6. (a) As in the case of matrix faces of all types, the matrix exposed f aces inK1 of all types coincide with its ordinary faces. Indeed, it is clear that e very matrix exposed face inK1is ordinary exposed. For the converse we only need to observe tha t ifF⊆K1 is ordinary exposed with an exposing pair ( ϕ,α),then the condition ϕ|K1≤αimplies ϕm(B)/precedesequalα⊗Im for every positive integer mandB∈Km.Indeed, ifϕm(B)/notprecedesoreqlα⊗Imfor somem∈Nand B∈Km,then there is a unit vector ξ∈Cnmsuch that 0>ξ∗(α⊗Im−ϕm(B))ξ=α−ϕ(ξ∗Bξ) But asξ∗Bξ∈K1,this contradicts the condition ϕ|K1≤α. (b) For any matrix aﬃne map Φ ,unitaryU∈MnandB∈Kn,the matrix α⊗In−Φn(U∗BU) = (In⊗U∗)( α⊗In−Φn(B)) (In⊗U) is singular if and only if α⊗In−Φn(B) is singular. Hence, the condition (iii) in part (a) of the above deﬁnition implies that a matrix exposed face is closed und er conjugation by unitaries. (c) LetA∈Knbe a matrix exposed point with the pair (Φ ,α) exposing it. Then by deﬁnition and part (c) of Remark 3.2, the same pair (Φ ,α) satisﬁes the conditions in part (a) of Deﬁnition 4.5for exposing the (in general non-convex) unitary orbit of A. (d) A singleton F={A}is a weak matrix exposed face if and only if Ais a matrix exposed point.\n30 IGOR KLEP AND TEA ˇSTREKELJ (e) For a matrix exposed face F⊆Knof any type the intersection: N=∈tersectiondisplay A∈Fker(α⊗In−Φn(A)) is always nontrivial. If we restrict the search to a unit vector in N,then by the ﬁnite intersection property it suﬃces to prove that for every ﬁnite sele ction ofA1,...,A k∈F the intersection (4.4)k∈tersectiondisplay i=1ker( α⊗In−Φn(Ai)) ∩Sn2 is nonempty. Here Sn2denotes the unit sphere in Cn⊗Cn.So suppose A1,...,A k∈F are such that the intersection ( 4.4) is empty and consider the convex combination A= 1 k( A1+···+Ak) ∈F.For this point the matrix α⊗In−Φn(A) is nonsingular, which implies by Deﬁnition 4.5thatFis not a matrix face. Proposition 4.7 (all types) .LetF⊆Knbe a matrix exposed face of a matrix convex set KandΦ :V→Mntogether with α∈Mnan exposing pair. Then for every nonzero x=∑textn i=1xi⊗ei∈Cn⊗CninN,its components x1,...,x nspanCn.Moreover, Nis one-dimensional. Proof.LetPbe the projection onto span {x1,...,x n}.Then as in the proof of part (a) of Proposition 3.4,α⊗Ir−Φr(PAP∗) is singular for any A∈F,butPAP∗∈Krfor some r<n.The proof of part (b) of Proposition 3.4then shows that Nis one-dimensional. /square Proposition 4.8. LetK= (Kn)n∈Nbe a matrix convex set. Then every matrix exposed faceF⊆Knis an exposed face of Kn. Proof.LetF⊆Knbe a matrix exposed face and Φ : V→Mntogether with α∈Mn an exposing pair. By part (e) of Remark 4.6, there is a nonzero x∈ N.Now deﬁne the functionalϕ:Mn(V)→Cby (4.5) ϕ(B) =x∗Φn(B)x, and the real number a=x∗(α⊗In)x∈R.Since the pair (Φ ,α) matricially exposes F,we have by the choice of xthat a−ϕ(B) =x∗( α⊗In−Φn(B)) x= 0 for allB∈F,but also a−ϕ(B) =x∗( α⊗In−Φn(B)) x≥0 for allB∈Kn.Moreover, if B∈Knsatisﬁesϕ(B) =a,then (α⊗In−Φn(B))x= 0. Henceα⊗In−Φn(B) is singular, so B∈F. We conclude that ϕ(B) =aif and only if B∈F,which shows that the pair ( ϕ,a) exposesFinKn. /square Example 4.9. SupposeLandMare two linear pencils such that DM⊆ DLandDM(n)∩ ∂DL(n)/\\e}atio\\slash=∅for somen∈N.Let nmin:= min{n∈N| DM(n)∩∂DL(n)/\\e}atio\\slash=∅}. IfF=DM(nmin)∩∂DL(nmin) is convex, then it is clearly a matrix exposed face in DM. Indeed, ifL=A0+∑textg i=1Aixi,then the pair ( L−A0,A0) matricially exposes F.♦\nFACIAL STRUCTURE OF MATRIX CONVEX SETS 31 4.3.Interplay between matrix faces and matrix exposed faces. The aim of this section is to show that a matrix face ( C∗-face) is exposed if and only if it is a matrix exposed face (C∗-exposed face). It is not clear if a weak matrix exposed face is an ex posed face, however the “only if” part of the claim still holds in this case, i.e., an ord inary exposed weak matrix exposed face is in fact weakly matrix exposed (see Theo rem4.12). Remark 4.10. We emphasize that the zero map and the zero matrix always deﬁne an exposing pair (of any type) for Kn,even though Knforn>1 is never a matrix face. Proposition 4.11 (all types) .LetKbe a matrix convex set and F⊂noteqlKna matrix exposed face. Then Fis a matrix face. Proof.The proof is analogous to that of Proposition 3.5regarding matrix exposed points. LetF⊆Knbe a matrix exposed face of any type with Φ : V→Mnandα∈Mnan exposing pair. Further, assume we have k∑ i=1γ∗ iAiγi=A∈F fork-tuples (Ai)k i=1and (γi)k i=1, where each Aiis inKniandγi∈Mni,nare surjective matrices (so ni≤n) with∑textk i=1γ∗ iγi=In. By assumption we have Ini⊗α−Φni(Ai)/{ollowsequal0 for everyi= 1,...,k.Also α⊗In−Φn(A) =k∑ i=1(γ∗ i⊗In)( Ini⊗α−Φni(Ai)) (γi⊗In), (4.6) where clearly ( γ∗ i⊗In)( Ini⊗α−Φni(Ai)) (γi⊗In)/{ollowsequal0 fori= 1,...,k.Suppose any of the pointsAi,sayA1,is not inF(not inU(F) for the case of a weak matrix exposed face) and hencesatisﬁes Ini⊗α−Φni(Ai)≻0bydeﬁnition. Wewillprovethatthelatterimplies γ1= 0. By Proposition 4.7, there is an x=∑textn i=1xi⊗ei∈ N=∈tersectiontext A∈Fker(α⊗In−Φn(A)) such that span {x1,...,x n}=Cn.Equality ( 4.6) together with the positive semi-deﬁniteness of the right-hand side summands imply that xlies in the intersection of the kernels of the matrices (γ∗ i⊗In)( Ini⊗α−Φni(Ai)) (γi⊗In) fori= 1,...,k.In particular, we have (γ∗ 1⊗In)( In1⊗α−Φn1(A1)) (γ1⊗In)x= 0,which, together with the positive deﬁniteness of the middle factor and injectivity of ( γ∗ 1⊗In),implies that xlies in the kernel of γ1⊗In, i.e., we have: 0 = (γ1⊗In)x= (γ1⊗In)(gn∑ j=1xj⊗ej)g =n∑ j=1γ1xj⊗ej. Soγ1xi j= 0 fori= 1,...,dandj= 1,...,n,whenceγ1= 0. /square Theorem 4.12 (all types) .LetKbe a matrix convex set and F⊆Kna matrix face that is also an exposed face. Then Fis a matrix exposed face. Proof.First, suppose F⊆Knis a matrix face or a C∗-face, hence it is closed under conjugation by unitaries, and suppose Fis also exposed in the classical sense. By part (a) of Remark 4.6we may assume n>1.Moreover, we may assume 0 n/∈Fand 0∈K1. Indeed, otherwisereplace Kby−v+Kforanyvector v∈K1.Notethat In⊗v=⊕nv /∈F asFdoes not contain reducible elements by part (b) of Remark 4.2. By assumption, we also haveF⊂noteqlKnsinceKnis never a matrix face. By considering the matrix convex set L= mconv(Kn\\F),which is disjoint from F, we construct, analogously to the proof of part (b) of Theorem 3.8, from the pair ( ϕ,a)\n32 IGOR KLEP AND TEA ˇSTREKELJ exposingF,a continuous linear map Φ : V→Mnand a self-adjoint matrix α=aIn∈Mn that satisfy Φ m(B)/precedesequalα⊗Imfor allm∈NandB∈Km.Also, the following relationholds: /angbracketleftbig Φn(A)η0,η0/angbracketrightbig =ϕ(A) =a for some unit vector η0∈(Cn)nand allA∈F.So for allA∈Fthe corresponding matrix aIn2−Φn(A) is singular. We now show that for a point B∈Kn\\Fthe matrix aIn2−Φr(B) is nonsingular. So suppose some unit vector η∈(Cn)nof the form ( 3.8) satisﬁes/angbracketleftbig ReΦn(B)η,η/angbracketrightbig = Reϕ(α∗Bα) =ap(α∗α) =a.By the same reasoning as in ( 3.10) we see that αis a con- traction. As we assumed 0 ∈L1,the pointα∗Bαbelongs toLn,sinceLis closed under conjugation by contractions. Because of the strong separation ofFfromLndetermined by (ϕ,a),we get Reϕ(α∗Bα)<ap(α∗α), which is a contradiction. The above reasoning can be easily adapted for case of a weak matrix face by considering t he matrix convex set mconv(Kn\\U(F)) instead of mconv( Kn\\F). Finally, we claim that for any m<nandB∈Kmthe strict inequality Φ m(B)≺α⊗Im holds. So suppose m<nandB∈Kmaresuch that α⊗Im−Φm(B) is singular (while also positive semideﬁnite). Then by part (b) of Remark 4.2,B⊕C /∈Ffor anyC∈Kn−m. By the singularity of α⊗In−Φn(B⊕C) =( α⊗Im−Φm(B)) ⊕( α⊗In−m−Φn−m(C)) , this contradicts Fbeing a matrix exposed face (cf. part (c) of Remark 3.2). The claim also holds if Fis a weak matrix exposed face, where in the above reasoning we use t he fact that U(F) does not contain any reducible elements. Having proven the last cla im, we conclude that the pair (Φ ,aIn) matricially exposes F. /square Recall how a matrix convex set Kdetermines a family of convex sets {Γn(K)}n∈N given by ( 3.11) in Section 3.3. We proceed by showing that for each n∈N,there is a connection between matrix exposed faces of Kand exposed faces of Γ n(K) analogous to the one regarding points in Proposition 3.13. We state it as Proposition 4.13, whose proof mimics the one of Proposition 3.13. Proposition 4.13. LetK= (Kn)n∈Nbe a matrix convex set and F⊆Kr.Then the following holds: (a)Letγ∈Mr,nbe a surjective matrix with tr(γ∗γ) = 1such that the set (4.7) Fγ:={(γ∗γ,γ∗Aγ)|A∈F} is an exposed face of Γn(K).ThenFis a weak matrix exposed face of K. (b)IfFis a weak matrix exposed face of K, then for any invertible γ∈Mrwith tr(γ∗γ) = 1,the setFγin(4.7)is an exposed face of Γr(K). Proof.To prove (a) suppose Fγas above is an exposed face of Γ n(K) for some surjective γ∈Mr,nwith tr(γ∗γ) = 1.By assumption there exists a continuous linear functional ϕ:Mn×Mn(V)→Cand a real number asuch thatϕ(γ∗γ,γ∗Aγ) =aandϕ(δ,C)>a for all (δ,C)∈Γn(K)\\Fγ. Now decompose ϕintoϕ=ϕ1+ϕ2,whereϕ1:Mn→Candϕ2:Mn(V)→C. By the Riesz representation theorem there is a self-adjoint matrix β∈Mnsuch that ϕ1(δ) = tr(βδ).For any matrix η= (η1,...,η n)∈Mm,nand its vectorization (4.8) vη=n∑ i=1e′ i⊗ηi∈Cn⊗Cm\nFACIAL STRUCTURE OF MATRIX CONVEX SETS 33 we have ϕ1(η∗η) = tr(βη∗η) = tr(ηβη∗) =v∗ η(β⊗Im)vη. By the canonical correspondence between linear functionals on Mn(V) and linear maps V→Mn,the functional ϕ2gives rise to a map Ψ : V→Mn.For everyB∈Mm(V) and matrixη= (η1,...,η n)∈Mm,nwith its vectorization vηas in (4.8) we have ϕ2(η∗Bη) =v∗ ηΨm(B)vη. Soforeverypositiveinteger m,elementB∈Kmandmatrix η∈Mm,nwiththeproperty tr(η∗η) = 1, v∗ η( (β−aIn)⊗Im−Ψm(B)) vη=ϕ(η∗η,η∗Bη)−a≥0. (4.9) Since tr(η∗η) = 1 if and only if vη∈Cmnis a unit vector, the above implies that the matrix (β−aIn)⊗Im−Ψm(B) is positive semideﬁnite. For A∈Fwe also have v∗ γ( (β−aIn)⊗Ir−Ψr(A)) vγ=ϕ(γ∗γ,γ∗Aγ)−a= 0. (4.10) Thepositive semi-deﬁniteness of( β−aIn)⊗Ir−Ψr(A) implies( (β−aIn)⊗Ir−Ψr(A)) vγ= 0).So (β−aIn)⊗Ir−Ψr(A) is singular for every A∈F. Again, by the Douglas Lemma 3.12, (η∗η,η∗Bη)∈Γn(K) withB∈Kmandη∈Mm,n is of the form ( γ∗γ,γ∗Aγ) for some A∈Fif and only if r=mand there is a unitary matrixU∈Mrsuch thatη=UγandA=U∗BU.By the calculation ( 3.16) we have ϕ(η∗η,η∗Bη)−a=v∗ η( (β−aIn)⊗Ir−Ψr(B)) vη. Using the properties of ϕwe deduce that for B∈Kmthe matrix ( β−aIn)⊗Im−Ψm(B) is singular if and only if m=randB∈ U(F). Finally, we deﬁne the map Φ : V→Mrby Φ =γΨγ∗and the self-adjoint matrix α∈Mrbyα=γ(β−aIr)γ∗.Now the same reasoning as in the proof of part (a) of Proposition 3.13shows that vγis in the range of ( γ∗⊗Ir) so thatα⊗Ir−Φr(A) is singular for all A∈F.Since the positive semi-deﬁniteness in all the points of Kis clear and the deﬁniteness outside of U(F) follows from the injectivity of γ∗,the pair (Φ ,α) matricially exposes FandFis a weak matrix exposed face. To prove (b) assume F⊆Kris a weak matrix exposed face and let Φ : V→Mr together with α∈Mrbe an exposing pair. We claim that for any invertible γ∈Mrwith tr(γ∗γ) = 1, Fγ={(γ∗γ,γ∗Aγ)|A∈F}is an exposed face of Γ r(K). By Proposition 4.7, there is an x=∑textr i=1xi⊗ei∈Cr⊗CrinN=∈tersectiontext A∈Fker(α⊗Ir− Φr(A)) such that span {x1,...,x r}=Cr.Let (Ψ,β) =δ(Φ,α)δ∗andy= (δ⊗δ)x,where δ∈Mrdenotes the inverse of γ,and deﬁne a functional ϕ:Mr×Mr(V)→C, ϕ(µ,C) =y∗( β⊗µ−Ψr(C)) y forC∈Mr(V) andµ∈Mr.Since Ψ is matrix aﬃne, we see that for any positive integer n,elementB∈Knand surjective matrix η∈Mn,rwith tr(η∗η) = 1, ϕ(η∗η,η∗Bη) =( (η⊗Ir)y)∗( β⊗In−Ψn(B)) (η⊗Ir)y≥0. By Proposition 4.7, the same reasoning as in the proof of part (b) of Proposition 3.13 shows that if ( η∗η,η∗Bη)∈Γn(K)\\Fγ,thenϕ(η∗η,η∗Bη)>0.On the other hand, for (γ∗γ,γ∗Aγ)∈Fγwe have ϕ(γ∗γ,γ∗Aγ) = ((Ir⊗γ)y)∗( β⊗Ir−Ψr(A)) (Ir⊗γ)y = ((δ⊗Ir)x)∗( β⊗Ir−Ψr(A)) (δ⊗Ir)x =x∗( α⊗Ir−Φr(A)) x= 0.\n34 IGOR KLEP AND TEA ˇSTREKELJ Hence the pair ( −ϕ,0) exposesFγin Γn(K). /square Next we state a corollary of Proposition 4.13regarding matrix exposed faces. The proof is omitted as it is similar to the one of Proposition 4.13. Corollary 4.14. LetK= (Kn)n∈Nbe a matrix convex set and Fa subsetKrthat is closed under conjugation by unitaries. Then the following holds: (a)Letγ∈Mr,nbe a surjective matrix with tr(γ∗γ) = 1such that the set Fγin(4.7) is an exposed face of Γn(K).ThenFis a matrix exposed face of K. (b)IfFis a matrix exposed face of K, then for any invertible γ∈Mrwithtr(γ∗γ) = 1, the setFγin(4.7)is an exposed face of Γr(K). Example 4.15. LetKbe a compact matrix convex set in a ﬁnite-dimensional space V. As a corollary of Proposition 4.13we now give an example of a weak matrix exposed face ofK. SinceKis compact, Γ n(K) is a compact subset of the ﬁnite-dimensional space Mn×Mn(V) and so for any ﬁxed r<n,the minimum m:= min{/bardblγ∗γ/bardbl|γ∈Mr,n,tr(γ∗γ) = 1,such that ∃A∈Mrwith (γ∗γ,γ∗Aγ)∈Γn(K)} is attained in some γ∈Mr,nwith tr(γ∗γ) = 1. Then Fγ={(δ∗δ,δ∗Aδ)|A∈Kr, δ∈Mr,n,tr(δ∗δ) = 1, δ∗δ=γ∗γ} is the intersection of Γ n(K) with the aﬃne plane {(ǫ,B)∈Mn×Mn(V)|ǫ=γ∗γ}.Hence Fγis an exposed face of Γ n(K) which by Proposition 4.13implies that F={A∈Kr| ∃δ∈Mr,n,tr(δ∗δ) = 1, δ∗δ=γ∗γand (γ∗γ,γ∗Aγ)∈Fγ} is a weak matrix exposed face of K. ♦ 4.3.1.Matrix faces and matrix exposed faces in free spectrahedra. As an application of Proposition 4.12we can deduce that every matrix face ( C∗-face) of a free spectrahedron is a matrix exposed face ( C∗-exposed face). Indeed, by Proposition 4.12it is enough to prove every face of a free spectrahedron is exposed. For this we apply the result [RG95, Corrolary 1] by Ramana and Goldman stating that every face of a s pectrahedron is exposed. But since DL(n) can be considered a spectrahedron in the Euclidean space Sg n for arbitrary n∈N,every face of a free spectrahedron is exposed, too. Weconcludewithaninsightintothestructureof(exposed)faceso fafreespectrahedron. First recall that for a convex set K⊆Rnand pointx∈K, there is a unique face FK(x) of Kwhich contains xin its relative interior (see [ Bar02, Section II.2]). In general we have FK(x) = aﬀ(FK(x))∩K, where aﬀ(FK(x)) denotes the aﬃne span of FK(x).Now letn∈NandA0,...,A gbe com- plex self-adjoint matrices of size n×nand letL=A0+∑textg i=1Aixibe the corresponding linear pencil. The following theorem (cf. [ RG95, Theorem 1]) gives for a point Xin the free spectrahedron DLa concrete description of the unique face FL(X) that contains X in its relative interior. Theorem 4.16. LetLbe a linear pencil and X∈ DL(n).Then FL(X) ={Y∈ DL(n)|kerL(Y)⊇kerL(X)} ={Y∈Sg n|kerL(Y)⊇kerL(X)}∩DL(n) ={Y∈ DL(n)|x∗L(Y)x= 0∀x∈kerL(X)} ={Y∈Sg n|x∗L(Y)x= 0∀x∈kerL(X)}∩DL(n).\nFACIAL STRUCTURE OF MATRIX CONVEX SETS 35 Moreover, aﬀ(FL(X)) ={Y∈Sg n|kerL(Y)⊇kerL(X)}. We now present a suﬃcient condition to determine for which X∈ DLthe faceFL(X) is a matrix (exposed) face. The following is an easy corollary of Propos ition4.13, adapted to free spectrahedra. Corollary 4.17. LetLbe a linear pencil and F⊆ DL(r).SupposeFis closed under conjugation by unitaries. If for every m∈Nand surjective γ∈Mr,mwithtr(γ∗γ) = 1 the set Fγ={(γ∗γ,γ∗Xγ)|X∈F} is an exposed face of Γm(DL) ={(δ∗δ,δ∗Yδ)|δ∈Mk,monto,tr(δ∗δ) = 1,k∈N,Y∈ DL(k)} ={(δ∗δ,δ∗Yδ)|δ∈Mk,monto,tr(δ∗δ) = 1,k∈N,Y∈Sg n, (Im⊗δ∗)L(Y)(Im⊗δ)/{ollowsequal0} ⊆Mm×Mm, thenFis a matrix exposed face of DL. As it is not clear if weak matrix (exposed) faces are ordinary (expos ed) faces, the observations from this subsection do not directly apply to weak mat rix faces. 5.Multilevel matrix faces 5.1.Matrixmultifaces. Inthissectionwediscuss two notionsofa multicomponent faceof a matrix convex set. We show how the classical theory connecting ( archimedean) faces of compactconvex setsand(archimedean) order idealsofthecorre sponding functionsystems presented in [ Alf71, Section II.5] has its noncommutative counterpart featuring mat rix multifaces. It also gives rise to a family of examples along with a suﬃcien t condition to deduce whether a point is contained in some matrix multiface. A notion similar to that of a matrix multiface recently appeared under the name nc face in [KKM+]. While nc faces extend the concept of absolute extreme points (se e [EHKM18 ]), our interest is in generalizing the properties of matrix extreme po ints. Deﬁnition5.1. LetK= (Kr)r∈Nbeamatrixconvexsetinthespace VandF= (Fr)r∈N⊆ Ka levelwise convex subset of K. (a) Then Fis amatrix multiface if for every tuple of points A1,...,A kfromKand every tuple of surjective matrices γi∈Mni,nsatisfying∑textk i=1γ∗ iγi=In,the condition (5.1)k∑ i=1γ∗ iAiγi∈F, impliesAi∈Ffori= 1,...,k. (b) IfFis a matrix convex matrix multiface, then it is a matrix convex multiface . Remark 5.2. (a) It is straightforward that each component Fnof a matrix (convex) mul- tifaceFis an ordinary face. (b)Forn∈NandF⊆Kndenoteby /hatwideFthesubset of Kwithn-thcomponent Fandthe other components being empty. Then for every matrix face F⊆Kn,the corresponding multicomponent set /hatwideFisamatrixmultiface. Moreover, thematrixmultifaces F= (Fr)r∈N withFr=∅forr >1 coincide with subsets of K, whose ﬁrst components are ordinary faces. Also, /hatwiderK1itself is a matrix multiface and we see as in part (b) of Remark 4.2that\n36 IGOR KLEP AND TEA ˇSTREKELJ /hatwiderKnforn>1 is never a matrix multiface. Moreover, as in part (c) of Remark 4.2, every matrix multiface is closed under unitary conjugation. (c) As in part (c) of Deﬁnition 4.1one might consider weak matrix multifaces to obtain that for any weak matrix multiface F, whereFn={A}for somen∈NandFm=∅ wheneverm/\\e}atio\\slash=n,the pointAis matrix extreme. Example 5.3. We give an example of a matrix face in a matrix convex set, inspired by t he theory connecting (archimedean) faces of compact convex sets and (archimedean) order ideals of the corresponding function systems presented in [ Alf71, Section II.5]. Let Kbe a compact matrix convex set and denote by A(K) ={θ= (θn:Kn→Mn)n∈N|θcontinuous matrix aﬃne } its dual operator system. For a ucp map Φ on A(K) with kernel Jlet (5.2) J⊥ n:={A∈Kn|θn(A) = 0∀θ∈J}. A straightforward calculation shows that J⊥:= (J⊥ n)n∈Nis a matrix convex subset of K. We will show that if Jis spanned by its positive elements, i.e., J=J+−J+,thenJ⊥is a matrix convex multiface. First note that for any r∈N,the ampliation Φ ralso has the kernel generated by its positive elements. Indeed, if Φr(A) = (Φ(Ai,j)) = 0 for someA= (Ai,j)∈Mr(A(K)),then every Ai,jlies inJ=J+−J+.Now the claim follows, since we can write A=∑text i,jEi,j⊗Ai,j,each standard base matrix Ei,jcan be expressed as a (complex) linear combination of positive matrices, an d the elements of the formα⊗θforα∈M+ randθ∈A(K)+lie inMr(A(K))+. Now to prove J⊥is a matrix convex multiface suppose A=k∑ i=1γ∗ iAiγi∈J⊥ n fork-tuples (Ai)k i=1and (γi)k i=1, whereAi∈Kniandγi∈Mni,nare onto with∑textk i=1γ∗ iγi= In.Then for any θ∈J, 0 =θn(A) =k∑ i=1γ∗ iθni(Ai)γi. Ifθis a positive element in A(K),the above implies θni(Ai) = 0 fori= 1,...,kand sinceJis spanned by its positive elements, we have θni(Ai) = 0 for all iandθ∈J.Hence Ai∈J⊥fori= 1,...,kso thatJ⊥is a matrix multiface. ♦ Remark 5.4. (a) By inspection of the observations of Example 5.3, we deduce a suﬃcient condition for a point X∈Kto be contained in a matrix multiface. Identifying Xwith the corresponding evaluation map Φ X∈UCP(A(K)),we see that if every θ∈A(K) with θ(X) = 0canbedecomposedas θ=θ1−θ2,whereθ1,θ2∈A(K)+andθ1(X) =θ2(X) = 0, then (ker Φ X)⊥is a matrix (convex) multiface that contains X. (b) One might try to adapt Example 5.3to obtain a ﬁxed-level matrix face by assuming that for a ucp map ϕonA(K) the corresponding kernel Jis spanned by its positive elements and nmin:= min{n∈N|J⊥ n/\\e}atio\\slash=∅}<∞.\nFACIAL STRUCTURE OF MATRIX CONVEX SETS 37 Then the set J⊥ min:=J⊥ nminsatisﬁes the conditions of a C∗-face. However, if nmin<∞, thennmin= 1 because of the connection ξ∗θn(A)ξ=θ1(ξ∗Aξ) for anyA∈Kn,matrix aﬃne map θ∈A(K) and unit vector ξ∈Cn.So the presented construction only reproduces some of the faces of K1. Deﬁnition 5.5. LetKbe a matrix convex set. A ucp map Φ : A(K)→Mrispartially order reﬂecting if it satisﬁes (5.3) Φ n( Mn(A(K))+) = Φn( Mn(A(K)))+ for alln∈N, i.e., for every n∈NandA∈Mn(A(K)) with Φ n(A)/{ollowsequal0 there exists a B/{ollowsequal0 such that Φ n(A) = Φn(B). The following two propositions together give a noncommutative analo gue of [Alf71, II.5.11 – II.5.13]. Proposition 5.6. LetKbe a compact matrix convex set and Φ :A(K)→Mra ucp map. Denote by Jthe kernel of ΦandJ⊥= (J⊥ m)m∈Nas in(5.2). Then the following are equivalent: (a)The kernel Jis spanned by its positive elements and Φis partially order reﬂecting. (b)For eachn∈Nandθ∈Mn(A(K))withθ|J⊥/{ollowsequal0there is a positive element ψ∈Mn(A(K))+such that ψ/{ollowsequalθandψ|J⊥=θ|J⊥. Proof.(a)⇒(b) By the categorical duality, there is a point X∈Ksuch that Φn(θ) =θ(X) for everyn∈Nandθ∈Mn(A(K)).Moreover, for any θ∈Jwe have θ(X) = Φ(θ) = 0, soX∈J⊥.Now ﬁxn∈Nand letθ∈Mn(A(K)) be such that θ|J⊥/{ollowsequal0.Then Φn(θ) =θ(X)/{ollowsequal0 and by (a) there is a ψ1∈Mn(A(K))+such that Φ n(ψ1) = Φn(θ),i.e., θ−ψ1∈kerΦn. As noted in Example 5.3, the fact that Jis spanned by its positive elements implies kerΦ n is also spanned by its positive elements, meaning kerΦ n= (kerΦ n)+−(kerΦ n)+.Hence there is aψ2∈(kerΦ n)+such thatθ−ψ1/precedesequalψ2.Then ψ=ψ1+ψ2∈Mn(A(K))++(kerΦ n)+⊆Mn(A(K))+ clearly satisﬁes ψ/{ollowsequalθandψ|J⊥=ψ1|J⊥=θ|J⊥. (b)⇒(a) To see that Jis spanned by its positive elements let θ∈J.Thenθ|J⊥= 0 and by (b), there is a ψ∈A(K)+such thatψ/{ollowsequalθandψ|J⊥=θ|J⊥= 0.Hence θ=ψ−(ψ−θ)∈J+−J+. It remains to prove that Φ satisﬁes the partially order reﬂecting pr operty (5.3) for all n∈N. Letq:A(K)→A(K)/Jdenote the canonical projection. It is positive, i.e., order preserving, but also partially order reﬂecting by (b) as we no w explain. For any θ∈A(K) withq(θ)∈( A(K)/J)+there is aψ∈Jsuch thatθ+ψ/{ollowsequal0.Henceθ|J⊥/{ollowsequal0 and by (b), there is a θ0∈A(K)+such thatθ0|J⊥=θ|J⊥.Whence,q(θ) =q(θ0).\n38 IGOR KLEP AND TEA ˇSTREKELJ We continue by showing that (b) implies A(K)/Jis an Archimedean order unit space. For that we shall prove that q(1K) is an Archimedean order unit. So suppose θ∈A(K) satisﬁes q(θ)/precedesequal1 nq(1K) for alln∈N.Then for each nthere is a map ψn∈Jsuch that θ/precedesequal1 n1K+ψn, which implies θ|J⊥/precedesequal1 nfor alln∈N.Henceθ|J⊥/precedesequal0 and by (b), there is a ψ∈A(K)+ such thatψ|J⊥=−θ|J⊥.But thenq(θ) =−q(ψ)/precedesequal0 as desired. Byrepeatingtheaboveargumentwiththe n-thampliation qnofq,weseethat In⊗q(1K) is an Archimedean order unit in Mn(A(K)/J) for every n∈N.In other words, q(1K) is an Archimedean matrix order unit. It is now easy to see that A(K)/Jsatisﬁes the Eﬀros-Ruan axioms of an operator system (see [ Pau02, Chapter 13]). Since (A(K)/J,q(1K)) is an Archimedean order unit space, there is an order isomor- phismτ:A(K)/J→imΦ such that Φ = τ◦q.Hence Φ is partially order reﬂecting. By applying the same reasoning to Mn(A(K)) for arbitrary n∈N,we conclude that Φ nis partially order reﬂecting for all n∈N. /square The next result combines andsummarizes theconclusions fromExam ple5.3andPropo- sition5.6giving the connection between certain closed matrix convex multifac es and pos- itively generated kernels of partially order reﬂecting ucp maps. Proposition 5.7. LetKbe a compact matrix convex set. (a)Letn∈NandΦ :A(K)→Mnbe a partially order reﬂecting ucp map with kernel Jspanned by its positive elements. Then J⊥⊆Kis a closed matrix convex multiface that satisﬁes both of the equivalent conditions o f Proposition 5.6. (b)Suppose F⊆Kis a closed matrix convex multiface that satisﬁes the condit ion (b)of Proposition 5.6(withJ⊥replaced by F). Then J:={θ∈A(K)|θ|F= 0} is spanned by its positive elements and is the kernel of a ucp m apΦ :A(K)→ R that satisﬁes the partially order reﬂecting property (5.3), whereRis an operator system. Proof.Part (a) follows from Example 5.3and Proposition 5.6. For (b) we ﬁrst prove thatJ⊥=F.Clearly,F⊆J⊥.So suppose we have X∈J⊥\\F.AsFis closed, by the matricial Hahn-Banach theorem [ EW97] there is a matrix aﬃne map θ∈A(K) such thatθ|F/{ollowsequal0,butθ(X)/notfollowsoreql0.By assumption there is a positive element ψ∈A(K)+with ψ/{ollowsequalθandψ|F=θ|F.So we have both ψ(X)/{ollowsequal0 andψ−θ∈J.But then by the choice ofX, (ψ−θ)(X) = 0,which is a contradiction. Hence J⊥=F. Nowtheproofofthe(b) ⇒(a)implicationinProposition 5.6showsthatJisspannedby its positive elements, the quotient R:=A(K)/Jis an operator system and the canonical quotient map q:A(K)→ Ris the desired ucp map with the partial order reﬂection property ( 5.3) for alln∈N. /square Remark 5.8. IfKisa matrixconvex set ina ﬁnite-dimensional space V,then theoperator systemRin part (b) of Proposition 5.7is ﬁnite-dimensional and the ucp map Φ is in fact a matrix state on A(K).So in this case part (b) gives a proper converse to part (a).\nFACIAL STRUCTURE OF MATRIX CONVEX SETS 39 Example 5.9. LetK1⊆R2be the triangle with a vertex Xin Figure 2and letKbe the matrix convex hull of K1.It is routine to check that ker Φ Xis spanned by its positive elements, hence by Example 5.3, (ker Φ X)⊥is a matrix convex multiface containing X. Further, Φ Xis partially order reﬂecting as we now explain. Let n∈Nandθ∈ Mn(A(K)) be such that (ΦX)n(θ) =θ(X)/{ollowsequal0. Without loss of generality assume θ(X) is diagonal with diagonal entries λ1,...,λ n≥0. For eachichoose an aﬃne function fi,which is positive on K1,such thatfi(X) =λiand deﬁne ψ=f1⊕···⊕fn. Note that for any matrix aﬃne map ϕ= (ϕn)n∈A(K) and unit vector ξ∈Cn,the property ξ∗ϕn(A)ξ=ϕ1(ξ∗Aξ) impliesϕ1≥0onK1ifandonlyif ϕ∈A(K)+.It isnoweasy tosee that ψ∈Mn(A(K))+ andψ(X) =θ(X).This shows that Φ Xis indeed partially order reﬂecting. After a rotation, the above reasoning applies to any of the three v ertices ofK1,so each of them deﬁnes a partially order reﬂecting evaluation map. Moreove r, a similar argument shows the same for each of the vertices of a simplex Sin an Euclidean space Rn.So each of them lies in a matrix convex multiface of mconv( S) satisfying both of the (equivalent) conditions of Proposition 5.6. ♦ x1x2 X 0 Figure 2. The level-one point Xdetermines a matrix exposed multiface of the matrix convex hull of the above triangle. With similar reasoning as in Proposition 4.4we can prove the following generalization of the extreme point preservation property of classical faces. Proposition 5.10. LetKbe a matrix convex set and F⊆Ka matrix (convex)multiface. Every matrix extreme point of Fis a matrix extreme point of K. Example 5.11. Note that a matrix multiface Fof either type must contain all the matrix extreme points, whose proper matrix convex combinations describ e the elements of F. In particular, the matrix interval [ aI,bI] := ([aIn,bIn])n∈Nhas very few matrix convex multi- faces, i.e., ∅,mconv({a}),mconv({b}) and [aI,bI],and accordingly, its matrix multifaces that are not matrix convex are of the form /hatwideFin the notation from part (b) of Remark 5.2, whereFis a matrix face. More generally, if Kis a matrix convex set and x∈K1is an\n40 IGOR KLEP AND TEA ˇSTREKELJ extreme point, then mconv {x}is a matrix convex multiface of K(see [KKM+, Example 9.9]). ♦ 5.2.Matrix exposed multifaces. This section introduces the exposed counterparts of the multilevel matrix faces and investigates their basic properties. Deﬁnition 5.12. LetK= (Kr)r∈Nbe a matrix convex set in a dual vector space Vand Fa levelwise convex subset of K. (a) Then Fis amatrix exposed multiface if there exists a positive integer r,a contin- uous linear map Φ : V→Mrand a self-adjoint matrix α∈Mrsatisfying the following conditions: (i) for every positive integer nandB∈Knwe have Φ n(B)/precedesequalα⊗In; (ii) for each n∈Nwe have{B∈Kn|α⊗In−Φn(B)/{ollowsequal0 is singular }=Fn. (b)IfFisamatrixconvexmatrixexposedmultiface, thenitisa matrixconvexexposed multiface. We call a pair (Φ ,α) in the notation above an exposing pair (of sizer) for the matrix exposed face F. An exposing pair is minimal if there is no s < rtogether with a linear map Ψ :V→Msand a self-adjoint matrix β∈Mssatisfying (i) Ψm(B)/precedesequalβ⊗Imfor allB∈Kmand positive integers m, (ii){B∈Kn|α⊗In−Φn(B)/{ollowsequal0 is singular }=Fnfor everyn∈N. Remark 5.13. (a) Assume the notation from part (b) of Remark 5.2. Then for every matrix exposed face F⊆Kn,the corresponding multilevel set /hatwideFis a matrix exposed multiface. Moreover, the matrix exposed multifaces F= (Fr)r∈NwithFr=∅forr >1 coincide with subsets of K, whose ﬁrst components are ordinary exposed faces. Also, as in part (b) of Remark 4.6, a matrix exposed multiface is closed under conjugation by unitaries. (b) As in part (c) of Deﬁnition 4.5one might consider weak matrix exposed multifaces to obtain that for any weak matrix exposed multiface F, whereFn={A}for somen∈N andFm=∅wheneverm/\\e}atio\\slash=n,the pointAis matrix exposed. (c) We can show as in part (e) of Remark 4.6that for a matrix exposed multiface Fof any type the intersection Nn=∈tersectiondisplay A∈Fnker(α⊗In−Φn(A)) is nontrivial for any positive integer n. (d) Note that the zero map and the zero matrix deﬁne an exposing p air forK. (e) Suppose LandMare two linear pencils such that DM⊆ DLandDM(n)∩∂DL(n)/\\e}atio\\slash= ∅for somen∈N.IfF=DM∩∂DL= (DM(m)∩∂DL(m))mis levelwise convex, then it is a matrix exposed multiface in DM(cf. Example 4.9). Proposition 5.14. LetF⊆Kbe a matrix (convex)exposed multiface and Φ :V→Mr together with α∈Mra minimal exposing pair. Then for every n∈Nand nonzero x=∑textn i=1xi⊗ei∈Cr⊗CninNn,the span of its components x1,...,x nism-dimensional, wherem= min(r,n). Proof.Supposer≤n(the other case is treated similarly). If the span Mofx1,...,x n is of dimension m < r,then the projection PontoMgives rise to an exposing pair (PΦP∗,PαP∗) of sizem<r.But this contradicts the minimality of (Φ ,α). /square\nFACIAL STRUCTURE OF MATRIX CONVEX SETS 41 Proposition5.15. LetK= (Kn)n∈Nbe a matrix convex set and F⊆Ka matrix (convex) exposed multiface. Then each Fnis an ordinary exposed face of Kn. Proof.LetF⊆Kbe a matrix exposed multiface and Φ : V→Mrtogether with α∈Mr a minimal exposing pair. For ﬁxed n∈N,choose a nonzero xninNnas in Proposition 5.14and deﬁne the functional ϕ:Mn(V)→Cby ϕn(B) =x∗ nΦn(B)xn, and the real number an=x∗ n(α⊗In)xn.Now conclude as in the proof of Proposition 4.8 that the pair ( ϕn,an) exposesFninKn. /square 5.2.1.Interplay between matrix multifaces and matrix exposed mul tifaces.Asanextension ofSubsection 4.3, here we give a few remarks on theconnection between matrixmultif aces and matrix exposed multifaces. Proposition 5.16. LetKbe a matrix convex set and F⊂noteqlKa matrix exposed multiface with minimal exposing pair of size r.Denote by /tildewideFthe graded set with /tildewideFk=Fkfork≤r and/tildewideFk=∅fork>r.Then/tildewideFis a matrix multiface. Proof.The proof is essentially same as that of Proposition 4.11, where the counterparts of the two key observations needed, namely part (b) of Remark 4.10and Proposition 4.7, are covered by the deﬁnition of a matrix multiface and by Proposition 5.14, respectively. /square Remark 5.17. Note that if Fis a matrix convex multiface and for some n∈N,Fnis aC∗-exposed face, then Fn=Kn.Indeed, ifFnis aC∗-exposed face, which is a proper subset ofKn,then it must not contain any reducible elements by part (b) of Remar k4.2. But since Fis matrix convex, ⊕nF1⊆Fnfor alln∈N.SoFncan only be exposed by a map that is constant on the whole Kn, whenceFn=Kn. Proposition 5.18. LetKbe a compact matrix convex set. Suppose F⊆Kis a closed matrix convex multiface such that for each n∈Nandθ∈Mn(A(K))withθ|F/{ollowsequal0there is a positive element ψ∈Mn(A(K))+with ψ/{ollowsequalθandψ|F=θ|F. Then for each n∈N, Fnis an exposed face of Kn. Proof.Fixn∈Nand without loss of generality suppose Fn⊂noteqlKn.We ﬁrst show that for everyX∈Kn\\Fnthere is a continuous aﬃne function ϕX:Mn(V)→Csuch that ϕX|Fn= 0 and ϕX(X)>0. Indeed, since Fis closed, by the matricial Hahn-Banach separation theorem [ EW97], there is a matrix aﬃne map θ∈A(K) withθ1:V→Cthat satisﬁes θ|F/{ollowsequal0 andθ(X)/notfollowsoreql0. Hence there is a y∈Cnsuch thaty∗θ(X)y <0.By assumption, there is a ψ∈A(K)+ withψ−θ∈A(K)+andψ|F=θ|F.Butthelattermeanswecantake ϕXtobey∗(ψ−θ)y. SinceKnis compact, there exist ﬁnitely many X1,...,X k∈Kn\\Fnsuch that for each X∈Kn\\Fnthere is an 1 ≤i≤ksuch that ϕXi|Fn= 0 and ϕXi(X)>0. It is then straightforward that ϕ=1 k(ϕX1+···+ϕXk) exposesFninKn. /square\n42 IGOR KLEP AND TEA ˇSTREKELJ References [Alf71] E. M. Alfsen, Compact convex sets and boundary integrals , 2nd edition, Ergebnisse der Mathe- matik und ihrer Grenzgebiete 57, Springer-Verlag, New York, 1971 . [AS01] E. M. Alfsen, F. W. Shultz, State Spaces of Operator Algebras: Basic Theory, Orientati ons, and C*-products , Mathematics: Theory & Applications, Birkh ¨auser, Boston, 2001. [Arv69] W. B. Arveson, Subalgebras of C∗-algebras , I, Acta Math. 123 (1969) 141–224. [Bar02] A. Barvinok, A course in convexity , 2nd edition, Grad. Stud. Math. 54, American Mathematical Society, New York, 2002. [BCR98] J. Bochnak, M. Coste, M. -F. Roy, Real algebraic geometry , 3rd edition, Ergeb. Math. Gren- zgeb. 36, Springer, 1998. [DDOSS17] K. R. Davidson, A. Dor-On, O. M. Shalit, B. Solel, Dilations, inclusions of matrix convex sets, and completely positive maps , Int. Math. Res. Not. IMRN (2017) 4069–4130. [DK+] K. R. Davidson, M. Kennedy: Noncommutative Choquet theory , preprint arXiv:1905.08436 . [Dou66] R. Douglas, On majorization, factorization and range inclusion of oper ators on Hilbert space , Proc. Amer. Math. Soc. 17 (1966) 413–415. [EW97] E. G. Eﬀros, S. Winkler, Matrix convexity: Operator analogues of the bipolar and Hah n- Banach theorems , J. Funct. Anal. 144 (1997) 117–152. [EH19] E. Evert, J. W. Helton, Arveson extreme points span free spectrahedra , Math. Ann. 375 (2019) 629–653. [EHKM18] E. Evert, J. W. Helton, I. Klep and S. McCullough, Extreme points of matrix convex sets, free spectrahedra and dilation theory , J. Geom. Anal. 28 (2018) 1373–1408. [Far04] D. Farenick, Pure matrix states on operator systems , Linear Algebra Appl. 393 (2004) 149–173. [FHL18] A. H. Fuller, M. Hartz, M. Lupini, Boundary representations of operator spaces, and compact rectangular matrix convex sets , J. Operator Theory 79 (2018), 139–172. [FM97] D. Farenick, P. Morenz, C∗-extreme points in the generalised state spaces of a C∗-algebra, Trans. Amer. Math. Soc. 349 (1997) 1725–1748. [FNT17] T. Fritz, T. Netzer, A. Thom, Spectrahedral containment and operator systems with ﬁnite - dimensional realization , SIAM J. Appl. Algebra Geometry 1 (2017) 556–574. [HKM12] J.W. Helton, I. Klep, S. McCullough, The convex Positivstellensatz in a free algebra , Adv. Math. 231 (2012) 516–534. [HKM13] J.W. Helton, I. Klep, S. McCullough, The matricial relaxation of a linear matrix inequality , Math. Program. 138 (2013) 401–445. [HKM16] J.W. Helton, I. Klep, S. McCullough, Matrix Convex Hulls of Free Semialgebraic Sets , Trans. Amer. Math. Soc. 368 (2016) 3105–3139 [HL21] M. Hartz, M. Lupini, Dilation theory in ﬁnite dimensions and matrix convexity , Isr. J. Math. 245 (2021) 39–73. [HM12] J.W. Helton, S. McCullough, Every convex free basic semi-algebraic set has an LMI repres enta- tion, Ann. of Math. (2) 176 (2012) 979–1013. [HV07] J.W. Helton, V. Vinnikov, Linear matrix inequality representation of sets , Commun. Pure Appl. Math. 60 (2007) 654–674. [Hod93] W. Hodges, Model theory , Encyclopedia of Mathematics and its Applications 42, Cambridge University Press, Cambridge, 1993. [KKM+] M. Kennedy, S. -J. Kim, N. Manor, Nonunital operator systems and noncommutative convexity , preprintarXiv:2101.02622 . [Kle58] V. L. Klee, Extremal structure of convex sets II , Math. Z. 69 (1958) 90–104. [Kri19] T. L. Kriel, An introduction to matrix convex sets and free spectrahedra , Complex Anal. Oper. Theory 13 (2019), 3251–3335. [Mag16] B. Magajna, C*-convex sets and completely positive maps , Integral Equ. Oper. Theory 85 (2016) 37–62. [NT13] T. Netzer, A. Thom, Real closed separation theorems and applications to group a lgebras, Pac. J. Math. 263 (2013) 435–452. [NPS10] T. Netzer, D. Plaumann, M. Schweighofer, Exposed faces of semideﬁnitely representable sets , SIAM J. Optim. 20(4) (2010), 1944–1955. [PSS18] B. Passer, O. M. Shalit, B. Solel, Minimal and maximal matrix convex sets , J. Funct. Anal. 274 (2018) 3197–3253.\nFACIAL STRUCTURE OF MATRIX CONVEX SETS 43 [Pau02] V. I. Paulsen, Completely bounded maps and operator algebras , Cambridge Stud. Adv. Math. 78, Cambridge University Press, Cambridge, 2002. [RG95] M. Ramana, A.–J. Goldman, Some geometric results in semideﬁnite programming , J. Glob. Op- tim. 7 (1995) 33–50. [Rob91] R. O. Robson, Separating points from closed convex sets over ordered ﬁeld s and a metric for ˜Rn, Trans. Amer. Math. Soc. 326 (1991) 89–99. [SMR10] G. Stengle, J.McEnerney, R. O.Robson, Convex polarities over ordered ﬁelds , J. PureAppl. Al- gebra 214 (2010) 370–379. [WW99] C. Webster, S. Winkler, The Krein-Milman theorem in operator convexity , Trans. Amer. Math. Soc. 351 (1999) 307–322. [Wit84] G. Wittstock, On matrix order and convexity , Functional Analysis: Surveys and Recent Results III, North-Holland Mathematics Studies, North-Holland 90 (1984) 175–188. Igor Klep: Faculty of Mathematics and Physics, Department o f Mathematics, Univer- sity of Ljubljana, Slovenia Email address :igor.klep@fmf.uni-lj.si TeaˇStrekelj: Institute of Mathematics, Physics and Mechanics , Ljubljana, Slovenia Email address :tea.strekelj@fmf.uni-lj.si\n",
  "metadata": {
    "paper_id": "2108.01611v4",
    "downloaded_at": "2025-08-24T22:19:34.042477+00:00"
  },
  "processed_at": "2025-08-24T22:19:34.042490+00:00"
}