{
  "content": "arXiv:cond-mat/0312602v1 [cond-mat.supr-con] 23 Dec 2003Josephson and spontaneous currents at the interface betwee n twod-wave superconductors with transport current in the banks Yu.A. Kolesnichenko, A.N. Omelyanchouk, S. N. Shevchenko B.I. Verkin Institute for Low Temperature Physics and Engin eering, National Academy of Sciences of Ukraine, 47 Lenin Ave., 61103, Kharko v, Ukraine Astationary Josephson eﬀectin the ballistic contact of two d-wave superconductors with diﬀerent axes orientation and with tangential transport current in the banks is considere d theoretically. We study the inﬂuence of the transport curre nt on the current-phase dependence for the Josephson and tan- gential currents at the interface. It is demonstrated that t he spontaneous surface current at the interface depends on the transport current in the banks due to the interference of the angle-dependent current-carrying condensate wave functi ons of the two superconductors. I. INTRODUCTION It was shown that in the ground state of the con- tact of two d-wave superconductors with diﬀerent axes orientation there is the tangential to the boundary cur- rent [1]- [8]. In the particularly interesting case of π/4- misorientation the ground state is two-fold degenerate: there are the tangential currents in opposite directions atφ=±π/2 in the absence of Josephson current. The probabilities to ﬁnd the contact in one of the two states are equal and the corresponding tangential current is re- ferred to as the spontaneous one. It was proposed to use such two-state quantum systems for the quantum com- putation [9]- [11]. It is of interest to study the possibility to control this system by the external transport current, which is the motivation of the present work. In the described problem of the Josephson contact of twod-wavesuperconductorswithtransportcurrentinthe banks the resulting tangential current is not a sum of the spontaneous current and the transport one. In the paper [12] we have studied simpler case of the contact of two s-wave superconductors with the transport current ﬂow- ing in the banks. It was shown that the presence of the magnetic ﬁeld [13]- [16], of the transport superconduct- ing current [12], or of the current in normal layer [17]- [18] in a mesoscopic Josephson junction can signiﬁcantly inﬂuence current-phase characteristics, current distribu- tion etc. In the present problem the Josephson current is de- ﬁned by the interference of the angle-dependent conden- sate wave functions of the two superconductors. There are two factors of anisotropy which deﬁne the angle de- pendence of the order parameter: the pairing anisotropyand the transport current. Thus, it is natural to expect that the resulting interference current (which has both normal and tangential components) is parametrized by the external phase diﬀerence φand by the value of the transport current (or by the superﬂuid velocity vs). The presence of these two controlling parameters can be use- ful in the applications of Josephson junctions of high-T c superconductors. In Sec.2 we derive basic equations to describe the bal- listic planar Josephson junction of two diﬀerently orien- tatedd-wave superconductors with homogeneous current in the banks. These equations are solved analytically in Sec.3. Then we study in Sec.4 the inﬂuence of the trans- port current on the Josephson current and vice versa at the interface. In Appendix the order parameter and the current density in the homogeneous situation are consid- ered. II. MODEL AND BASIC EQUATIONS We consider a model of the Josephson junction as an ideal plane between two singlet (particularly, d-wave) su- perconductors with diﬀerent axes orientation (see Fig.1). FIG. 1. Geometry of the contact of two superconductors withdiﬀerentaxesorientationanddiﬀerenttransportcurr ents (superﬂuid velocities vs;L,R) in the banks. The pair breakingand the scattering at the junction as well as the electron scattering in the bulk of metals are ignored. We did not take into account the possibility of the generation of a subdominant order parameter, which results in decreasing of the amplitude of the current [7]. 1\nThec-axis of both superconductors is parallel to the in- terface. The direction of c-axis is chosen as z-axis. The aandbaxes are situated in xy-plane. In the banks of the contact homogeneous current ﬂows with a supercon- ducting velocity vs. We considersuperﬂuid velocity vsin left (L) and right (R) superconducting half-spaces being parallel to each other vsL/bardblvsRand to the boundary; we choosey-axis along vsandx-axis perpendicular to the boundary; x= 0 is the boundary plane. Wedescribethecoherentcurrentstateinthesupercon- ducting ballistic structure in the quasiclassical approxi- mation by the Eilenberger equation [19], [20] vF∂ ∂r/hatwideG+/bracketleftBig /tildewideω/hatwideτ3+/hatwide∆,/hatwideG/bracketrightBig = 0, (1) where/tildewideω=ωn+ipFvs,ωn=πT(2n+ 1) are the Mat- subara frequencies, /hatwideG=/hatwideGω(vF,r) =(g g f f+−g)g is the energy integrated Green function, /hatwide∆ =(g0 ∆ ∆∗0)g . The equation (1) should be supplemented by the equation for the order parameter (the self-consistency equation): ∆(vF,r) =πN0T∑ ω/angbracketleftV(vF,v′ F)f(v′ F,r)/angbracketrightv′ F,(2) N0is the density of states at the Fermi level and /angbracketleft.../angbracketrightvF is the averaging over directions of vF;V(vF,v′ F) is a pairing attractive potential. For the bulk d-wave super- conductor it is usually assumed ∆( ϑ) = ∆0(T,vs)cos2ϑ, V(vF,v′ F) =Vdcos2ϑcos2ϑ′, where angle ϑdeﬁnes a direction of the velocity vF. Solutions of Eqs. (1)-(2) must satisfy the conditions for the Green functions and gap function in the banks far from the interface: g(∓∞) =ωL,R ΩL,R, (3) f(∓∞) =∆(∓∞) ΩL,R, (4) ∆(∓∞) = ∆L,Rexp(±iφ/2). (5) HereωL,R=ωn+ipFvs;L,R,ΩL,R=/radicalBig ω2 L,R+∆2 L,R;φis the phase diﬀerence between the left and right supercon- ductors, which parametrizes the Josephson current state. The angles χL,Rdeﬁne the orientation of the crystal axes aandbin left and right half-spaces (see Fig.1). The an- glebetweentheaxesofthe rightandleft superconductors (the misorientation angle) is δχ=χR−χL. Provided we know the Green function /hatwideG, we can cal- culate the current density: j(r) =−2πieN0T∑ ω/angbracketleftvFg(vF,r)/angbracketrightvF.(6) For singlet superconductors it is usually assumed ∆(−vF) = ∆(vF) and therefore we have:f+(ω,−vF) =f+(−ω,vF) =f∗(ω,vF),(7) g(ω,−vF) =−g(−ω,vF) =g∗(ω,vF).(8) Making use of Eq. (8), Eq. (6) can be rewritten: j(r) =−j0T Tc∑ ω>0/angbracketleft/hatwidevFImg(r)/angbracketrightvF, j0= 4π|e|N(0)vFTc. (9) III. ANALYTICAL SOLUTION OF EILENBERGER EQUATION In this paper we consider the problem non-self- consistently: we assume the superconducting velocity vs being homogeneous and the order parameter ∆ being constant in the two half-spaces: vs(r) =/braceleftbiggvs;L, x <0 vs;R, x >0, (10) ∆(r) =/braceleftbigg∆Lexp(iφ/2), x <0 ∆Rexp(−iφ/2), x >0. As it was shown in the papers [7], the self-consistent consideration of Josephson junction of d-wave supercon- ductors does not qualitatively diﬀer from the non-self- consistent one. In the paper [7] the authors compare nu- merically the self-consistent solution with the non-self- consistent one. The self-consistency of the solution al- lows to take into account the suppression of the order parameter at the interface; the major eﬀect of this is the reduction of the current [7]. Eq. (1) together with Eqs. (3-5, 10) yields for the left and right superconductors: gL,R(x) =ωL,R ΩL,R+CL,Rexp(g −2|x| |vx|ΩL,R)g ,(11) fL,R(x) =∆L,R ΩL,Re−sign(x)iφ/2− (12) −CL,Rsign(x)ηΩL,R+ωL,R ∆L,R× ×exp(g −2|x| |vx|ΩL,R)g e−sign(x)iφ/2, whereη= sign(vx). Making use of the continuity con- dition, we obtain the expression for g-function at the in- terface: g(0) =ΩLωR+ΩRωL−iη∆L∆Rsinφ ΩLΩR+ωLωR+∆L∆Rcosφ.(13) Eqs. (9) and (13) allow us to calculate Josephson cur- rentjJ=jx(x= 0) and the tangential current jy(x= 0) 2\nat the interface. We underline that these equations are valid to describe the current at the interface of two sin- glet superconductors with diﬀerent axes orientation and with diﬀerent transport currents in the banks. The con- tact of conventional superconductors was considered in [12] and in the present paper we study the contact of d-wave superconductors, for which the order parameter is ∆L,R(ϑ) = ∆ 0(T,vs;L,R)cos2(ϑ−χL,R). The pre- sented here consideration can be also used to consider the contact of g-wave superconductors or s-wave/d-wave contact, etc. As we restrict ourselves to the non-self-consistent model we should calculate the order parameter ∆ 0= ∆0(T,vs) in the bulk d-wave superconductor. That is the subject of the Appendix. In the particular case considered below in detail we havevs;L=vs;R=vsand denote /tildewideω=ωn+ipFvs, ΩL,R=/radicalBig /tildewideω2+∆2 L,R; in this case we obtain g(0) =/tildewideω(ΩL+ΩR)−iη∆L∆Rsinφ ΩLΩR+/tildewideω2+∆L∆Rcosφ.(14) In the absence of the transport current ( vs= 0) in this expression: /tildewideω=ωn[7]. We should also clarify the sign of the square root in ΩL,R. To make the solution (11) convergent, we should require ReΩ L,R>0,which ﬁxes the sign of the square root in Ω L,Rto be sign( ω·pFvs;L,R). Moreover, this requirement, as it can be shown, provides the supple- mentary condition on Re g: sign(Re g) = sign( ω). IV. INFLUENCE OF THE TRANSPORT CURRENT ON THE JOSEPHSON AND SPONTANEOUS CURRENTS AT THE INTERFACE FurtherwestudytheJosephsoncontactforthe deﬁnite case:vsL=vsR=vsandχL= 0 and χR=π/4. Forsmallvaluesof vs(in thelinearin pFvs/Tcapproxi- mation) we can state the following approximate relations (which are valid for the values of φin the vicinity of ±π/2): jJ(−vs,φ)≃jJ(vs,φ), jy(−vs,φ)≃ −jy(vs,−φ), and for diﬀerence δj≡j(vs)−j(vs= 0) : δjJ(−φ)≃ −δjJ(φ), δjy(−φ)≃δjy(φ), while at vs= 0 jJ(−φ) =−jJ(φ), jy(−φ) =−jy(φ). In the linear approximation the shift current δjyis an even function of φin contrast to jy(vs= 0). For the spontaneous current (at φ=±π/2) the shift currents δjyare equal:jy(φ=±π/2) =jS+δjy, (15) jS(−π/2) =−jS(π/2), δjy(−π/2) =δjy(π/2). In nonlinear consideration these shift currents are diﬀer- ent for the two cases and it is discussed below. At Figs. 2-3 we plot the normal (Josephson) and tan- gential components of the current densities at the inter- face plane as functions of the phase diﬀerence φat low temperature. /s48/s46/s48 /s48/s46/s50 /s48/s46/s52 /s48/s46/s54 /s48/s46/s56 /s49/s46/s48/s45/s48/s46/s48/s52/s45/s48/s46/s48/s50/s48/s46/s48/s48/s48/s46/s48/s50/s48/s46/s48/s52/s106 /s74/s32/s47/s32 /s106 /s48 /s47/s50/s32/s118 /s115/s61/s48 /s32/s112 /s70 /s118 /s115/s47 /s48 /s48 /s61/s48/s46/s50 /s32/s112 /s70 /s118 /s115/s47 /s48 /s48 /s61/s48/s46/s52 FIG. 2. Josephson current density through the interface jJversus phase φ(χL= 0, χR=π/4, T= 0.1Tc); ∆00= ∆0(T= 0,vs= 0) = 2 .14Tc. /s48/s46/s48 /s48/s46/s50 /s48/s46/s52 /s48/s46/s54 /s48/s46/s56 /s49/s46/s48/s45/s48/s46/s48/s54/s45/s48/s46/s48/s52/s45/s48/s46/s48/s50/s48/s46/s48/s48/s48/s46/s48/s50/s48/s46/s48/s52/s106 /s121 /s32/s47/s32 /s106 /s48 /s47/s50/s32/s118 /s115/s61/s48 /s32/s112 /s70 /s118 /s115/s47 /s48 /s48 /s61/s48/s46/s50 /s32/s112 /s70 /s118 /s115/s47 /s48 /s48 /s61/s48/s46/s52 FIG. 3. Tangential current density at the interface jyver- sus phase φ(χL= 0, χR=π/4, T= 0.1Tc). In the absence of the transport current: (i) jis an odd function of φ; (ii) the normal component of the current (Josephson current) is π-periodic; (iii) in the equilibrium state atφ=±π/2:jJ= 0, jy(±π/2) =jS=∓|jS|. In thelattercasethetangentialcurrentexistsintheabsence of the Josephson current; for that reason it is referred to as the spontaneous current. The presence of the trans- port current breaks (i)-(iii) symmetry relations. There is non-zero Josephson current at φ= 0,π. How the trans- port current inﬂuences the spontaneous current (i.e. the 3\ntangential current at φ=π/2 andφ=−π/2) is shown at Fig. 4. /s48/s46/s48 /s48/s46/s50 /s48/s46/s52 /s48/s46/s54 /s48/s46/s56/s45/s48/s46/s49/s48/s45/s48/s46/s48/s53/s48/s46/s48/s48/s48/s46/s48/s53/s48/s46/s49/s48/s106 /s121/s32/s47/s32/s106 /s48 /s112 /s70/s118 /s115/s47 /s48/s48/s32/s106 /s121 /s40 /s61 /s47/s50/s41 /s32/s106 /s121 /s40 /s61/s45 /s47/s50/s41 FIG. 4. Tangential current density at the interface jyfor the two values of phase diﬀerence (spontaneous current) ver - sus superﬂuid velocity vs(χL= 0, χR=π/4, T= 0.1Tc). The shift of the two values of the current for small values of vs(in the linear in pFvs/Tcapproximation) is equal (see Eq. (15)); however at values vs∼0.2∆00/pF the shift current (i.e. the diﬀerence jy(vs)−jS(vs= 0)) is of diﬀerent signs for the two currents and of opposite tojSdirections. We also note the following relations for vs¬ationslash= 0: (1)jJ(φ=π) =−jJ(φ= 0)¬ationslash= 0 (the presence of the transport current induces non-zero Josephson cur- rent in the absence of an external phase diﬀerence); (2) jJ( φ=±π 2) = 0,djJ dφ( φ=±π 2) >0 (the transport cur- rent does not change the values of equilibrium phase dif- ference, at φ=±π/2); (3)jy(φ=π) =jy(φ= 0)¬ationslash= 0. The latter relation concerns the interesting phenomena, studied in [12]: for some values of phase diﬀerence (here in the vicinity of φ= 0,π) the interference of the angle- dependent condensate wave functions results in the ap- pearance of the additional tangential current with the direction opposite to the transport current in the banks. We underline that the resulting tangential current is not a sum of the spontaneous current and the transport cur- rent [12]. Thus, the transport current drastically inﬂu- ences both the tangential (spontaneous) and Josephson currents. We can write down explicitly simple expression for the current for temperatures close to the critical (so close that ∆ 0,pFvs≪Tc). From Eq. (14) we have: Img(0)≃∆L∆R[−η1 2ω2nsinφ+pFvs ω3ncosφ+ (16) +η3 2(pFvs)2 ω4nsinφ+η∆L∆R 8ω4nsin2φ]. AtχL= 0 and χR=π/4 this results in the following:j=jJ+jS+/tildewidej, (17) jJ=−1 3024πj0∆04 T4csin2φ·ex, (18) jS=−1 60πj0∆02 T2csinφ·ey, (19) /tildewidej=3 560πj0∆02 T2c(pFvs)2 T2csinφ·ey. (20) Here ∆ 0= ∆0(T,vs) and is deﬁned by Eq. (25). In particular, at vs= 0 this gives: jJ=−1.7·10−2j0(g 1−T Tc)g2 sin2φ, (21) jS=−6.6·10−2j0(g 1−T Tc)g sinφ. (22) We note that /tildewidej=−9 28(pFvs)2 T2cjS. It follows that the eﬀect of transport current on ”spontaneous” tangential current at T∼Tcis to reduce its value by a small shift. It is remarkable that the tangential to the boundary cur- rent contains only corrections of the second order on the parameter pFvs/Tc1. IfχL= 0 and χR=δχ¬ationslash=π/4, the integration of the second term in Eq. (16) would give us the factor πcos2δχ−π 2, which is zero for δχ=π 4; this term atδχ= 0 andφ= 0 gives the homogeneous current density (Eq. (26)). The integration of the ﬁrst term in Eq. (16) gives us the factor cos2 δχforx-component of the current and sin2δχfory-component. In the case of δχ=π/4 this term gives only the tangential component. As the conse- quencejS≫jJ(see Eqs. (21)-(22)). It wasdiscussedabovethatthe linearin pFvs/Tcterms result in the uniform shift of jS. We can see that nonlin- ear terms result in the shift of diﬀerent sign, and in both cases of opposite to jSdirection (see Eq. (20)). This in part explains the nonmonotonic behavior of jy(see Fig. 4). The fact, that the presence of the transport current signiﬁcantly changes the tangential (spontaneous) cur- rents, can be proposed to be used for its control, which is important in view of their possible application for quan- tum computation [9]- [11]. V. CONCLUSION The inﬂuence of the transport current, which ﬂows in the banks, on the stationary Josephson eﬀect in the con- tact of two d-wave superconductors is studied. We have 1There is also a term with the factorpFvs Tc∆4 0 T4c, which is ne- glected here. This term results in the equal shifts of jSfor φ=±π/2. 4\nderived the equations, which allow general consideration of the contact of two singlet superconductors with dif- ferent axes orientation and with diﬀerent transport cur- rents in the banks. Particularly, we have studied the pla- nar contact of two d-wave superconductors in the case of π/4-misorientation with equal transport currents in the banks. It was demonstrated that the current-phase rela- tion drastically depends upon the value of the transport current. The ground state degeneracy in the absence of transport current (at φ=±π/2) is removed at vs¬ationslash= 0. The dependence of the shift current (which is the diﬀer- ence of the tangential current and the spontaneous one) onvsis shown to be non-linear. It is proposed to use the transport current for the control of qubits based on the contact of two d-wave superconductors. We acknowledgesupport fromD-WaveSys. Inc. (Van- couver). Results of the present study were reported at Interna- tional Conferences: ”Applied Electrodynamicsof high- Tc Superconductors”, IRE, Kharkov, Ukraine (May 2003) and ”Josephson junctions: Basic Studies and Novel Ap- plications”, Jena, Germany (June 2003). VI. APPENDIX. ORDER PARAMETER IN THE HOMOGENEOUS CURRENT STATE In this section we study the homogeneouscurrent state in the bulk d-wave superconductor (see also in [21]). We note, that the order parameter ∆ 0is the function of tem- perature T, superﬂuid velocity vs, and the angle χbe- tween the crystallographic axis aand the direction of superﬂuid velocity vs. For that we should solve Eqs.(2) and (9) with gandfgiven by Eqs. (3) and (4): 1 λ= 2T∑ ω>0π/2∫display −π/2dϑRe∆2(ϑ)/∆2 0 Ω, j j0=−T πTc∑ ω>0π/2∫display −π/2dϑ/hatwidevFIm/tildewideω Ω. Hereλ=N0Vd,/tildewideω=ωn+ipFvs, Ω =√ /tildewideω2+∆2, ∆(ϑ) = ∆0(T,vs)cos2(ϑ−χ). ForT= 0 (substituting πT∑text ωby the integral∫text dω) we obtain the equations for the order parameter ∆ 0and the current density j: ln(g∆00 ∆0)g =2 π∫display dϑ(g∆(ϑ) ∆0)g2 ln /vextendsingle/vextendsingle/vextendsingle/vextendsinglevspF ∆(ϑ)/vextendsingle/vextendsingle/vextendsingle/vextendsingle+/radicalBigg(gvspF ∆(ϑ))g2 −1  (23) here ∆ 00= ∆0(T= 0,vs= 0) =ξωce−2/λ,ξ= 4e−1/2,j j0=−1 4πvspF Tc+ (24) +1 2π2∫display dϑ|cosϑ|/radicalBigg(gvspF Tc)g2 −(g∆(ϑ) Tc)g2 . In Eqs. (23) and (24) the integration is performed in the region where ∆( ϑ)2<(vspF)2forϑ∈(−π 2,π 2). At Figs.5-6 we plot the order parameter ∆ 0(T,vs) and the current density versus superﬂuid velocity vsfor dif- ferent angles χat low temperature. For comparison we also plot the curves for the s-wave superconductor. /s48/s46/s48 /s48/s46/s50 /s48/s46/s52 /s48/s46/s54 /s48/s46/s56 /s49/s46/s48 /s49/s46/s50 /s49/s46/s52/s48/s46/s48/s48/s46/s50/s48/s46/s52/s48/s46/s54/s48/s46/s56/s49/s46/s48/s48/s47 /s48/s48 /s112 /s70/s118 /s115/s47 /s48/s48/s32 /s61/s48 /s32 /s61 /s47/s49/s50 /s32 /s61 /s47/s54 /s32 /s61 /s47/s52 /s32/s115/s45/s119 /s97/s118/s101 FIG. 5. Order parameter ∆ 0(T,vs) in the bulk d-wave su- perconductor vs. superﬂuid velocity vsfor diﬀerent angles χ between vsanda-axis (T= 0). /s48/s46/s48 /s48/s46/s50 /s48/s46/s52 /s48/s46/s54 /s48/s46/s56 /s49/s46/s48 /s49/s46/s50 /s49/s46/s52/s48/s46/s48/s48/s48/s46/s48/s50/s48/s46/s48/s52/s48/s46/s48/s54/s48/s46/s48/s56/s48/s46/s49/s48/s106/s32/s47/s32 /s106 /s48 /s112 /s70/s118 /s115/s47 /s48/s48/s32 /s61/s48 /s32 /s61 /s47/s49/s50 /s32 /s61 /s47/s54 /s32 /s61 /s47/s52 /s32/s115/s45/s119 /s97/s118/s101 FIG. 6. Current density in the bulk d-wave superconductor vs. superﬂuid velocity vsfor diﬀerent angles χ(T= 0). The numerical analysis at low temperature shows that in spite of the strong anisotropy of the pairing potential, the order parameter ∆ 0, the critical velocity vcr sand the critical current jcdepend weakly on the angle χbetween vsand crystallographic a-axis (see Figs. 5-6 and in Ref. [21]). Namely, the respective diﬀerence is maximal for χ= 0 and χ=π/4 and does not exceed 0.1. For small 5\nvalues of superﬂuid velocity, i.e. in the linear approxi- mation on the parameter vspF/Tc, both ∆ 0andjdo not depend on χ. For a temperature close to Tc=βωce−2/λ= 0.47∆00, whereβ=2 πeC(Cis the Euler constant), both the gap function ∆ 0and current density j, do not depend upon angleχ: ∆2 0=32π3 21ζ(3)T2 c(g 1−T Tc)g −4 3(pFvs)2,(25) j j0=−7ζ(3) 32π3∆2 0 T2cpFvs Tc. (26) The temperature dependence of critical velocity vcr sfol- lows from Eq. (25):pFvcr s Tc=/radicalBig 8π2 7ς(3)/radicalBig 1−T Tc. [1] S. Yip, Phys. Rev. B 52, 3087 (1995). [2] M. Matsumoto and H. Shiba, J. Phys. Soc. Jpn. 65, 2194 (1996). [3] A. Huck, A. van Otterlo, and M. Sigrist, Phys. Rev. B 56, 14163 (1997). [4] M. Sigrist, Prog. Theor. Phys. 99, 899 (1998). [5] T. L¨ ofwander, V.S. Shumeiko, and G. Wendin, Phys. Rev. B62, R14653 (2000). [6] S. Kashiwaya and Y. Tanaka, Rep. Prog. Phys. 63, 1641 (2000). [7] M.H.S. Amin, A.N. Omelyanchouk, and A.M. Zagoskin, Phys. Rev. B 63, 212502 (2001); M.H.S. Amin, A.N. Omelyanchouk, S.N. Rashkeev, M. Coury, and A.M. Zagoskin, Physica B 318, 162 (2002). [8] E. Il’ichev et al., Phys. Rev. Lett. 86, 5369 (2001). [9] L.B. Ioﬀe et al., Nature 398, 679 (1999). [10] A. Blais and A.M. Zagoskin, Phys. Rev. A 61, 042308 (2000); A.M. Zagoskin, J. Phys.: Condens. Matter 9, L419 (1997). [11] M.H.S. Amin, A.Yu. Smirnov, and A.M. Zagoskin, et al., arXiv:cond-mat/0310224 (2003). [12] Yu.A. Kolesnichenko, A.N. Omelyanchouk, and S.N. Shevchenko, Phys. Rev. B 67, 172504 (2003). [13] J.P. Heida, B.J. van Wees, T.M. Klapwijk, and G. Borghs, Phys. Rev. B 57, R5618 (1998). [14] V. Barzykin and A.M. Zagoskin, Superlatt. and Mi- crostr.,25, 797 (1999). [15] Urs Lederman, Alban L. Fauchere, and Gianni Blatter, Phys. Rev. B 59, R9027 (1999). [16] M.H.S. Amin, A.N. Omelyanchouk, and A.M. Zagoskin, Low Temp. Phys. 27, 616 (2001). [17] A. Morpurgo, B.J. van Wees, and T.M. Klapwijk, Appl. Phys. Lett. 72, 966 (1998). [18] F.K. Wilhelm, G. Sh¨ on, and A.D. Zaikin, Phys. Rev. Lett.81, 1682 (1998).[19] G. Eilenberger, Z. Phys., 214, 195 (1968). [20] I.O. Kulik and A.N. Omelyanchouk, Fiz. Nizk. Temp., 4, 296 (1978) (Sov. J. Low Temp. Phys., 4, 142 (1978)). [21] J. Ferrer, M.A. Gonzalez-Alvarez, J. Sanchez-Canizar es, Superlatt. and Microstr., 25, 1125 (1999). 6\n",
  "metadata": {
    "paper_id": "cond-mat/0312602v1",
    "downloaded_at": "2025-08-24T23:21:45.092504+00:00"
  },
  "processed_at": "2025-08-24T23:21:45.092519+00:00"
}