{
  "content": "arXiv:gr-qc/0311077v1 24 Nov 2003Perfect Fluid Spacetimes With Two Symmetries A. Szereszewski and J. Tafel Institute of Theoretical Physics, University of Warsaw, Ho˙ za 69 , 00-681 War- saw, Poland, email: tafel@fuw.edu.pl Abstract . A method of solving perfect ﬂuid Einstein equations with two commutin g spacelike Killingvectorsispresented. Givenaspacelike2-dimensional surface in the 3-dimensional nonphysical Minkowski space the ﬁeld equation s reduce to a single nonlinear diﬀerential equation. An example is discussed. PACS number: 04.40.Nr Keywords: Einstein equations, symmetries, surfaces 1 Introduction Spacetimes admitting two spacelike Killingvectors appearinvariousph ysical situations. They can represent cylindrical waves, inhomogeneous cosmologi- cal models or gravitational ﬁeld around cosmic strings (see e.g. [1] [2 ] [3] [4] and references therein). In late 70’s Belinskii and Zakharov [5] des cribed a soliton technique of solving the vacuum Einstein equations in the case with two spacelike Killing vectors. Another technique allows to generate p erfect ﬂuid solutions from vacuum solutions [6]. In this paper we propose a re lated approach which doesn’t require solving the vacuum equations. The m ethod is based on the observation that some of the Einstein equations are iden- tically satisﬁed if the metric components are deﬁned in a speciﬁc way b y a 2-dimensional surface in 3-dimensional nonphysical Minkowski sp ace [7]. In this case the ﬁeld equations reduce to a single diﬀerential equatio n. We demonstrate a usefulness of the method on an example. More exam ples will be published elsewhere [8]. 1\n2 Reduction of the Einstein equations LetMbe a 4 dimensional manifold with metric tensor gof the signature +−−−and coordinates xµ(µ= 0,1,2,3) . We are looking for solutions of the perfect ﬂuid Einstein equations Rµ ν=κ[(ǫ+p)uµuν−1 2(ǫ−p)δµ ν] (1) whereκ= 8πG/c4,pis the pressure, ǫis the energy density and uνis the normalized velocity of the ﬂuid, uνuν= 1. We assume that gadmits two commuting spacelike Killing vectors orthogonal to 2-dimensional sur faces. Then there exists a coordinate system such that g=gABdxAdxB+ρnabdxadxb(2) whereA,B= 0,1 anda,b= 2,3, functions ρ,gAB,nabdepend only on the coordinates x0andx1, matrixn= (nab) is negative deﬁnite, ρ>0 and detn= 1. (3) The Ricci tensor of gcan be obtained by a direct calculation or projection formalism of Geroch [9] [10]. It takes the following form RAB=1 2R(2)gAB−1 ρρ|AB+1 2ρ2ρ,Aρ,B+1 4nab,Anab ,B, (4) RAa= 0, (5) Ra b=−1 2ρ(ρ,Aδa b+ρnacncb,A)|A, (6) wheren−1= (nab) is the matrix inverse to n,R(2)is the scalar curvature of the two dimensional metric gABand|Adenotes the covariant derivative with respect to the metric gAB. Under the assumption ǫ+p¬ationslash= 0 the Einstein equations for gyieldua= 0 and ˜RAB=κ(ǫ+p)uAuB, (7) /squareρ=κρ(ǫ−p), (8) (ρn−1n,A)|A= 0, (9) where/squareρ=ρ|A|Aand ˜RAB=RAB+1 2ρ/squareρ gAB. (10) 2\nEquations(7), (8)canbesolved byanappropriatechoice ofthequ antities ǫ,panduAprovided det(˜RAB) = 0 (11) and ˜RA A˜R00>0. (12) Then the Einstein equations reduce to (9), (11) and (12). This app roach was successfully applied by several authors (see e.g. [11] [12]), us ually in combination with the method of separation of variables. In this pape r we propose to solve equation (9) in terms of 2-dimensional surfaces a nd to treat equation (11) as an equation for a conformal factor in the metric gAB. In this way the Einstein equations are reduced to (11) and (12). 3 Relation to surfaces Consider vector /vector nwith coeﬃcients ni(i= 1,2,3) related to the matrix n= (nab) in the following manner n=(g n3+n1n2 n2n3−n1)g . (13) Sincenis negative deﬁnite and obeys condition (3) we have to assume that n3<0, (14) /vector n2=−1, (15) where/vector n2=n12+n22−n32. In terms of /vector nequation (9) reads d(ρ/vector n×∗d/vector n) = 0, (16) wheredis the exterior derivative and the star denotes the Hodge dual with respect to the metric gAB. Equation (16) is a variant of the Ernst equation if/squareρ= 0 (thenp=ǫ). In contrast to (11) it is preserved, for any ρ, by the conformal transformations of the metric gAB gAB=γeψg′ AB, (17) whereγ=±1 andψis a function of x0andx1. Because of this invariance we can ﬁrst look for ρ,/vector nandg′ ABsatisfying (16) and then ﬁt ψin order to fulﬁl (11) and (12). 3\nLetM2,1be the 3-dimensional Minkowski space with coordinates xiand metricηij=diag(1,1,-1). Asshown in[7]every solutionofequation(16)which satisﬁes condition d/vector n×d/vector n¬ationslash= 0 (18) corresponds to a 2-dimensional spacelike surface Σ in M2,1. Vector/vector ncan be identiﬁed with the normal vector of the surface. Equation (16) is id entically satisﬁed ifgABis proportional to the second fundamental form of Σ and the functionρis related to the (necessarily negative) Gauss curvature Kof Σ by ρ= (−K)−1/2. (19) Theseobservationsleadtothefollowingtheoremwhichdescribesam ethod of solving the Einstein equations with perfect ﬂuid. Theorem. LetΣbe a spacelike surface in the 3-dimensional (nonphysical) M inkowski space with the negative Gauss curvature K. Assume that 4-dimensional spacetime metric gis given by (2), (13) and (17), where /vector nis the unit normal vector of Σsatisfying (14), the function ρis deﬁned by (19) and g′ ABis pro- portional to the second fundamental form of Σ. Then the Einstein equations (1) reduce to equation (11) for ψand inequality (12) . In this method the pressure and the energy of the ﬂuid are given in t erms of the metric components as follows κp=1 2RA A, (20) κǫ=1 2RA A+1 ρ/squareρ. (21) In most cases pandǫdo not undergo a barotropic equation of state (see [8] for counter examples of cosmological type). They satisfy the d ominant energy condition ǫ≥ |p|if γ/square′ρ≥0 (22) (/square′correspond to the metric g′ AB) and inequality (12) is replaced by ˜RA A>0 (23) ˜R00>0. (24) Condition(22)canbeusedtoﬁx γ. Conditions(23), (24)dependnontrivially on the conformal factor ψ. They can be satisﬁed locally by an appropriate choice of the initial data for ψ(note that equation (11) is of the second order inψ, hence the initial data consists of two functions of one variable). 4\n4 Example As an example of application of Theorem we consider a rotational sur face Σ given by xi(τ,x) =( (τ−τ0)cos2x,(τ−τ0)sin2x,τ−1) , (25) whereτ0is a constant and xA=τ,xare the internal coordinates on Σ. In order to assure the spacelike character of Σ we assume that τ >τ0≥1. (26) In this case the unit normal vector satisfying (14) reads /vector n=−1√ τ4−1( cos2x,sin2x,τ2) (27) and the fundamental forms of Σ are given by gI=dxidxi= (1−τ−4)dτ2+4(τ−τ0)2dx2, (28) gII=dnidxi=4(τ−τ0)√ τ4−1(dτ2 2τ(τ−τ0)−dx2) . (29) It follows from (19) and the well known formula K= detgI/detgIIthat ρ= (τ4−1)/radicalbigg τ−τ0 2τ3. (30) According to Theorem one can relate with Σ the following 4-dimensiona l metric (we choose γ= 1) g=ρ/bracketleftBig eψ(dτ2 2τ(τ−τ0)−dx2) −/radicalbigg τ2−1 τ2+1( cosxdy−sinxdz)2+ −/radicalbigg τ2+1 τ2−1( sinxdy+cosxdz)2/bracketrightBig .(31) Forψ=ψ(τ) the metric is a cosmological solution of Bianchi type VII0 with the velocity ﬁeld orthogonal to the hypersurfaces τ=const. In this case conditions (11), (12) reduce to ˜R11= 0 and ˜R00¬ationslash= 0 . A particular solution of them is given by ψ=1 2τ0logτ−1 τ+1−1 τ0arctanτ . (32) 5\nUp to knowledge of the authors the metric deﬁned by (30)-(32) is a new non-tilted cosmological solution. The corresponding energy and pr essure of the ﬂuid can be obtained from formulas (20) and (21). Since the res ulting expressions are quite complicated we describe here only their gener al prop- erties when τ0= 2. In this case metric (31) is regular for all τ >0. For large values ofτthe cosmic time tis proportional to τ3/2andgtends to the ﬂat Robertson-Walker metric. The energy density is a monotonically dec reasing function of τsuch that ǫ− −− → τ→τ0∞, ǫ− −− → τ→∞0. (33) The ratiop/ǫis bounded by 1 and -1 (thus, the energy dominant condition is satisﬁed). It reaches a minimal value lower than −1 3and it has the following asymptotes p ǫ− −− → τ→τ01,p ǫ− −− → τ→∞−1 3. (34) This type of behaviour of energy and pressure may be interesting f rom the point of view of the modern cosmology (see e.g. [13]). Whenψ,x¬ationslash= 0 the metric (31) can be interpreted as an inhomogeneous cosmological solution. In this case equation (11) cannot be easily so lved. Acknowledgments . This work was partially supported by the Polish Com- mittee for Scientiﬁc Research (grant 2 P03B 127 24 and 2 P03B 036 2 3). Bibliograﬁa [1] E. Verdaguer, Soliton solutions in spacetimes with two spacelike Killing ﬁelds, Phys.Rep. 229(1993), 1. [2] H. Stephani, D. Kramer, , M. MacCallum, C. Hoenselaers and E. He rlt, Exact Solutions of Einstein’s Field Equations Second Editi on, Cam- bridge University Press 2003. [3] A. Krasi´ nski, Inhomogeneous cosmological models , Cambridge Univer- sity Press 1997. [4] A. Vilenkin, Cosmic strings and domain walls , Phys. Rep. 121(1985), 263. 6\n[5] V.A. Belinskii and V.E. Zakharov, Integrating of the Einstein equations by means of the inverse scattering problem technique and con struction of exact soliton solutions , Sov. Phys. JETP 48(1978), 958-994. [6] J. Wainwright, W.C.W. Ince, B.J. Marshman, Spatially homogeneous and inhomogeneous cosmologies with equation of state p=µ, Gen. Rel. Grav.10(1979), 259. [7] J. Tafel, Surfaces in R3with prescribed curvature , J. Geom. Phys. 17 (1995), 381-390. [8] A.Szereszewski and J. Tafel, From 2-dimensional surfaces to cosmologi- cal solutions , in preparation. [9] R. Geroch, A method for generating new solutions of Einstein’s equa- tions, J. Math. Phys. 13(1972), 394. [10] J.T. Whelan and J.D. Romano, Quasi-stationary binary inspiral. I. Ein- stein equations for the two Killing vector spacetime , Phys. Rev. D 60 (1999), 084009-1. [11] J.M.M. Senovilla and R. Vera, G2cosmological models separable in non- comoving coordinates , Class. Quantum Grav. 15(1998), 1737. [12] M. Mars and T. Wolf, G2perfect-ﬂuid cosmologies with a proper confor- mal Killing verctor , Class. Quantum Grav. 14(1997), 2303. [13] I. Zlatev, L.M. Wang and P.J. Steinhardt, Quintessence, cosmic coinci- dence,and the cosmological constant , Phys. Rev. Lett. 82(1999), 896. 7\n",
  "metadata": {
    "paper_id": "gr-qc/0311077v1",
    "downloaded_at": "2025-08-24T19:33:48.833313+00:00"
  },
  "processed_at": "2025-08-24T19:33:48.833332+00:00"
}