{
  "content": "arXiv:gr-qc/0204048v1 15 Apr 2002CLASSICAL AND QUANTIZED ASPECTS OF DYNAMICS IN FIVE-DIMENSIONAL RELATIVITY Paul S. Wesson1,2 1. Dept. Physics, Univ. of Waterloo, Waterloo, ON N2L 2G1, Canada Keywords: particle motion, quantization, uncertainty, induced ma tter, membranes PACs: 04.50.+h: 04.20.Cv 2. Correspondence: Mail = (1) above; fax=(519) 746-8115; email=wesson@astro.uwaterloo.ca. 1\nCLASSICAL AND QUANTIZED ASPECTS OF DYNAMICS IN FIVE-DIMENSIONAL RELATIVITY Abstract A null path in 5D can appear as a timelike path in 4D, and for a certain gauge in 5D the motion of a massive particle in 4D obeys the usu al quantization rule with an uncertainty-type relation. Generalization s of this result are discussed in regard to induced-matter and membrane th eory. 1 Introduction Recentlytherehavebeentworelatedresultsindynamicsfromﬁve- dimensional relativity which are remarkable. (a) When a theory like general relat iv- ity is extended from 4D to 5D a ﬁfth force appears, and this can man i- fest itself in spacetime [1-16]. In 4D it is well known that the force (pe r unit inertial mass) and velocity are constrained by the orthogonalit y condi- tionfαuα= 0(α= 0,123). In 5D the corresponding condition is fAuA= 0(A= 0,123,4),but then fαuα=−f4u4¬ationslash= 0 [7]. The ﬁfth force does not 2\nmanifest itself for a certain class of metrics based on pure canonica l coordi- nates [2], for metrics where the coordinates can be chosen so as to make the velocity in the extra dimension comoving [8], and for metrics parametiz ed in such a way as to make it disappear [15]. In general, however, the ﬁft h force exists for 5D metrics which depend on the extra coordinate x4=l, and is therefore present in both induced-matter theory [2-8, 12, 13, 1 6] and brane theory [9-11, 14, 15]. The ﬁfth force is diﬀerent from others in 4D d ynamics in that it acts parallel to the 4-velocity uα, so it is natural to express its eﬀects in terms of the momenta or the (inertial) rest mass mof the parti- cle that feels it [2, 6, 8, 9]. This is why mcan be related to lor its rate of change, depending on the coordinates, as will be discussed below . (b) When a manifold is extended from 4D to 5D the spacetime line element ds is embedded in a larger line element dS, and particles which are massive and move on timelike paths in 4D with ds2>0 can move on null paths in 5D withdS2= 0 [16-20]. Conventional causality is deﬁned by ds2≥0, but this is compatible with ds2≥0 ords2≤0 [18]. Photons move on 5D geodesics withds2= 0 =dS2, but massive particles can also move on geodesics with dS2= 0 provided 4D paths are allowed with m=m(s). This will in general be the case if the ﬁfth force acts, as outlined above. The mass var iation 3\ndoes not manifest itself if the parameter along the path is specially ch osen to make it disappear [19]; but to make contact with standard 4D dynamic s it is logical to use sas the parameter, so in general m=m(s) in both induced- matter theory and brane theory. The null condition dS2= 0 is compatible with the conventional relation between the energy, momentum and mass of a particle in 4D but means that its “energy” is zero in 5D. This agrees w ith the fact that Campbell’s theorem guarantees the local embedding o f any 4D Riemannian space which is curved and contains matter in a 5D Riemannia n space which is Ricci-ﬂat and empty [21-24]. The precise form for the e nergy of a particle in 4D depends on the 5D metric or the coordinates, as will be discussed below. The results summarized in (a), (b) above are startling but classical in nature. We wish to compliment them below by deriving some results rela ted to the quantized aspects of particle dynamics. It is already appare nt that 5D physics is enriched by the addition of an extra dimension but perfo rce encumbered by the need to make a choice of 5D coordinates (or gau ge) which gives back recognizeable 4D physics. Obviously the group of 5D coor dinate transformations xA→xA( xB) is wider than the group of 4D coordinate transformations xα→xα( xβ) , and wider than the restricted group of trans- 4\nformations (diﬀeomorphisms) xα→xα( xβ) ,x4→x4(x4) sometimes used. In the next section, we will therefore start without apology from a met- ric which is chosen (with hindsight) to give back recognizeable 4D phys ics. This metric does not look like the canonical metric of induced-matter theory (which is basically a factor in l2multiplied onto an Einstein metric plus an extra ﬂat part) or the warp metric of brane theory (which is basica lly an exponential factor in lmultiplied onto an Einstein metric plus an extra ﬂat part). After deriving some results from the new metric we will, howev er, reinterpret it and put it into context. Our results will support the c onjecture [8] that classical 5D physics can lead to quantized 4D physics. 2 The 5D Planck and Einstein Gauges The 5D line element given by dS2=gABdxAdxB(A= 0,123,4) contains the 4D one ds2=gαβdxαdxβ(α= 0,123). We can use 4 of the available 5 degrees of coordinate freedom to set g4α= 0, which in the old Kaluza- Klein theory were identiﬁed with the electromagnetic potentials. We c ould use the remaining degree of freedom to set |g44|= 1 and thereby supress the scalar potential, but in some newer versions of Kaluza-Klein theory t his is 5\nrelated to the Higgs potential [8], and it proves more instructive to r estrict this only via g44=g44(x4) without at the outset carrying out the coordinate transformation that would make it constant. (We will do this later; t he 5D geodesic equation for unrestricted gABis considered in reference 3.) The problem is so far general in a mathematical sense if we allow the space time metric to be gαβ=gαβ(xγ, x4). Exact solutions of the ﬁeld equations are known that have this property, including cosmological ones which re duce on the hypersurfaces x4= constants to Friedmann-Robertson-Walker models and agree with observations [8]. However, the focus here is on part icle dy- namics, and since observations indicate that there is no explicit incur sion of the ﬁfth dimension into local spacetime, we put gαβ=gαβ(xγ), which means that the Weak Equivalence Principle is a symmetry of the 4D part of th e 5D metric. We label the time, space and extra coordinates by x0=ct, x123 andx4=l, taking them all to have physical dimensions of length. To dis- tinguish physically between our starting gauge and a later one, it is us eful to retain conventional dimensions for the speed of light c, Planck’s constant hand the gravitational constant G. We refrain at the outset from physi- cally identifying x4=l, though it is apparent from the comments in Section 1 that we expect it to be related to the (inertial) rest mass of a test par- 6\nticle. We also expect m=m(s). It should be noted that this does not violate the usual condition gαβuαuβ= 1 for the 4-velocities uα≡dxα/up∼lopeds. This is a normalization condition on the velocities, not a coordinate con di- tion on the metric, so we can adopt it. Multiplying this condition by m2 givespαpα=m2wherepα≡muαwith no restriction onm=m(s). In other words, the (squares of the) energy E2=m2c4u0u0and 3-momentum p2=m2c2(u1u1+u2u2+u3u3) satisfyE2−p2c2−m2c4= 0 even if the mass varies in spacetime. The last-noted relation is closely obeyed by real parti- cles; but while the opposite sign for g44has been taken in so-called two-time metric [25-30 and below], the implication is that our 5D metric should hav e [+(- - -)-] for its signature. Based on the preceding, consider a line element given by dS2=L2 l2gαβ(xγ)dxαdxβ−L4 l4dl2. (1) HereLis a constant length introduced for dimensional consistency whose physical meaning we will return to below. The Lagragian density L= (dS/up∼lopeds)2[19] has associated with it 5-momenta given by Pα=∂L ∂(dxα/up∼lopeds)=2L2 l2gαβdxβ ds(2a) Pl=∂L ∂(dl/up∼lopeds)=−2L4 l4dl ds. (2b) 7\nThese deﬁne a 5D scalar which is the analog of the one used in 4D quant um mechanics: ∫display PAdxA=∫display (Pαdxα+Pldl) =∫display2L2 l2/bracketleftBigg 1−(gL ldl ds)g2/bracketrightBigg ds . (3) This is zero for dS2= 0, since then (1) gives l=l0e±s/L,dl ds=±l L, (4) wherel0is a constant. The second member of this shows why some workers have related the (inertial) rest mass of a particle to l[8] and some to its rate of change [20] with consistent results: the two parametizations ar e essentially equivalent. In both cases, the variation is slow if s/up∼lopeL≪1 (see below). We prefer to proceed with the former, because it is simpler. Also, this m akes the ﬁrst part of the 5D line element in (1) essentially the element of the us ual 4D action mcds. It should be noted in passing that in forming the total action from the latter quantity, the mshould go inside the integral, even in 4D theory [31]. The appropriate parametization with the problem as s et up here isl=h/mc, the Compton wavelength of the particle. The latter has ﬁnite energy in 4D, but zero “energy” in 5D because∫text PAdxA= 0. The corresponding quantity in 4D is∫text pαdxαand for a massive particle 8\nis nonzero. Using relations from the preceding paragraph, it is ∫display pαdxα=∫display muαdxα=∫displayhds cl=±h cL l. (5) The fact that this can be positive or negative goes back to (4), but since the motion is reversible we will suppress the sign in what follows for conven ience. We will also put L/l=n, anticipating a physical interpretation which indi- cates that it is not only dimensionless but may be a rational number. T hen (5) says ∫display mcds=nh. (6) Thus the conventional action of particle physics in 4D follows from a n ull line element (1) in 5D. The other scalar quantity that is of interest in this approach is dpαdxα. (It should be recalled that dxαtransforms as a tensor but xαdoes not.) Following the same procedure as above there comes dpαdxα=h c(gduα dsdxα ds−1 ldl ds)gds2 l. (7) The ﬁrst term inside the parenthesis here is zero if the acceleration is zero or if the scalar product with the velocity is zero as in conventional 4D dy namics 9\n(see Section 1). But even so, there is a contribution from the seco nd term inside the parenthesis which is due to the change in mass of the partic le. This anomalous contribution has magnitude |dpαdxα|=h c/vextendsingle/vextendsingle/vextendsingle/vextendsingledl ds/vextendsingle/vextendsingle/vextendsingle/vextendsingleds2 l2=h cds2 Ll=nh c(gdl l)g2 , (8) where we have used (4) and n=L/up∼lopel. The latter implies dn/up∼lopen=−dl/up∼lopel= dKl/up∼lopeKlwhereKl≡1/up∼lopelisthewavenumber fortheextra dimension. Clearly (8) is a Heisenberg-type relation, and can be written |dpαdxα|=h cdn2 n. (9) This requires some interpretation, however. Looking back at the 5 D line element (1), it is apparent that Lis a length scale not only for the extra dimension but also for the 4D part of the manifold. (There may be oth er scales associated with the sources for the potentials that ﬁgure in gαβ, and these may deﬁne a scale via the 4D Ricci scalar R, but we expect that the 5D ﬁeld equations will relate RtoL, as will be illustrated below.) As the particle moves in spacetime, it therefore “feels” L, and this is reﬂected in the behaviour of its mass and momentum. Relations (6) and (9) quantify this. If the particle is viewed as a wave, its 4-momenta are deﬁned by the de B roglie wavelengthsanditsmassisdeﬁnedbytheComptonwavelength. The relation 10\ndS2= 0 for (1) is equivalent to PAPA= 0 orKAKA= 0.The question then arises of whether the waves concerned are propagating in an open topology or trapped in a closed topology. In the former case, the wavelengt h is not constrained by the geometry, and low-mass particles can have larg e Compton wavelengths l=h/up∼lopemcwithl > Landn=L/up∼lopel <1. In the latter case, the wavelength cannot exceed the conﬁning size of the geometry, and high-mass particles have small Compton wavelengths with l≤Landn≥1. By (9), the former case obeys the conventional Uncertainty Principle while the latter case violates it. This subject clearly needs an in-depth study, but w ith the approach adopted here we tentatively identify the former case as applying to real particles and the latter case as applying to virtual particles. The fundamental mode ( n= 1) deserves special comment. This can be studied using (6)-(9), or directly from (1) by using l=h/up∼lopemcwithdS2= 0. The latter procedure gives |dm|=mds/up∼lopeLwhich with (6) yields m= (∫text mcds) /up∼lopecL=nh/up∼lopecL. This deﬁnes for n= 1 a fundamental unit mass, m0=h/up∼lopecL. In general Lis a scale set by the problem, analogous to the “box” size in old wave mechanics. In cosmology, we expect Lto be related to the cosmological constant Λ. This inference is backed by detailed analysis of the ﬁeld equations and an examination of certain exact solutions t hereof 11\n[2, 5, 8, 9 and below]. These give Λ = 3 /up∼lopeL2. The cosmological value of L= (3/up∼lopeΛ)1/2is a maximum for this parameter, deﬁning a minimum for m0 that applies even to particle physics. Astrophysical data indicate a positive value for Λ of approximately 3 ×10−56cm−2, though in view of observational uncertainties thisshouldbetakenasaconstraint ratherthanade termination [32-36]. The noted value corresponds to a density for the vacuum in general relativity of Λ c2/up∼lope8πG≃2×10−29gcm−3, close to that required for closure. The unit mass involved is m0=h cL=h c(gΛ 3)g1/2 ≃2×10−65g . (10) This is too small to be detected using current techniques and explain s why mass does not appear to be quantized. The mass unit (10) is tiny even by the standards of particle physics, and before proceeding to a presentation of more technical results a f ew comments on concepts may be useful. The mass (10) of order 10−65g follows from the length scale Λ−1/2of order 1028cm, or equivalently the time scale of order 1018s which is the age of the universe. A more detailed analysis might alter the numbers somewhat (such an analysis might, for example, involve the size of the particle horizon at the current epoch or the current siz e of the cosmological “constant” in models where this parameter varies). B ut the 12\nmagnitude of (10) is based on astrophysical data [32-36], and is exp ected to be correct to order of magnitude. However, the interaction of a p article with massmoof order (10) with a vacuum of energy density of order Λ c4/up∼lope8πG involves poorly-understood physics. Preliminary discussions of this and related issues have been given recently [37, 38]. Our view, based on ( 1) and the more general line element (13) below, is that a “particle” is ju st a localized concentration of energy in a medium where the distinction be tween ordinary matter and the vacuum is convenient but artiﬁcial. Energy , deﬁned as the quantity which curves 4D space, consists in general of cont ributions of both types [8, 37]. Indeed, energy is a 4D concept that can be de rived from 5D geometry, with Campbell’s theorem providing the link [21-24]. T he small mass (10) simply reﬂects the small (4D) curvature of the univ erse. In other problems, the parameter Lin relations (1)-(10)can have diﬀerent sizes. Consider the hydrogen atom. (A detailed analysis of this problem is be yond the scope of the present work, but would involve an exact solution o f the 5D ﬁeld equations with electromagnetic potentials and orbital structu re of the shell kind discussed in reference 8, pp. 117-125.) The length scale is of order 10−8cm, or equivalently the time scale is of order 10−18s, so the unit mass would be many orders diﬀerent from that given by (10). Neverthele ss, (10) 13\ndeﬁnes the irreducible unit mass set by the energy density of the ba ckground universe as measured by the cosmological constant. The metric (1) which leads to (10) and the other results noted abov e involve an algebraic choice for how x4=lenters that is suited to the physical identiﬁcation l=h/up∼lopemc.Those results also depend on the assumption that the 5D path is null. It is appropriate to call (1) the Plank gauge. To pu t this gauge into the context of other work on 5D dynamics [1-20], let us co nsider brieﬂy how (1) may be altered in form and generalized. Transforming (1) via l→L2/up∼lopelgives dS2=l2 L2gαβ(xγ)dxαdxβ−dl2, (11) which is pure canonical in form [2, 6, 8]. It is known that for (11) the 5 D ﬁeld equations RAB= 0 contain the4D Einstein equations inthe form Gαβ= 3gαβ/up∼lopeL2, which describes a vacuum spacetime with G=−R= 12/up∼lopeL2= 4Λ soΛ = 3/up∼lopeL2. (HereRABisthe5DRiccitensor, Gαβisthe4DEinsteintensor andRis the 4D Ricci scalar. The last relation was noted above.) While it is a special case of Campbell’s theorem, we see that any solution of th e 4D vacuum Einstein equations can be embedded in a solution of the 5D vac uum ﬁeld equations, including that of Schwarzschild [8]. This implies that (11 ) is relevant to gravitational problems, and for this and other reason s discussed 14\nbelow we will henceforth refer to (11) as the Einstein gauge. It has been studied by several workers in the general case where gαβ=gαβ(xγ, l) and dS2¬ationslash= 0[2-8]. Asmentionedbefore, weexpect thatthiswillleadtoviolation s of the Weak Equivalence Principle, since in general the 4-acceleratio ns of test particles will depend on l, which whatever its physical meaning may not be thesame for all of them. This is bornout by the5D geodesic equation , whose components yield equations of motion in spacetime and the extra dime nsion which can be written thus: duµ ds+Γµ βγuβuγ=fµ(12a) fµ≡(g −gµα+1 2dxµ dsdxα ds)gdxβ dsdl ds∂gαβ ∂l(12b) d2l ds2−2 l(gdl ds)g2 +l L2=−1 2/bracketleftBigg l2 L2−(gdl ds)g2/bracketrightBigg dxα dsdxβ ds∂gαβ ∂l.(12c) Here Γµ βγare the usual 4D Christoﬀel symbols, and fµis the ﬁfth force (per unit inertial mass) which was ﬁrst found explicitly in the context of ind uced- matter theory [2] but also ﬁgures in brane theory [9, 10]. Equation ( 12c) is second order, and is identically satisﬁed with no constraint on ∂gαβ/up∼lope∂lby l=l0exp[±(s−s0)/up∼lopeL], where l0ands0are arbitrary constants. This is essentially (4) again, and by (11) means dS2= 0. [It can be veriﬁed also 15\nthat the reverse transformation l→L2/up∼lopelwhich converts (11) to (1) leaves the forms of (12a) and (12b) unchanged, while (12c) retains its fo rm for the r.h.s. andbecomes ( d2l/up∼lopeds2−l/up∼lopeL2) forthe l.h.s.] Wesee thatthe Einstein gauge (11) and the Planck gauge (1) describe essentially the same t hing from a mathematical perspective. There is, however, an important diﬀerence from the physical pers pective. For the Planck gauge (1), we have argued that massive particles mo ve on null 5D paths where the extra coordinate is lP=h/up∼lopemc, a view which is consistent with induced-matter theory [16] and equivalent by (4) w ith the relation between the mass and the extra component of the moment um in branetheory [20]. FortheEinstein gauge(11), however, the relev ant physical identiﬁcation is obviously lE=Gm/up∼lopec2. This parametization goes back to at least 1990 [39], continues to the used [14], and is consistent with the w idely- held view that the essential role of fundamental constants is to tr anspose physical dimensions [40, 41]. But it is important to realize that it is only in the Planck and Einstein gauges that such simple parametizations of t he mass hold. To appreciate why this is so, reconsider (1) and(11). In thef ormer, the proper distance in the ﬁfth dimension, deﬁned in analogy with the pro per time in general relativity, is/vextendsingle/vextendsingle∫text (L2/up∼lopel2)dl/vextendsingle/vextendsingle=L2/up∼lopel∼m. In the latter, 16\nthe proper distance is just l∼m. But in the general case the appropriate quantity to consider is∫text/vextendsingle/vextendsingle/vextendsingleǫg1/2 44/vextendsingle/vextendsingle/vextendsingledl=∫text |ǫΦ|dlwhereg44=ǫΦ2( xA) is the scalar potential [42, 43]. This is suppressed in (1), (11) but is gener ally present in 5D metrics which have spacelike ( ǫ=−1) or timelike ( ǫ= +1) extra dimensions. The appropriate line element to replace (1), (11) is dS2=gαβ(xγ,l)dxαdxβ+ǫΦ2(xγ,l)dl2. (13) This is general insofar as it lacks g4αbut retains g44and does not l−factorize gαβ. The components of the 5D Ricci tensor RABfor (13) can be worked out using tedious algebra (see ref. 8, p. 58). These can be applied t o both induced-matter theory and brane theory. For RAB= 0, the implied 15 relations yield naturally a set of 10 equations involving the 4D Einste in tensor, a set of 4 conservation equations and 1 wave equation. Th e last is ǫΦ/squareΦ =−gλβ ,4gλβ,4 4−gλβgλβ,44 2+Φ,4gλβgλβ,4 2Φ. (14) Here/squareΦ≡gµνΦ,µ;νwhere a comma denotes the partial derivative and a semicolon denotes the 4D covariant derivative. Relation (14) has no analog in 4D since it comes from R44= 0,and has been suggested in certain versions of 5D theory as being the equation for the Higgs ﬁeld which determine s the masses of particles [8]. Another relation which follows from (13) for RAB= 0 17\nand deserves attention is that for the 4D Ricci scalar. This may be s hown to be given by R=ǫ 4Φ2/bracketleftbig gµν ,4gµν,4+(gµνgµν,4)2/bracketrightbig . (15) This alters the status of Λ as determined by vacuum spacetimes (se e above). Relations (14) and (15) require detailed study in regard to the hiera rchy problem and the cosmological-constant problem encountered by old Kaluza- Klein theory. As a last comment on how (1) may be altered in form and generalized, we remark that the signature may be changed. This results in a two- time metric of the type we have mentioned but ignored [25-30]. However, they have interesting properties. For example, the ﬁrst such found re presents an exact solution of the 5D ﬁeld equations which describes a wave propa gating through a 4D de Sitter vacuum [25]. It is germane to point out that wa ve- like behaviour cannot in general be obtained simply by applying a Wick rotation to the ﬁfth dimension as done in the Euclidean approach to 4 D quantum gravity [44]. Thus l→ilin (1) or (2) with dS2= 0 just gives backl=l0exp(±s/up∼lopeL) as in (4), which is a growing or shrinking mode. [The change is slow for s/up∼lopeL≪1, as pointed out above; and by (12) is dynamically undetectable anyway in the pure Planck and Einstein gaug es 18\nwith∂gαβ/up∼lope∂l= 0, since fµ= 0 and the motion is geodesic in 4D.] Neither are (1) and (2) altered by the so-called Z2transformation l→ −lof brane theory [20]. But if we take (1) or (2) with the opposite sign for the las t part of the metric and dS2= 0, there results l=l0exp(±is/up∼lopeL). This is an oscillating mode, and such deserve further study to see if they are related to the wave nature of particles. It is clear from the comments above that the Planck gauge (1) and t he Einstein gauge (11) are mathematically equivalent and physically spec ial. So why are they eﬃcacious? The answer is that both have 4D parts whic h are eﬀectively momentum manifolds rather than coordinate manifolds. T his is achieved respectively through the mass parametizations lP=h mc, lE=Gm c2. (16) These choices in old4D theories of the scalar-tensor andscale-inva riant types were referred to as reﬂecting the use of atomic and gravitational units[45]; but in the present approach they refer to the use of coordinates in an under- lying theory which is 5D covariant. In the present approach, the Pla nck mass (hc/up∼lopeG)1 2as so deﬁned lacks physical meaning, because it is a combination of constants from both gauges (16) whose only purpose in either is to transpose dimensions [40, 41, 45]. Put another way, the ratio lE/up∼lopelP=Gm2/up∼lopechcan 19\nbe formed and set equal to unity to produce m= (ch/up∼lopeG)1 2, but this involves mixing coordinates and is therefore badly deﬁned. 3 Conclusion There have been two recent results in ﬁve-dimensional relativity wh ich are remarkable. One is the existence in general of a ﬁfth force which ac ts parallel to the velocity in spacetime and can be related to a change in the (iner tial) rest mass of a particle. The other is the realization that a null path in ﬁve dimensions can correspond to a timelike path in spacetime for a massiv e par- ticle. Both of these results require for their evaluation a choice of c oordinates or gauge. The Planck gauge (1) is so called because it leads to the usu al rule of quantization (6) and an uncertainty-type relation (9). If the s cale of the 5D geometry is related to the 4D cosmological constant, there is a q uan- tum of mass (10). The Einstein gauge (1) is so called because it embed s the Schwarzschild solution, recognizes the Weak Equivalence Princip le as a symmetry of the metric and gives back 4D geodesic motion. Both gau ges are mathematically special but physically convenient because their 4 D parts eﬀectively describe momentum manifolds rather than coordinate ma nifolds. 20\nBoth can be generalized, notably to (13) which applies to all problems which do not involve explicit electromagnetic-type potentials. This leads to a wave equation (14) for the scalar or Higgs potential which has implications for the masses of particles, and an embedding equation (15) for the scalar curvature of spacetime which has implications for the size of the cosmological co nstant. While the Planck and Einstein gauges (16) are well deﬁned and the und erly- ing theory is covariant, a mixture of the two that produces the Plan ck mass is ill deﬁned, suggesting that if this parameter has meaning it does so in the context of an N(>5)Dtheory. The current versions of 5D relativity that attract most attention are induced-matter theory and membrane theory. However, it is wort h recall- ing that any 5D theory of the Kaluza-Klein type describes a spin-2 gr aviton, a spin-1 photon and a spin-0 scalaron. While many topics for future w ork are suggested by the outline given above, an obvious question conc erns the status of spin-1 2particles like the electron. Logically, an extension of the present approach would give a geometrical account not only of bos ons but also of fermions. The usual approach to this, following Dirac, is of co urse to factorize the 4D metric. But it is well known that in relativity the prod uct of the classical spin and path vectors of a particle can be made to va nish. 21\nPreliminary work on this condition in 5D shows that it leads to a relation that resembles the Dirac equation in 4D, with the mass entering as a c oor- dinate. A related question concerns how to relate the geometrical approach to mass outlined above to the one in quantum ﬁeld theory, where it ar ises as the eigenvalue of the mass operator in the irreducible representat ion of the appropriate symmetry group. If mass is geometrical in nature and described by anN(≥5)Dﬁeld theory, the latter will in general require the introduc- tion of symmetry groups to explain the masses and other propertie s of the observed elementary particles. We hope that this and other proble ms will provide interesting exercises for the reader. Acknowledgements Thanks for comments go to H. Liu and S.S. Seahra. This work was supported by N.S.E.R.C. References 1. Y.M Cho, D.H. Park, Gen. Rel. Grav. 23 (1991) 741. 2. B. Mashhoon, H. Liu, P.S. Wesson, Phys. Lett. B 331 (1994) 305. 3. P.S. Wesson, J. Ponce de Leon, Astron. Astrophys. 294 (1995) 1. 22\n4. H. Liu, B. Mashhoon, Ann. Phys. (Leipzig) 4 (1995) 565. 5. P.S. Wesson, B. Mashhoon, H. Liu, Mod. Phys. Lett. A 12 (1997) 2309. 6. B. Mashhoon, H. Liu, P.S. Wesson, Gen. Rel. Grav. 30 (1998) 555. 7. P.S. Wesson, B. Mashhoon, H. Liu, W.N. Sajko, Phys. Lett. B 456 (1999) 34. 8. P.S. Wesson, Space-Time-Matter, World Scientiﬁc, Singapore (1 999). 9. D. Youm, Phys. Rev. D 62 (2000) 084002. 10. R. Maartens, Phys. Rev. D 62 (2000) 084023. 11. A. Chamblin, Class. Quant. Grav. 18 (2001) L17. 12. H. Liu, B. Mashhoon, Phys. Lett. A 272 (2000) 26. 13. A. Billiard, W.N. Sajko, Gen. Rel. Grav. 33 (2001) 1929. 14. W.B. Belayev, gr-qc/0110099 (2001). 15. J. Ponce de Leon, Phys. Lett. B 523 (2001) 311. 16. P.S. Wesson, J. Math. Phys. in press (2002) (gr-gc/0105059 ). 23\n17. V. Fock, Zeit. Phys. (Leipzig) 39 (1926) 226. 18. A. Davidson, D.A. Owen, Phys. Lett. B 177 (1986) 77. 19. S.S. Seahra, P.S. Wesson, Gen Rel. Grav. 33 (2001) 1731. 20. D. Youm, Mod. Phys. Lett. A 16 (2001) 2371. 21. J.E. Campbell, A Course of Diﬀerential Geometry, Clarendon, Ox ford (1926). 22. S. Rippl, C. Romero, R. Tavakol, Class. Quant. Grav. 12 (1995) 2411. 23. C. Romero, R. Tavakol, R. Zalaletdinov, Gen. Rel. Grav. 28 (1996) 365. 24. J.E. Lidsey, C. Romero, R. Tavakol, S. Rippl, Class. Quant. Grav . 14 (1997) 865. 25. A. Billyard, P.S. Wesson, Gen. Rel. Grav. 28 (1996) 129. 26. A. Billyard, P.S. Wesson, Phys. Rev. D 53 (1996) 731. 27. I. Bars, C. Kounnas, Phys. Rev. D 56 (1997) 3664. 28. I. Bars, C. Deliduman, O. Andreev, Phys. Rev. D 58 (1998), 066004. 24\n29. I. Bars, C. Deliduman, D. Minic, Phys. Rev. D 59 (1999) 125004. 30. J. Kocinski, M. Wierzbicki, gr-qc/0110075 (2001). 31. J.D. Bekenstein, Phys. Rev. D 15 (1977) 1458. 32. C.H. Lineweaver, Astrophys. J. 505 (1998) L69. 33. J.M. Overduin, F.I. Cooperstock, Phys. Rev. D 58 (1998) 043506. 34. J.M. Overduin, Astrophys. J. 517 (1999) L1. 35. M. Chiba, Y. Yoshii, Astrophys. J. 510 (1999) 42. 36. J.M. Eppley, R.B. Partridge, Astrophys. J. 538 (2000) 489. 37. P.S. Wesson, H. Liu, Int. J. Mod. Phys D 10 (2001) 905. 38. F. Mansouri, hep-th/0203150 (2002). 39. P.S. Wesson, Gen. Rel. Grav. 22 (1990) 707. 40. P.S. Wesson, Space Science Rev. 59 (1992) 365. 41. J.W.G. Wignall, Phys. Rev. Lett. 68 (1992) 5. 42. G.W. Ma, Phys. Lett. A 143 (1990) 183 43. G.W. Ma, Phys. Lett. A 146 (1990) 375. 25\n44. G.W. Gibbons, S.W. Hawking (eds.), Euclidean Quantum Gravity, World Scientiﬁc, Singapore (1993). 45. P.S. Wesson, Cosmology and Geophysics, Hilger/Oxford U. Pres s, New York (1978). 26\n",
  "metadata": {
    "paper_id": "gr-qc/0204048v1",
    "downloaded_at": "2025-08-24T19:51:16.050207+00:00"
  },
  "processed_at": "2025-08-24T19:51:16.050220+00:00"
}