{
  "content": "arXiv:gr-qc/0606081v1  19 Jun 2006Errata to “Flat Spacetime Vacuum in Loop Quantum\nGravity”\nA. MIKOVI ´C\nDepartamento de Matem´ atica, Universidade Lus´ ofona\nAv. do Campo Grande, 376, 1749-024, Lisboa, Portugal\nAbstract\nWe give the correct expressions for the spin network evaluat ions proposed in\nClass. Quant. Grav. 21(2004) 3909 as the coeﬃcients of the quantum gravity\nvacuum wavefunction in the spin network basis.\nIn [1] a proposal for the construction of the ﬂat spacetime vacuu m wavefunction in the\nloop quantum gravity formalism was given. According to this proposa l, if the spacetime\nmanifold has a topology Σ ×RandAis a ﬂat complex connection one-form on the SU(2)\nprincipal bundle over Σ, then a holomorphic gauge-invariant functio nal Ψ[A] satisﬁes the\nAshtekar constraints and hence it can be considered as a physical wavefunction. In order\nto obtain a physical wavefunction which describes the ﬂat backgro und geometry, one\nshould chose Ψ[ A] such that it is peaked around the ﬂat background values of the tr iads.\nThe simplest choice is\nΨ[A] = exp/parenleftbigg\niTr/integraldisplay\nΣEk\n0(x)Ak(x)d3x/parenrightbigg\n, (1)\nwhere the components of E0(x) represent the background triads. Although this choice\nis not gauge invariant, it can be modiﬁed when the theory is discretize d such that one\nobtains a gauge invariant result. The corresponding state in the sp in network basis is\ngiven by\n|Ψ/angbracketright=/summationdisplay\nsI(s)|s/angbracketright, (2)\nwhere|s/angbracketrightis an orthonormal basis of states labeled by the SU(2) spin networks s, and\nI(s) =/integraldisplay\nDAWs[A]δ(F)Ψ[A], (3)\nwhereWs[A] is the spin network wavefunction and Fis the connection curvature.\nThe path-integral I(s) can be deﬁned by discretizing Σ by using a corresponding\ntriangulation. This gives\nI(s) =/integraldisplay/productdisplay\nldglWs(gl′)/productdisplay\nfδ(gf)/productdisplay\nleiTr(AlE0\nl), (4)\nwherelandfdenote the edges and the faces respectively of the dual two-com plex Γ,gl\ndenote the corresponding SU(2) holonomies, gf=/producttext\nl∈∂fglandl′denote the dual edges\n1\nFigure 1: The graph corresponding to a theta-5 spin network embedded i nto the triangulation\nofS3consisting of two tetrahedra. The solid lines carry the face irreps Λ f, the dashed lines\ncarry the embedded spin network irreps jsand the dotted lines carry the edge irreps λl.\nwhich carry the irreps jsof the embedded spin network s. After performing the group\nintegrations, one obtains the following state-sum\nI(s) =/summationdisplay\nΛf,λl,ιl/productdisplay\nfdimΛf/angbracketleft/productdisplay\nlC(E0\nl,λl)/productdisplay\nvAv(Λf,js,ιs,ιl)/angbracketright, (5)\nwhereCare the edge amplitudes and Avare the vertex amplitudes of the spin foam Γ.\nTheιsandιlare the corresponding intertwiners, while the expression\n/angbracketleft/productdisplay\nlC(E0\nl,λl)/productdisplay\nvAv(Λf,js,ιs,ιl)/angbracketright\nindicates the evaluation of the spin network obtained by composing Γ ands. The corre-\nsponding graph is obtained by inserting the tetrahedron graphs int o the vertices of the\ngraph of Γ and then by inserting the vertices of the spin network sinto the corresponding\ntetrahedra, see Fig. 1. All the tetrahedra carry the irreps Λ fand the tetrahedra which\ncontain the vertices of the spin network shave the additional edges carrying the corre-\nsponding irreps js. Each edge lof Γ carries an irrep λland has the insertion C(E0\nl,λl).\nIn [1], the formula (5) was presented, but it was not as precisely deﬁ ned as it is\ndone here. Consequently, the expression for I(s) in the case of the theta-5 spin network\nembedded in the triangulation of Σ = S3consisting of two tetrahedra was not correct,\nbecauseitwasbasedonthewronggraph. Thecorrectexpression isbasedontheevaluation\nof the spin network whose graph is given in Fig. 1.\nThe second error appeared in the evaluation of the C(E0\nl,λl) matrix elements. The\naverage value of an element of the matrix C(E,j) was deﬁned as\nCj(E) =TrC(E,j)\ndimj, (6)\n2\nwhich was determined by the group integral\nCj(E) =/integraldisplay\nSU(2)dgχ(j)(g)ei/vectorA·/vectorE, g=ei/vectorA·/vector σ, (7)\nwhereχ(j)is the representation character and /vector σare the Pauli matrices. However, when\ncalculating (7), an incorrect expression for the SU(2) group measure was used. The\ncorrect expression is given by\ndg=1\n8π2sin2(A/2) sinθdAdθdφ, (8)\nwhereA=|/vectorA| ∈(0,4π),θ∈(0,π) andφ∈(0,2π), so that\nCj(E) =1\n4π/integraldisplay4π\n0dA/integraldisplayπ\n0sinθdθsin2(A/2)sin(j+1\n2)A\nsin(A/2)eiEAcosθ, (9)\nwhereE=|/vectorE|. This gives\nCj(E) =1\n2π/integraldisplay4π\n0dAsin(A/2) sin/bracketleftbigg/parenleftbigg\nj+1\n2/parenrightbigg\nA/bracketrightbiggsin(EA)\nEA, (10)\nwhich can be expressed as\nCj(E) =1\n8πE[K(j+E)−K(j−E)−K(j+1+E)+K(j+1−E)],(11)\nwhere\nK(a) =/integraldisplay4πa\n0sinx\nxdx. (12)\nReferences\n[1] A. Mikovi´ c, Class. Quant. Grav. 21 (2004) 3909\n3\n",
  "metadata": {
    "paper_id": "gr-qc/0606081v1",
    "downloaded_at": "2025-08-24T19:14:20.497258+00:00"
  },
  "processed_at": "2025-08-24T19:14:20.497298+00:00"
}