{
  "content": "arXiv:gr-qc/9806072v1 17 Jun 1998A rigidity result on the ideal boundary structure of smooth space-times C. J. Fama †§and C. J. S. Clarke ‡/ba∇dbl †Department of Mathematics, The University of Queensland, Brisba ne 4072, Australia. ‡Faculty of Mathematical Studies, University of Southampton, Sou thampton SO17 1BJ, UK. Submitted to: Class. Quantum Grav. Abstract. Following a survey of the abstract boundary deﬁnition of Scott and Szekeres, a rigidity result is proved for the smooth case, showing t hat the topological structure of the regular part of this boundary in invariantly deﬁne d. 1. Introduction The most intuitively natural deﬁnition of a boundary to a space-time (M,g) would seem to be obtained by topologically embedding Min a larger manifold /hatwiderMof the same dimension by means of a map φ:M→/hatwiderM, followed by taking the topological boundary ∂φMdef=∂(φ(M)) of the image φ(M) in/hatwiderM. (Whereφis of diﬀerentiability class Cℓ, ℓ/greaterorequalslant1 we shall refer to this as a Cℓenvelopment , or simply a smooth envelopment if the classCℓis understood.) The problem with this is that, unless further conditio ns are imposed, ∂φMdepends critically on the choice of φ, the diﬀerent possible ∂φMfor diﬀerentφbeing so variable in structure that they contain no invariant informa tion. Because of this diﬃculty, this approach was abandoned early on the history of relativity, in favour of boundary constructions linked more closely t o the detailed geometry of M. If, however, we were to restrict ourselve to regular envelopments , meaning envelopments where φwas a metric isometry into a “regular” (in some sense) (/hatwiderM,ˆg), thenwe might hopeformorerigidity (thatis, constancy oftopolo gicalstructure) in∂φM. To provide an overall context for this and related constructions Scott and Szekeres [1] have developed the abstract boundary construction which incorporates all possible boundaries ∂φMwith appropriate identiﬁcations being made between corresponding subsets of the boundaries (boundary sets). It is already known that if the metric is used certain topological properties of boundary set sarepreserved under §E-mail:chris@maths.uq.edu.au . /ba∇dblE-mail:cjsc@maths.soton.ac.uk .\nequivalence, even allowing for quite unpleasant properties of the me tric [2]. This work citedcanbesaidtoserveasaninterestingexampleoftherelativeea sewithwhichcertain simple results about the abstract boundary can be obtained, and a lso the crucial rˆ ole played by our “regularity/extendibility” assumptions (q.v.); howeve r, the work is not used here. In this paper we review the abstract boundary construction, we s urvey possible deﬁnitions of the notion of “regular”, and we show within this framew ork that we can achieve an appropriate rigidity of structure for a boudary constr ucted from regular envelopments. More precisely, we show that if we consider only boun daries that are regular and satisfy a Lipschitz condition, then all representatives of an equivalence class of boundary sets, in the sense of the abstract boundary, are ho meomorphic. Inwhatfollows, bya pseudo-Riemannianmanifold (M,g)wewillmeanaHausdorﬀ, paracompact topological manifold M, without a boundary in the usual sense, that is equipped with a C1atlas and a metric g.¶If, further,Mis connected, n= dimM/greaterorequalslant2, and the metric gis of Lorentz signature ( −+···+), then we shall refer to ( M,g) as a space-time . IfgisCℓ, someℓ/greaterorequalslant1, the covariant diﬀerential with respect to the unique torsion-free metric-compatible connection on Mwill be denoted ∇, org ∇if we wish to emphasise the rˆ ole of the metric. In fact, we mostly use the notat ionof [3]. Forexample, Xp∈Tp(M) will denote the value of the vector ﬁeld Xat the point p∈M. In referring to envelopments a boundary set is a subset B⊂∂φ. (We will normally have primed objects belonging to an envelopment ( M,/hatwiderM′,φ′), with corresponding unprimed objects belonging to an envelopment ( M,/hatwiderM,φ).) 2. Regular abstract boundaries The equivalence relation used in the deﬁnition of the abstract bound ary is as follows. Suppose that we are given boundary sets B, B′of two envelopments ( M,/hatwiderM,φ), (M,/hatwiderM′,φ′), respectively. We say that BcoversB′(B✄B′) if for every open neighbourhood WofBin/hatwiderM, there is an open neighbourhood W′ofB′in/hatwiderM′such that φ◦(φ′)−1(W′∩φ′(M))⊂ W. (1) It is easily seen that B✄B′if and only if “one cannot approach B′from within M without also approaching B”. In a sense, then, this means that Bis “bigger” than B′, and this is the reason for the notation. As an example, let /hatwiderM=/hatwiderM′=Rn, (2) M=Rn\\{0} ≈R×Sn−1, (3) φ= inclusion , (4) φ′(r,Θ) = (r+1,Θ)∈Rn\\{0}. (5) ¶Note that we require all manifolds to have diﬀerentiable structure, but make no demands on gat the moment, beyond continuity; note also that saying that ( M,g) isCkmeans that gisCk, and the atlas ofMis at least Ck+1. 2\nThenp=0∈∂φcoversanysubset of∂φ′. One says that boundary sets BandB′areequivalent ,B∼B′, if they cover each other:B✄B′andB✁B′. Theequivalenceclasscontainingtheboundaryset Bisdenoted [B], and is called an abstract boundary set . If [B] contains a singleton boundary set {p}, then [B] may also be denoted by [ p], and is called an abstract boundary point . The collection of all abstract boundary points constitutes the abstract boundary BMofM; that is, B(M)def=/braceleftBig [p]:p∈∂φMfor some envelopment ( M,/hatwiderM,φ)/bracerightBig . According to this deﬁnition, boundary points and abstract bounda ry points admit quite a rich further classiﬁcation [1], which need not concern us here . Note that the abstract boundary construction is not as developed (or, perhap s, useful!) as such constructions asthe bundle boundary( b-boundary) ofSchmidt [4, 5, 6, 7], theconformal boundary ( c-boundary) of Geroch et al.[8, 9, 5], or even the “ A-boundary” of Clarke [5]. The latter turns out to be very closely related to a certain (“Lips chitz”)regular abstract boundary . We now introduce the rˆ ole of a metric. Let ( M,/hatwiderM,φ) be an envelopment of aCk, k/greaterorequalslant1 pseudo-Riemannian manifold ( M,g). A point p∈∂φ, which has a neighbourhood Upsuchthat /hatwiderMpdef=φ(M)∪Upcanbeendowedwitha Cℓ(some1/lessorequalslantℓ/lessorequalslantk) pseudo-Riemannian metric ˆ gextendingg, i.e.,g=ψ∗ˆg, is called Cℓ-regular. The envelopment may then be referred to as ( M,g,/hatwiderM,ˆg,φ). For regular points we will use both the original setting of the abstra ct boundary [1] just described, andalso adeﬁnition fromearlier, unpublished work o fC. J.S. Clarke and S. M. Scott on deﬁning topologies on the abstract boundary. (Act ually, the authors of [1] mention that their classiﬁcation requires merely an aﬃne connect ion, not necessarily the Levi-Civit` a connection of a pseudo-Riemannian metric.) Deﬁnition 2.1 LetEbe a collection of envelopments and XEdef=∑ φ∈Eφ(M)(a disjoint union) , and deﬁne a relation ∼onXEin the following way: (i)Ifx∈∂φ,y∈∂ψ, then∼is the usual boundary set equivalence. (ii)Ifx=φ(ξ)withξ∈M, theny∼x⇐⇒y=ψ(ξ), someψ∈ E. This is an equivalence relation, and we set ME=XE/∼. Letπbe the projection XE→ME, identify Mwith {[φ(p)]:p∈M, φ∈ E }, and write∂EM(or∂E) forME\\M. We will use the notation φ:M→/hatwiderMφfor envelopments, and for later use will also assume, as is entirely reasonable, that each /hatwiderMφis assumed to have an atlas A/hatwiderMφfor which the “pullback” φ∗A/hatwiderMφis equivalent to the atlas AMonM. (We will impose a further condition on atlases in §4.) 3\nThe key use of the above formalism is that it allows us to vary constru ction of the completion MEas we vary our chosen set of envelopments E. The usual abstract boundary is ∂E0M, whereE0is the collection of allsmooth envelopments φofMinto some smooth manifold /hatwiderMφ. (In order to be absolutely correct mathematically, “all” needs to be qualiﬁed in such a way as to ensure that Eis a set and not a proper class—for instance by working in a category of concretely deﬁned m anifolds.) In the next section we will survey in detail possible candidates for “r egular” maps, metrics etc. in terms of a class Λ of maps between Euclidean spaces. For a given choice of Λ we will denote by Λthe corresponding category of class Λ maps between manifolds (e.g.Λ=Ck), and by Λ( M.N) the set of morphisms of Λfrom manifold Mto manifold N. By, e.g., the categorical statement“ Λ⊂C1” we mean that Λ( M,N)⊂C1(M,N) for allM,Nunder consideration. Armed with a suitable category of maps, then, we make an important set of deﬁnitions, the ﬁrst of which generalises our earlier notion of “regu larity” for Λ/supersetnoteqlC1, but is identical to the earlier notion for Λ=C1. Deﬁnition 2.2 LetΛbe a category of maps as above, and g∈Λ(M,PsRn ν(M))∩Γ(M,PsRn ν(M)) (Γ(B,T)denotes the set of sections B→T) be a given pseudo-Riemannian metric of signature (n,n−ν),i.e., a non-degenerate, symmetric bilinear form at every point o f M. We shall say that gisΛ-extendible about p, wherep∈∂φfor some envelopment φ∈ E0, if the following holds: there is a neighbourhood Upofp(in/hatwiderMφ) and a pseudo- Riemannian metric ˆgponUp,ˆgp∈Λ(Up,PsRn ν(Up)), for whichφ∗ˆgp=g. HerePsRn ν(M) denotes the subbundle of the symmetric tensor product Symm(T∗M⊗T∗M)with ﬁbres consisting of non-degenerate bilinear forms of the appropr iate signature. Now let E[Λ] ={φ∈ E0:∀p∈∂φM, gisΛ-extendible about p}, R[Λ](M) ={[p]∼∈∂E0M:gisΛ-extendible about p,wherep∈∂φ}. We call this a regular abstract boundary . Note that R[Λ] can be identiﬁed, loosely at least, with the abstract boundary ∂E[Λ]Massociated with the collection of all envelopments with “everywhere Λ-regular” boundaries. Onewouldexpectthesetobeusefulabstractboundariesinrelativ itytheories, where we would like to seek properties of allpossible metric extensions (of some class) through a “boundary point”, without using or requiring detailed knowledge of the analytic form of the metric involved. 3. Various regularity classes We mention a few possible choices for our extension classes Λ( ·), although we will only consider the ﬁrst inthis paper. Forclarity we assume that we are sp eaking of Lorentzian metrics. 4\n“Smooth regularity”, Λ = Ck, k/greaterorequalslant1.Such regular abstract boundaries, the ﬁrst to be considered, are the subject of unpublished work by C. J. S. C larke and S. M. Scott. “Existence theorem regularity.” There are several possibilities that suggest themselves immediately here, relying on the existence theorems of [1 0]. These rely on conditions such as the diﬀerence between the metric that we consider and a ﬁxed “asymptotically ﬂat” or “background” metric lying in the Sobo lev space H2.5+ε(Rn−1), ε >0 (the metrics checked are the restrictions of a full space-time metric to hypersurfaces). We could allow extensions such that thr ough any point there is a spacelike hypersurface on which induced data satisﬁes th e conditions; or such that through any point there is a set of space-like hypersurf aces whose normals at the point form an open set and which satisfy the conditions, or su ch that there is a (local or global) foliation satisfying the conditions. “Non-quantum physics regularity.” It could be argued that a fairly robust criterion for pair production to become signiﬁcant within a 3-dimensio nal region of “size”Lwhere the components of the Riemann tensor in a “reasonable” fra me are larger than Ris that R>max(m2c2//planckover2pi12,L−2) the argument being either merely on dimensional grounds, or by req uiring that virtual pairs acquire suﬃcient energy within the region during the He isenberg uncertainty time to become non-virtual. Wewould, then, requireΛtoconsistofmetricsforwhichthisconditio ndidnothold, i.e., those metrics where we might expect Einstein’s theory to describ e “reality” accurately. “Distributional (Cauchy-Schwarz or Colombeau) regularit y.”Here we would, technically, go outside our formalism and allow extensions—and presu mably, although not necessarily, interior metrics also—that were not func tions at all, but either Cauchy-Schwarz (linear) distributions, or Colombeau’s “ generalised functions” (non-linear distributions). To cope with such generality , we would probably have to impose further cnditions on the Levi-Civit` a conne ction components ofthese extended metrics, e.g., square-integrability intheﬁrst case and integrability in the second. Physically, these would describe, respec tively, impulsive gravitationalwaves intheirmostobviousform, and“stringy”spac e-timesadmitting conical singularities. “Geroch–Traschen regularity” [11], Λ =C0∩W1,2 loc(intersection of categories of maps being deﬁned by the intersection of function classes) We call these metrics of Geroch–Traschen type . (and the second.....) deleted Physically, these appear to encompass gravitational wave space- times, though the metric must be transformed so that it is continuous. This “Rose n form” transformation typically destroys at least the C1structure of the manifold in question. We will propose a way to deal with this in a forthcoming public ation 5\nPSfrag replacementspα(Wα∩∂φ(M)) Uα=pα(Wα∩φ(M))(⊃U∗ α)pα(Wα) Figure 1. A typical Lipschitz boundary, on which a pair of proper (inward and outward) cones are shown. (in which we will also allow degenerate metrics, though still requiring sq uare- integrability of Levi-Civit` a connection components). In this paper we consider only the ﬁrst of these items. 4. Lipschitz boundaries In this section we recall some material from [5], in which certain prosc riptions on the nature of an atlas entail that the A-boundary can be constructed. This turns out to be a rather useful boundary construction for later work of Clark e and colleagues on singularity theorems, appearing in the same reference. It amount s to the requirement that the boundary “not wiggle about too much”... LetA={(Wα,pα)}α∈Abe an atlas for an envelopment /hatwiderMφofM, and write Uα=pα(Wα∩φ(M))⊂pα(Wα)⊂Rn. For brevity, we will write U∗ αfor that part of the boundary of the open set Uα, which, speaking somewhat loosely, corresponds to parts of “the boundary of M” which “have two sides” and are “regular” with respect to our chosen gand Λ: U∗ α[g,Λ]def=/braceleftbig x∈pα(∂(φ(M))∩Wα):gis Λ-extendible about ( pα)−1(x)/bracerightbig \\/braceleftbig x∈∂Uα:a neighbourhood of xis contained in Uα/bracerightbig ,(6) See Figure 1. Note that we exclude points of int ¯Uαfrom the deﬁnition of U∗ α. This is because portions of a boundary which are not “Lipschitz hypersurfaces” c annot make up the 6\n“Lipschitz boundaries” that we deﬁne, following [5], in a moment. (In p articular, this excludes higher codimension potential boundaries like the z-axis forM=U=R3\\{z- axis},φ= inclusion.) Finally, we impose a regularity condition on our chosen points Uα. Deﬁnition 4.1 We say that the envelopment /hatwiderMφhas aLipschitz boundary if the following three conditions hold, for each of the charts Wα(the last condition, depending onpairsof charts, is for the beneﬁt of the A-boundary construction a nd will not concern us for the remainder of this work): (Aα)¯Uαis compact in Rn. (Bα) There is a vector ﬁeld kα:Rn→Rn(assumed to be as smooth as the atlases A, Aφ), such that for each x∈U∗ α, we have |kα(x)|= 1and the existence of some δ=δ(x)>0with y∈Uα⇐⇒kα(x)·(y−x)<fx(Pkα(x)(y−x)) if/ba∇dbly−x/ba∇dbl< δ. Here /ba∇dbl·/ba∇dbldenotes the Euclidean norm, fxis some Lipschitz function Rn→R, andPvy;y/mapsto→y−(v·y)vis the orthogonal projection from Rnontov⊥. (Cαβ) Writingψαβdef= =pα◦pβ−1for the transition functions of Aφ,|Dψαβ|is bounded onUα∩Uβ. Note that the choice φ= identity, A=Aφleads to a case of the A-boundary construction, where the subsets U∗ iof∂Uiare taken to be the maximal such subsets through which gis Λ-extendible. (The union of Mwith the A-boundary ¯M\\M constructed in [5] can be exhibited as a ( C0) manifold-with-boundary ¯Mdef=¯M(A)(the details are in the quoted reference).) We shall call this the maximally regular (Clarke) A-boundary construction. We examine condition (B α), the core of the matter, a little more closely. If A:Rn→Rnisanon-singularhomothety(i.e., thecompositionofadilation, transla tion, and rotation) with A∗taking the unit vector kα(x) to (0,...,0,1) andA(x) = 0∈Rn, then this is just the condition that Uα∩B(0,δ) =A−1/braceleftBig z∈Rn:/ba∇dblz/ba∇dbl<δ, zn<ˆfx(z1,...,zn−1)/bracerightBig for some Lipschitz ˆfx:Rn−1→Rwithˆfx(0) = 0. It is clear, then, that this is equivalent to U∗ α∩B(0,δ) =A−1/braceleftBig z∈Rn:/ba∇dblz/ba∇dbl<δ, zn=ˆfx(z1,...,zn−1)/bracerightBig . LetˆKbe a Lipschitz constant for ˆfx; it follows that ∀z∈U∗ α∩B(x,δ(x)),(z−◦C)∩B(x,δ)⊂Uαand (z+◦C)∩B(x,δ)⊂Rn\\¯Uα, where◦Cdef=R>0·[BRn−1(0,1)×{ˆK}] is the interior of a cone. We give these cones z±◦Cnames:z−◦C(or rather, ( ψα)−1( A−1(z−◦C)) ) we call aproper inward cone and that with “+” rather than “ −” aproper outward cone . 7\nProposition 4.1 (Proposition 3.1, [5]) Condition (Bα)of the deﬁnition of a Lipschitz boundary (Deﬁnition 4.1) is equivalent to the exi stence of proper inward and outward cones everywhere near U∗ α. Remark. In the reference quoted there is no reference to (what we call) proper outward cones—but if condition (Bα)holds, there must be a proper outward cone as well as a proper inward cone. The existence of proper inward cones will be used in the next section . First we make a new deﬁnition. Deﬁnition 4.2 Consider the class of envelopments LE[Λ]def={φ∈ E[Λ]:φhas a Lipschitz boundary }, andLR[Λ]def=∂LE[Λ](denoted LR[M,g,Λ]if we want to highlight the manifold Mand metricg), the abstract boundary constructed from this set of envelo pments. We shall call the latter the Lipschitz regular abstract boundary . (Similary we shall call the appropriate equivalence classes Lipschitz regular abstract boundary points , and their representatives Lipschitz regular boundary sets , and so on.) Finally, we shall write LR∗[M,g,Λ]for the class of all equivalents of boundary sets, without any demand that it contain a point as a represen tative. (This makes some discussions slightly easier.) 5. The bundle metric—classical ( C1) case IfΛ⊂C1andg∈C1then there is a (continuous) connection on ( M,g) and the frame bundleLM(structure group GL(n,R)) admits a topological metric d, induced by a C0 Riemannian structure as in [5, Chap. 3], [7] or [6]. The same construction gives a topological metric ˆdponL(φ(M)∪Up) (p∈∂φ), resulting from the (continuous) Levi-Civit` a connection of ˆ gp. However, there are at least two potential problems with this. Firstly, the metric in the frame bundle depends on the boundary poin t:ˆdpdepends on the point p. This, however, will not prove to be a problem when we come to the cr ux of the matter, Theorem 5.2, but we must keep the subscript pin mind! Secondly, we have the following matter which rather complicates our procedings. For points x,y∈φ(M), we certainly have ˆdp(˜x,˜y)/lessorequalslantd(˜x,˜y) (tildes denoting points of ﬁbres as usual)—loosely, ˆdp/lessorequalslantd—but we may have ˆdp(˜x,˜y)< d(˜x,˜y). This is evident from Figure 2 (take ˆ gpto be ﬂat). Unfortunately, in a crucial argument below (Theorem 5.2) we will want to have ˆdp(˜xi,˜yi)→0⇒d(˜xi,˜yi)→0. The inequality “goes the wrong way”! 8\nPSfrag replacementsx/hatwiderM Uy φ(M) Figure 2. ˆd(˜x,˜y)< d(˜x,˜y) because there is a curve from xtoyin/hatwiderMφof strictly shorter g.a.p. length than any in φ(M). 5.1. Using Lipschitz boundaries to imbed the Cauchy complet ionLMinL/hatwiderM It is quite suﬃcient for our needs, however, to have a mere bound “ φ∗d/lessorequalslantconstant×ˆdp”, in a small neighbourhood of each point of the boundary. We will call int o play the Lipschitz condition imposed on the boundary in the last section. B ut ﬁrst, a technical (but straightforward) lemma. A sketched proof only will be given—the reader unsatisﬁed with this is invited to turn to the more rigourous, and gen eral, treatment of a forthcoming paper. For now, though, note that we require that Λ⊂C1. Lemma 5.1 Letgbe aC1pseudo-Riemannian metric on Rn. Then, given a chart (/tildewideU,/tildewideϕ), a pointy∈/tildewideU, and any positive ε>0, we can ﬁnd a small neighbourhood U⊂/tildewideU ofyin which |ℓ1(γ)−ℓ2(γ)|<εfor all curves γ: [0,1]→Uwhose images under /tildewideϕare straight lines. Here ℓ1(γ) =k×∫text γ/ba∇dblω(˙γ)/ba∇dbl,ω={wa}being a parallel frame along γ, is a g.a.p. length, kis a constant depending only on the frame at γ(0), andℓ2(γ) =∫text γ/ba∇dbl˙γ/ba∇dbl denotes Euclidean length. Proof sketch. Giveny, we can choose Uso small that supx∈U,i,j|gij((x)−ηij|and supx∈U,i,j,k|gij,k((x)|are as small as desired (i.e., gis close to a pseudo-Euclidean metric in theC1strong Stiefel-Whitney topology [12]), so the Christoﬀel symbols of the metric gare as small as desired. We use the usual continuous dependance o f the solutions of a (C1) diﬀerential equation on its parameters (see, e.g., Theorem IV.2.1 o f [13]), here specifying our curve by means of two extra parameters, nam ely its endpoints. The solution parallelly transported vector ﬁeld depends continuous ly on the (small) 9\nChristoﬀel symbols of g, so the solution is close to that for a ﬂat metric, so for a short curveγ, /ba∇dblω(˙γ)/ba∇dbl ≈c× /ba∇dbl˙γ/ba∇dbl wherecdepends only on ωγ(0). (Of course it depends on the metric g, but this is ﬁxed once and for all.) This “closeness” is uniform for “endpoint para meters” in some neighbourhood U⊂Rn×Rnof the origin, by the continuous dependence cited. We get the result. Theorem 5.2 Consider an envelopment φ∈ E[Λ],Λ⊂C1, with a Lipschitz boundary, whereg∈C1. Letp∈∂φ. There is a neighbourhood Uofp(in/hatwiderMφ) such that we cannot have sequences {˜xi},{˜yi}ofLM, lying over points of U, for which ˆdp(φ∗˜xi,φ∗˜yi)i→∞−→0while d(˜xi,˜yi)is bounded away from zero. Proof.Assume given sequences {˜xi},{˜yi}ofLMfor which ˆdp(φ∗˜xi,φ∗˜yi)i→∞−→0. We require to show that d(˜xi,˜yi)i→∞−→0. By choosing a subsequence if necessary, we can assume that φ(xi)→ˆx∈/hatwiderM, and hence that φ(yi)→ˆx. From Proposition 4.1, if necessary by excluding a ﬁnite initial part of the sequence and app lying a ﬁxed homothety, we can ensure that there are inward cones of the for mwi−◦C,zi−◦C, where in the coordinate chart ( Uα,pα) thus ﬁxed we write wi=pα(φ(xi)) andzi=pα(φ(yi)). Recall that Kis the Lipshitz constant in the deﬁnition of◦C. Let Π : Rn→Rn−1be the projection onto the ﬁrst n−1 coordinates, and let edenote Euclidean distance in the coordinate system now chosen. Set eidef=e(wi,zi) Σidef=Rn−1×{wn i−(K+1)ei} Pidef= Π((wi−◦C)∩Σi) Qidef= Π((zi−◦C)∩Σi) Thenpα(ˆx),zi,wiare on the same side of the hyperplane Σ i,Piis a ball of radius (1+1/K)eiandcentrew∗ idef= Π(wi), whileQiisaballofradius(( K+1)ei+zn i−wn i)/K/greaterorequalslant eiand centrez∗ idef= Π(zi). Since|w∗ i−z∗ i|/lessorequalslantei, these balls have a non-empty intersection containng some point f∗ i= Π(fi), say, where fidef=(f∗ i,wn i−(K+ 1)ei). Hence from Lemma 5.1 d(˜xi,˜yi)/lessorequalslantconst×(e(wi,fi)+e(fi,zi)/lessorequalslant(2K+5)ei. But from Lemma 5.1 again, the far right hand side tends to zero, and so the result is proved. Another, perhaps more satisfying, way of stating this result is as a n “imbedding theorem”. (We use “imbedding” rather than “embedding” as a mnem onic for “injection”—there is no topological content to the stament.) 10\nCorollary 5.3 Letφ∈ E[Λ]have a Lipschitz boundary. For any boundary point p∈∂φ, the map LM→L/hatwiderMp: lim i→∞(xi,Ei)/mapsto→lim i→∞(φ(xi),φ∗Ei) is one-one, i.e., it is an imbedding. 6. Application to regular abstract boundaries We see that we can neither “coalesce” two regular boundary points into one without destroying the Lipschitz nature of the boundary near the points; similarly we cannot “tear” one Lipschitz regular boundary point into two: Theorem 6.1 LetΛ⊂C1andg∈C1. A(regular)boundary set B⊂∂φ,φ∈ E[Λ], of more than one point cannot be covered by a single (Lipschitz regular )pointq∈∂ψ, ψ∈ LE[Λ]. Proof.Letpi,i= 1,2, be distinct points of B, assumed to be both covered by a single boundary point q∈∂ψ. We ﬁrst deal with the ﬁrst of the ‘potential problems’ mentioned just before §5.1. Of course we can construct a single(C1)coordinate chart(U,τ) containing the two points, using the tubular neighbourhood theor em and aC1curve connecting the two points (the latter existing by connected ness ofM). Since both these points are C1regular boundary points, then we may assume that Up1∩Up2=∅(c.f. Deﬁnition 2.2), and thus that there is a simultaneous extension of g to/hatwiderMp1,p2def=φ(M)∪Up1∪Up2. We may then construct the bundle metric ˆdp1,p2as we did earlier when considering extensions about a singlepoint. (The astute reader will have noted that a version of Theorem 5.2 using this new bundle metric will no t be possible in general, for we cannot now shrink our neighbourhood to make “ gij≈ηij”. Fortunately, we only need to use Theorem 5.2 about the single (regular) point q. As a consequence of thiswe do not need the boundary ∂φto be Lipschitz, but only the boundary ∂ψabout the single point q.) Let{xi,j}∞ j=1besequences ofpoints of Mfor whichφ(xi,j)j→∞−→pi, and ˜xi,jbepoints of the ﬁbres over φ(xi,j) inL/hatwiderMφ. We shall write ˜ xk,jdef=(φ(xk,j),Ek,j),k= 1,2. Note that, as yet, we have said nothing about the ﬁbre elements Ek,j,k= 1,2. Nowψ(xi,j), i= 1,2, both converge to the covering point q. We can choose the ﬁbre components of the ˜ xi,jso that these sequences also converge to the same point ˜q∈L/hatwiderMψ. This means that ˆdq-distance between the relevant points tends to zero, so by Theorem 5.2 we must have d(˜x1,j,˜x2,j)j→∞−→0. Butˆdp1,p2(˜p1,˜p2) = 2R>0, soˆdp1,p2(˜x1,j,˜x2,j)>Rfor largej. Since “ ˆdp1,p2/lessorequalslantd”, d(˜x1,j,˜x2,j)>R>0 for all large enough j, in contradiction. 11\nWe arrive at a result sitting well with intuition. Corollary 6.2 LetΛ⊂C1andg∈C1. Lipschitz regularity of boundary sets means that they “cannot be blown up further” without destroying re gularity. To be more precise, consider two regular boundary sets B1⊂∂φ,B2⊂∂ψof envelopments φ,ψ∈ E[Λ]. Assume that the ﬁrst envelopment φhas a Lipschitz boundary. Then no point of B1can covermore than one point of B2. If both envelopments have Lipschitz boundaries and B1∼B2, then each point of B1 isequivalent to precisely one point of B2. Proof.Letp∈B1, and letQdef={q∈B2:ifq= limjψ(xj),thenp= limjφ(xj)}. ThenQis either empty, in which case pcovers no subset of B2, or is the maximal subset ofB2covered by p. In the latter case we apply Theorem 6.1, to get that Qmust be a singleton. Thus no point of B1can cover more than one point of B2. For the second part, note that by symmetry, the reverse of this statement is true, and the result follows. The following lemma, although perhaps rather useless in other situat ions, does not per sedepend on the Lipschitz, regular nature of the boundary sets to w hich we will apply it. Lemma 6.3 IfB1∼B2and the function p/mapsto→Qof Corollary 6.2 is singleton-valued (in which case we say p/mapsto→q, ifQ={q}), and indeed maps each pto an equivalent q, thenB1→B2:p/mapsto→qis continuous. Proof.If not, then there is an open neighbourhood Vofq∈B2such that there is no neighbourhood Uofpall of whose boundary points correspond to points of V. If there are small enough neighbourhoods Uintersecting B1only atp, then we get a trivial contradiction. So there is a sequence of boundary points pi∈B1, equivalent to pointsoutsideV, which converge to p. Butqcoversp, so there is a sub-neighbourhood U′ofUsuch thatψ◦φ−1(U′∩ φ(M))⊂V.Allsequences of points {xi j}j⊂φ−1(U′∩φ(M)), with respective images underφconverging in jto the respective pi∈B1, must have images under ψwhich convergetopointsoutsideof V. However, the“diagonal”sequence {xi i}ihasφ(xi i)i→∞−→p, and soψ(xi i)i→∞−→q, in contradiction since /hatwiderMψ\\Vis closed. By symmetry, we have the following. Theorem 6.4 (Characterization of Lipschitz regular abstra ct boundary, smooth case) IfMis a diﬀerentiable manifold and g∈Λ⊂C1, then all representatives of an equivalence class of Lipschitz regul ar boundary sets [B]∈ LR∗[M,g,Λ]are homeomorphic. That is, “the” topology of an equivalence class of boundary sets is independent of the particular envelopment used to deﬁne it, if all envelopments considered have Lipschitz, regular boundari es. 12\nNote that this means that every representative of a Lipschitz C1-regular abstract boundary point [ p]∈ LR[M,g,Λ] is itself a point. Of course, the nature of a Lipschitz boundary forces the original point pto be a point of an ( n−1)-dimensional boundary hypersurface. As was alluded to earlier, it says that any envelopme nt of the space-time in which our original point is “blown up” to be represented by anything other than a single point destroys C1regularity of at least part of the new representative, whether this new boundary is Lipschitz or not . This gives us a rather complete characterisation of those sections of boundaries of (e.g.) space-times through which the metric can be extended in a smo oth (C1) fashion. We are on ﬁrm mathematical , if not physical, ground when we suggest that each point of a Lipschitz of boundary of a space-time through which the metric can be extended smoothly, has something to distinguish it from all others. It is a natural question to ask whether the same (or a similar) chara cterisation is valid when we relax the smoothness assumption somewhat, allowing, e .g., gravitational shock waves. After all, we would certainly hope that the presence o f gravitationl waves in the space-time and extension thereof cannot “distort” the bou ndary so that the topological type of a portion of “boundary hypersurface”, thro ugh which extension is possible, could depend on the precise way in which the extension is per formed. Since boundaries are of physical interest precisely in situations of c ollapse, where stronggravitationalﬁeldsareliabletogenerateshock-andimpulse -waves, itisimportant to be able to relax as far as possible the smoothness assumptions in t his work. It would be a problem indeed for our regular abstract boundaries if it turned out that “non- smooth perturbations” of a smooth metric could result in a space-t ime where, unlike the smooth case, the topological type of a portion of “regular bou ndary hypersurface” could depend on the precise way in which the extension is performed. In a forthcoming paper we will extend our results in this direction. Acknowledgements CJF would like to thank the School of Mathematical Sciences at theA ustralian National University, particularly Profs. Derek W. Robinson and Neil S. Trudin ger, for sending him to Southampton, where most of this collaboration was undertak en. He also thanks Drs. Marcus Kriele and Giselle C. Lim for their generous and invaluable in put. References [1] Scott S M and Szekeres P 1994 J. Geom. Phys. 13223–253. [2] Fama C J and Scott S M. 1995 Proc. AMS-CMS special session on Geometric Methods in Mathematical Physics (American Mathematical Society) pp 79–111. [3] O’Neill B 1983 Semi-Riemannian geometry: with applications to relativit y, (Pure and applied mathematics vol 103) (New York: Academic Press). [4] Schmidt B G. 1971 Gen. Rel. Grav. 1269–280. [5] Clarke C J S 1993 The analysis of space-time singularities Cambridge lecture notes in physics vol 1 (Cambridge University Press). 13\n[6] Dodson C T J 1978 Int.. J. Theoret. Phys. 17389–504. [7] Dodson C T J 1980 Categories, Bundles and Spacetime Topology , Shiva Mathematics Series vol 1 (Shiva Publishing Ltd.). [8] Geroch R, Kronheimer E H, and Penrose R 1972 Ideal points in spa ce-time.Proc. R. Soc. London Ser. A327545–567. [9] Beem J K and Ehrlich P E 1981 Global Lorentzian geometry , Pure and applied mathematics vol 67 (New York: M. Dekker). [10] Hughes T J R, Kato T , and Marsden J E 1976 Arch. Rational Mech. Anal. ,63(3)273–294. [11] Geroch R and Traschen J 1987 Phys. Rev. D . [12] Hirsch M W 1976 Diﬀerential topology , Graduate texts in mathematics vol 33 (Springer-Verl¨ ag). [13] Hartman P 1964 Ordinary Diﬀerential Equations (John Wiley and Sons, Inc.). 14\n",
  "metadata": {
    "paper_id": "gr-qc/9806072v1",
    "downloaded_at": "2025-08-24T20:30:32.338229+00:00"
  },
  "processed_at": "2025-08-24T20:30:32.338270+00:00"
}