{
  "content": "arXiv:gr-qc/0610093v1 18 Oct 2006Magnetovac Cylinder to Magnetovac Torus E.N. Glass Department of Physics, University of Michigan, Ann Arbor, M I 48109 (Dated: 10 August 2006) A method for mapping known cylindrical magnetovac solution s to solutions in torus coordinates is developed. Identiﬁcation of the cylin der ends changes topology fromR1×S1toS1×S1. An analytic Einstein-Maxwell solution for a toroidal mag- netic ﬁeld in tori is presented. The toroidal interior is mat ched to an asymptotically ﬂat vacuum exterior, connected by an Israel boundary layer. PACS numbers: 04.20.Jb, 04.40.Dg, 04.40.Nr I. INTRODUCTION Magnetic ﬁelds can be found in many astrophysical conﬁgurations. Both poloidal and toroidal ﬁelds can model the observed dipolar ﬁelds in magnetic white dwarfs [1]. The radius of a nonrotating white dwarf can change signiﬁcantly [2] when a magn etic ﬁeld is frozen-in. The equilibrium conﬁguration of magnetized stars with both poloidal a nd toroidal magnetic ﬁelds has been studied for some time [3]. It is known that toroidal /vectorBﬁelds deform neutron stars and it has been shown [4] this deformation acts as a source o f gravitational radiation. Because of the general interest in astrophysical magnetic ﬁelds, this work provides a method for mapping known cylindrical magnetovac solutions to magn etovac solutions in nested tori. The cylindrical solution used as an example has an axially s ymmetric magnetic ﬁeld which is mapped to tori with a toroidal magnetic ﬁeld. The cylinder solution is un- bounded in distance from the cylinder axis. It is straight forward to map a portion of this solution to a set of tori. If we conclude the map with an unbounded se t of tori, nothing further is required. But if the torus solution is matched to an exter ior vacuum at a ﬁnite boundary, then the metric and extrinsic curvatures, as well as th e magnetic ﬁeld must also satisfy boundary conditions. The magnetic ﬁeld requires a surface current density, which must reside in an Israel boundary layer [6]. We construct such a lay er between the magnetic tori and the exterior vacuum.\n2 The new solution has four distinct regions. The innermost region is a s ingular loop whose time history is a singular cylinder. The next region extends fro m the singularity to the vacuum boundary. This second region contains a toroidal ma gnetic ﬁeld in nested tori. At the vacuum boundary there is a third region of zero thickne ss with a delta function current density supported by an Israel layer. The fourth region is an asymptotically ﬂat vacuum. The next section discusses the map from cylinders to tori and gives details of the mag- netovac cylinder solution. The cylinder solution has a singular z axis. T his is mapped to a singularcylinder intoruscoordinates. SectionIIIgivesanewsolutio nforatoroidalmagnetic ﬁeld in torus coordinates. It is shown that the Rainich conditions for an Einstein-Maxwell solution are satisﬁed. In section IV the boundary and extrinsic cur vatures are presented. SectionVtreatsthemagneticﬁeldjunctionconditions, thebounda rycurrent, andthestress- energy content of the Israel layer. In section VI the electromag netic energy, Komar mass, and sectional curvature mass are computed. The sectional curv ature mass deﬁnition has been extended from spheres to include tori. We show that the magn etic energy subtracts quasilocally from the sectional curvature mass. Section VII prese nts the complete metric and its asymptotic and inner regions. The vacuum region is asymptot ically ﬂat and can be compactiﬁed. We close with a Summary. Details are collected in four ap pendices: Appendix A discusses Euclidean torus coordinates. We use coordinates ( r,α,β);rlabels successive tori and ( α,β) are coordinates on a single torus [5]. Appendix B analyzes geodesics in the plane surrounding the singular region by examining timelike geodesics p aths in an eﬀective potential. Appendix C covers torus null tetrad quantities. Append ix D lists electromagnetic ﬁeld equations and the Rainich conditions. Conventions Riemann and Ricci sign conventions are 2 Aν;[αβ]=AµRµ ναβ,andRαβ=Rν αβν.The metric signature is (+,-,-,-) and the ﬁeld equations are Gµν=−8πTµν. We use units such thatG=c= 1. Magnetic ﬁeld terminology In cylindrical or spherical coordinate systems, magnetic ﬁeld /vectorBhas orthogonal toroidal andpoloidalcomponents. A component is toroidalif it is everywhere orthogonal to merid- ional planes through the cylinder axis or planes through the spheric al poles. If /vectorBhas axial symmetry, toroidal ﬁeld lines are circles about the cylinder axis or sp herical circles of lon-\n3 gitude. A component lying totally in meridional planes is poloidal, and is orthogonal to the toroidal component. II. CYLINDER TO TORUS A torus is the only compact, oriented, Euler number zero, 2-dimens ional surface. A cylinder can be made into a torus by joining its ends. The cylindrical 3-metric is d˜r2+˜r2dϕ2+dz2, and this is mapped to torus coordinates as dr2+r2dβ2+ℜ2dα2. (Detailsof torus coordinates aregiven inAppendix A.) Cylindrical ˜ r→ torusr, and cylindrical ϕ→torusβ. For the cylinder ends, dz=ℜdα. Since−∞< z <∞, and 0≤α≤2π, the cylinder is wrapped to a torus. This identiﬁcation takes R1×S1to S1×S1. The cylinder zaxis corresponds to ℜ=r0+rcosβ= 0. Because of torus topology, ﬂat metric dt2−(dr2+r2dβ2+ℜ2dα2) is not the Minkowksi metric. Cylinder Solution The cylindrical metric we consider (Eq.22.11, m= 2, inExact Solutions [7]) is gcyl µνdxµdxν= ˜r4(F/b0)2(dt2−d˜r2)−˜r−2(F/b0)2dϕ2−˜r4(b0/F)2dz2, (1) withF(˜r) = 1 +b2 0˜r4. This solution satisﬁes the Einstein-Maxwell ﬁeld equations and has an axially symmetric magnetic ﬁeld along the zaxis. The Kretschmann scalar is RαβµνRαβµν= 64b4 0(3+12b2 0˜r4+62b4 0˜r8−108b6 0˜r12+63b8 0˜r16) ˜r12F8. Metricgcylhas a singularity along the zaxis, ˜r= 0, where the Kretschmann scalar becomes inﬁnite. The Ricci tensor has components t,˜r,ϕ,z Rα β= 16b4 0 ˜r2F4 1 −1 1 −1 . (2) The magnetic ﬁeld is Bµdxµ= 4b2 0 ˜r2Fdϕ (3)\n4 with electromagnetic invariants 1 2FµνFµν= 16b4 0 ˜r2F4 1 2FµνF∗ µν= 0. The metric and magnetic ﬁeld can be mapped, locally, to a diﬀerent met ric and magnetic ﬁeld in a frame of nested tori. After the transform, the resulting m etric isgtorgiven in Eq.(4). III. TORUS SOLUTION The toroidal magnetic metric is, with a map of cylinder cordinates {˜r,z,ϕ}to torus coordinates {r,α,β}, and with ℜ=r0+rcosβand̥= 1+b2 0ℜ4, gtor µνdxµdxν=̥2ℜ4dt2−ℜ4(̥2cos2β+̥−2sin2β)dr2−̥2ℜ−2dα2(4) +ℜ4(̥2−̥−2)rcosβsinβ2drdβ−ℜ4(̥2sin2β+̥−2cos2β)r2dβ2 with volume element (rℜ5̥2)dt∧dr∧dα∧dβ. (5) Note that if parameter p0is introduced by ̥→̥/p0in metric gtor, just as parameter b0 appears in the cylinder metric, then the Ricci and Riemann tensors a re multiplied by p2 0. The limit p0→0 takesgtorto ﬂatness (but not to the Minkowski metric). TheKretschmann scalar for gtorisRαβµνRαβµν∼1/ℜ12. The singularity of gcylismapped to a singular loop, ℜ= 0, at the center of the torus solution. The spacetime history of t he loop is a cylinder. Killing symmetries are static ∂tand axial ∂α. Constant time hypersurfaces for static gtor have unit vector ˆtµ tor∂µ=̥−1ℜ−2∂t. (6) In torus coordinates, the Ricci tensor has components ( t,r,α,β) Rµ ν= 16b2 0 ℜ2̥4 1 −1 1 −1 . (7)\n5 Static metrics have the timelike Killing vector as an eigenvector of the Ricci tensor. For gtor we ﬁnd Rµ νδν (t)=(g 16b2 0 ℜ2̥4)g δµ (t) with eigenvalue twice the magnetic energy density. The metric is expanded in a null basis, gtor µν=lµnν+nµlν−mµ¯mν−¯mµmν(see Appendix B). The only non-zero Ricci component is Φ11= 8b2 0ℜ−2̥−4. (8) With Ricci tensor Rtor µν=−2Φ11(lµnν+nµlν+mµ¯mν+ ¯mµmν) (9) the Ricci ”square” is Rµ αRα ν= 4(Φ 11)2gµ ν, and with Φ 11in Eq.(8) this becomes RµνRµν=(g 32b2 0 ℜ2̥4)g2 . (10) Equation (10) shows the Ricci ”square” satisﬁes Rainich condition ( D14b). The vacuum limit, b0→0, is gtor-vac µνdxµdxν=ℜ4dt2−ℜ4dr2−ℜ−2dα2−r2ℜ4dβ2. (11) gtor-vachas zero Ricci tensor and non-zero Riemann tensor. ( RαβµνRαβµν)tor-vac= 192/ℜ12. Electromagnetic Field The vector potential for the Maxwell ﬁeld is Ator µdxµ=b0ℜ4 ̥(sinβ dr+rcosβ dβ), (12) with Ftor µν= 4b0(rℜ3 ̥2)/bracketleftbig δ(r) µδ(β) ν−δ(β) µδ(r) ν/bracketrightbig . (13) There is no electric ﬁeld since Ftor µνhas no time component and there is no current since ∇νFµν tor= 0. The dual Maxwell ﬁeld is F∗ µν= 2b0/bracketleftbig δ(α) µδ(t) ν−δ(t) µδ(α) ν/bracketrightbig . (14)\n6 The local magnetic ﬁeld Btor µ=F∗ µνˆtν tor, which satisﬁes ∇µBµ= 0, is Btor µdxµ= 4b0 ℜ2̥dα, Btor µBµ tor=−16b2 0 ℜ2̥4. (15) The magnetic ﬁeld lines are toroidal, i.e. Bµ toris everywhere orthogonal to meridional ( r,β) planes through the ˆ αaxis. The non-zero Maxwell null tetrad component is φ1=i(2√ 2b0)ℜ−1̥−2(16) The relation Φ ab=φa¯φbbetween the Ricci Φ aband the Maxwell φamust be satisﬁed, and such is the case for the solution given here. This is seen explicitly since φ1¯φ1= Φ11given in Eq.(8). The Maxwell invariants are Itor 1=1 2FµνFµν=−(φ2 1+¯φ2 1) = 16b2 0 ℜ2̥4. (17) Itor 2=1 2FµνF∗ µν= 0. The Weyl tensor vanishes on a particular torus. From Eqs.(C4) all W eyl components are zero atℜ4 B= 1/b2 0, providing an eﬀective ”magnetic range”. IV. INTERIOR-EXTERIOR METRIC AND EXTRINSIC CURVATURE A. Boundary One can match interior metric gtorto exterior metric gtor-vac. The boundary surface is located at r=rb=const. The metric match is straight forward since gtor-vacisgtorwithb0= 0. The second junction condition requires extrinsic curvatures to match at rb.ˆNµis the unit normal at rb,ˆNµˆNµ= −1,ˆNµdxµ=Ndr, N=ℜ2̥[1+b2 0ℜ4sin2β(1+̥)(1+̥2)]−1/2, Nvac=ℜ2. (18) The extrinsic curvature, Kµν, is the projected covariant derivative Ktor µν=ˆNρ;σ⊥ρ µ⊥σ ν. (19) where⊥ρ µ=gρ µ+ˆNρˆNµprojects into the boundary.\n7 B. Interior Atr=rb,Ktor µν, withℜb=r0+rbcosβand̥b= 1+b2 0ℜ4 b, has components Ktor (t)(t)=−2Nbcosβ(1+3b2 0ℜ4 b) ℜb̥b, (20a) Ktor (α)(α)=−Nbcosβ(1−3b2 0ℜ4 b) ℜ7 b̥b, (20b) Ktor (β)(β)=Nbr2 bWb ℜb̥5 b. (20c) Nb=ℜ2 b̥b[1+b2 0ℜ4 bsin2β(1+̥b)(1+̥2 b)]−1/2 Wb= 3ℜb/rb−2r0/rb+b2 0ℜ4 b(3ℜb/rb+2r0/rb)−2b4 0ℜ8 b(4cos3β+9cosβ−5r0/rb) −(b6 0+b10 0)ℜ4 b(10ℜ5 b/rb−28ℜ4 bcosβsin2β−3ℜb/rb−2r0/rb) +2b8 0ℜ8 b(5ℜb/rb−14cosβsin2β). Relevant gµν torcomponents are g(t)(t) tor=ℜ−4̥−2, g(α)(α) tor=−ℜ2̥−2, g(β)(β) tor=−r−2ℜ−4(̥4sin2β+cos2β)−1. The trace of Ktor µνis Ktor=−Nb ℜ5 b̥3 b[2cosβ(1+3b2 0ℜ4 b)−cosβ(1−3b2 0ℜ4 b)+Wb ̥2 b(̥4 bsin2β+cos2β)].(21) C. Exterior Ktor-vac µνhas components Ktor-vac (t)(t)=−2ℜbcosβ, Ktor-vac (α)(α)=−cosβ/ℜ5 b, Ktor-vac (β)(β)=rbℜb(3ℜb−2r0).(22) Relevant gµν tor-vaccomponents are g(t)(t) tor-vac=ℜ−4, g(α)(α) tor-vac=−ℜ2, g(β)(β) tor-vac=−r−2ℜ−4. The trace of Ktor-vac µνis Ktor-vac=−1 ℜ3 b(cosβ+3ℜb/rb−2r0/rb). (23)\n8 V. MAGNETIC FIELD MATCH With unit normal ˆN, the magnetic ﬁeld at the boundary requires (/vectorBtor·ˆN)b= (/vectorBvac·ˆNvac)b. (24) This condition is satisﬁed since the normal components are zero on b oth sides of the bound- ary. The tangential component must obey (/vectorBtor×ˆN)b=−/vectorJs (25) where/vectorJsis a surface current density. The jump in tangential component (n on-zero to zero) requires an Israel surface layer to support /vectorJs. Israel Layer If the extrinsic curvatures do not match at the boundary, an Isr ael boundary layer is created. The stress-energy content of the Israel layer is cons tructed from the mismatch in the curvatures. The stress-energy of the boundary layer is [8] −8πSµ ν= [Kµ ν]−[K]⊥µ ν. (26) HereK=Kµ µ, and [K] :=Kexterior−Kinteriordenotes the jump of K(for any tensorial quantity deﬁned on both sides of the boundary). The non-zero co mponents of the stress- energy are S(t) (t),S(α) (α), andS(β) (β). We ﬁnd [S(t) (t)] =−1 ℜ5 b̥3 b[ℜ2 b̥3 b(cosβ+2r0/rb−3ℜb/rb)+NbWb ̥4 bsin2β+cos2β(27a) −Nbcosβ(1−3b2 0ℜ4 b)] [S(α) (α)] =1 ℜ5 b̥3 b[ℜ2 b̥3 b(2cosβ+3ℜb/rb−2r0/rb)−NbWb ̥4 bsin2β+cos2β(27b) −2Nbcosβ(1+3b2 0ℜ4 b)] [S(β) (β)] =cosβ ℜ5 b̥3 b/bracketleftbig ℜ2 b̥3 b−Nb(1+9b2 0ℜ4 b)/bracketrightbig (27c) When the magnetic ﬁeld is set to zero, i.e. b2 0→0, all jumps vanish. A graph of S(t) (t)for weak magnetic ﬁeld, with ̥2 b∼1, is bell-shaped and peaked at (β) =π. (Fig. 1) With large magnetic ﬁeld, ̥2 b∼b4 0ℜ8 b,the graph has two bell-shaped\n9 peaks at ( β) =π/2,3π/2 falling to zero at ( β) =π. (Fig. 2) The other components have similar graphs. The stress-energy is peaked at the ”top, π/2” and ”bottom, 3 π/2” of a given torus. Since magnetic energy subtracts quasilocally from mass ene rgy, the stress-energy is greater at top and bottom to maintain the torus shape. With no mag netic energy, the stress-energy is a maximum at the innermost point, ( β) =π, to balance mass attraction. 0.0090.00950.010.01050.011 0 1 2 3 4 5 6 beta FIG. 1:r0/rb= 10. Weak magnetic ﬁeld with F2 b∼1. Vertical scale adusted to graph. 020406080100 1 2 3 4 5 6 beta FIG. 2: Large magnetic ﬁeld. F2 b∼b4 0ℜ8 b. Vertical scale adjusted to graph with b0= 1.\n10 In the outer equatorial plane, with cos β= 1, [S(t) (t)]≃b2 0(1+r0/rb)(rb−4r0)+O(rb5), (28a) [S(α) (α)]≃ −2b2 0(1+r0/rb)(rb−2r0)+O(rb2), (28b) [S(β) (β)]≃ −b2 0(1+r0/rb)+O(rb5). (28c) Poisson [8] expresses the complete energy-momentum tensor as Tµν= Θ(l)Texterior µν+Θ(−l)Tinterior µν+δ(l)Sµν. In this work Texterior µν= 0 forgtor-vacandTinterior µν=Ttor µνforgtor. Θ is the Heaviside step function and δ(l) is a Dirac distribution of shell width l. We have Tµν= Θ(r−rb)Ttor µν+δ(r−rb)Sµν. The conservation equation for Sµ ν, its covariant divergence, expresses the jump in Ttor µν components at the boundary. To ﬁnd the surface current densit y, we write the ﬁeld tensor at the boundary Fµν interior= Θ(r−rb)Fµν tor where Fµν tor= (4b0 rℜ5̥2)[δµ (r)δν (β)−δµ (β)δν (r)]. ∇νFµν interior= 4πJµ s=δ(r−rb)Fµ(r) tor.With/vectorJsfrom Eq.(25) the current is 4πJµ s∂µ=δ(r−rb)(4b0 rbℜ5 b̥2 b)∂β. (29) Any one of the current lines is an α=constcircle around the torus. Together, the circles form a surface current on the bounding torus. The graph of one of the current lines, Jsvs (β), is bell-shaped and peaked at ( β) =π. For weak magnetic ﬁeld, with ̥2 b∼1, the shape is dominated by ℜ−5 b∼(r0/rb+cosβ)−5. The curve narrows and the peak rises as rb→r0, while the volume containing the magnetic ﬁeld shrinks, with a spike as the volume nears zero. With large magnet ic ﬁeld,̥2 b∼b4 0ℜ8 b, the current goes as ℜ−13 b. The curve shape is the same, with smaller magnitude.\n11 020000400006000080000100000 1 2 3 4 5 6 beta FIG. 3:Jsvs (β).F2 b∼1, r0/rb= 1.1 Vertical scale adjusted to graph. VI. MASS AND ENERGY A. Magnetic energy The electromagnetic energy follows from integrating the magnetic e nergy density, u, over t=consthypersurfaces within 3-volume√−gd3x=rℜ5̥2dαdβdr u=−1 2BµBµ = 8b2 0/(ℜ2̥4). The toroidal energy is Utor(r) = 2b2 0r∫display r02π∫display 0r′(r0+r′cosβ)3 [1+b2 0(r0+r′cosβ)4]2dβdr′. Termwise integration provides Utor(r) =/bracketleftbiggb2 0r3 0 (1+b2 0r4 0)2/bracketrightbigg (r−r0)2+O(r−r0)3(30) B. Komar mass The Komar superpotential, with Killing vector kµ, is Uµν komar=√−g(∇µkν−∇νkµ), (31)\n12 Forkµ=δµ (t)we ﬁnd Uµν komar=b2 0ℜ2 ̥/bracketleftBig rcosβ(δµ (t)δν (r)−δν (t)δµ (r))−sinβ(δµ (t)δν (β)−δν (t)δµ (β))/bracketrightBig . The Komar mass is expressed by M(∂t) =1 8π/contintegraldisplay Uµν komardSµν. (32) The mass integral, for t=const,r=const2-surfaces with dSµν= 2(t,µr,ν−t,νr,µ)dαdβ, is Mtor(r) = 4r2π∫display 0cosβ/bracketleftbigg1+3b2 0(r0+rcosβ)4 1+b2 0(r0+rcosβ)4/bracketrightbigg dβ Integrating termwise provides the toroidal quasi-local mass Mtor(r) =/bracketleftbigg32πb2 0r3 0 (1+b2 0r4 0)2/bracketrightbigg r2+O(r3). (33) The mass expansion is ﬁnite since vacuum starts at r=rb. C. Sectional Curvature mass Spherical ﬂuids, with 2-metric r2(dϑ2+sin2ϑdϕ2), have a well-deﬁned sectional curvature mass given by −2msph(r) =r3Rµνρσˆϑµˆϕνˆϑρˆϕσ where the Riemann tensor is weighted by r3because of spherical geometry. The Reissner- Nordstr¨ om solution (Schwarzschild mass m0, chargeq) has sectional curvature mass 2mrn(r) = 2m0−q2/r. (34) The electrostatic ﬁeld energy due to charge qhas a negative quasilocal contribution. One can extend this notion to energy in tori. Vectors αµandβµspanr=consttori and are surface-forming, i.e. βναµ ;ν−ανβµ ;ν=aαµ+bβµ. We deﬁne the torus sectional curvature mass as −2mtor(r) = [ℜ6Rµνρσˆαµˆβνˆαρˆβσ](β)=0 (35) with the Riemann tensor weighted by ℜ6because of the torus geometry in metric (4). Fixing (β) = 0 selects ℜ=r0+rfor a given torus. We ﬁnd mtor(r) =m01−b2 0(r0+r)4 [1+b2 0(r0+r)4]4. (36)\n13 Parameter m0appears in the Riemann tensor when metric function ̥is scaled by m0. We see that the magnetic energy has a negative contribution to mtor, just as the Reissner- Nordstr¨ om electrostatic energy. In the vacuum limit, b2 0→0,mtor(r)→m0. VII. COMPLETE METRIC Metricsgtorandgtor-vaccombine to provide gtoroidal=  gtor,r0< r≤rb gtor-vac,rb≤r <∞(37) A. Inner region The inner torus boundary has coordinates cos β=−1 andr=r0, with metric functions ℜ= 0, and ̥= 1. The toroidal metric goes as gtor∼ ℜ4(dt2−dr2−r2dβ2)−(1/ℜ)2dα2 and is not well behaved. Since RµνRµν= (32b2 0/ℜ2̥4)2andRαβµνRαβµν∼1/ℜ12, it is clear thatgtorhas a singularity at r=r0,cosβ=−1, theℜ= 0 loop. The spacetime history of the central singular loop is a singular cylinder. This reﬂects the singu lar axis of the original cylinder metric (1). B. Asymptotic region The vacuum region starts at rb. For large distances r >> r 0, and with |cosβ|≃1, metric function ℜ=r0+rcosβgo asℜ ∼r. gtoris matched to a vacuum solution gtor-vac µνdxµdxν=ℜ4(dt2−dr2−ℜ−6dα2−r2dβ2). Asymptotically, for |cosβ|>0 gtor-vac∼r4(dt2−dr2−r−6 0dα2−r2dβ2). (38) When (β) is near π/2 or 3π/2 and cos β∼ǫ(near zero) gtor-vac∼ǫ4r4(dt2−dr2−r−6 0dα2−r2dβ2).\n14 There are two directions which do not have a well deﬁned limiting metric : (β) =π/2,3π/2, where the Gaussian curvature of the ( α,β) 2-surface is zero. This diﬃculty can be removed by choosing diﬀerent torus coordinates. Morse and Feshbach [10] use torus coordinates with a hyperbolic radial coordinate. Present coordinates {r,α,β}tormap to{µ,φ,η}MF. The analog of ( β) is angle ( η). The Gaussian curvature of ( φ,η) 2-surfaces is KMF= 1−cosηcoshµ and for ( η) =π/2, 3π/2,KMF= 1. Withr4as a conformal factor, gtor-vaccan be compactiﬁed and is asymptotically ﬂat. In the compactiﬁed diagram, the boundary of the singular cylinder cur ves from I−toI+while the null surfaces of the tori extend to I+. The spacetime of gtoris asymptotically ﬂat and foliated by nested tori. VIII. SUMMARY We have developed a method for mapping known static cylindrical mag netovac solutions tostaticsolutionsintoruscoordinates. Thecylinder topologyhasb eenchangedfrom R1×S1 to torusS1×S1by identifying the top and bottom cylinder ends. An explicit example ha s been presented with a toroidal magnetic ﬁeld. The example satisﬁes Rainich conditions for valid electrovac solutions. The new solution has three parameters: r0speciﬁes the torus geometry, b2 0the magnetic ﬁeld and magnetic energy density, and m0is the sectional curvature mass parameter. The jump in magnetic ﬁeld is supported by a surface current density in an Israel layer at the vacuumboundary. Thesolutionhasanasymptoticallyﬂatvacuumex terior, andanEinstein- Maxwell interior with a singular cylinder at the center. By extending s ectional curvature masstoincludeenergyintori,wehaveshownthatthemagneticener gysubtractsquasilocally frommtor. Thereareotherexactcylindersolutions, suchastheMelvinmetric, whichhavenosingular regionbutwhosemaptotoruscoordinatesprovideamorecomplicat edmagneticﬁeld. These will be studied in future work, which will also add rotation to these solu tions. ACKNOWLEDGMENT I’m indebted to Professor Jean Krisch for reading and commenting o n early versions of\n15 this work APPENDIX A: TORUS COORDINATES IN EUCLIDEAN 3-SPACE A torus can be generated by sweeping a circle, orthogonal to the x -y plane, about the z- axis. In the x-y plane r0is the distance from the z-axis to the center of the generating circ le, andris the radius of the generating circle. For ranges 0 < r <∞,0< α <2π,0< β <2π, withℜ=r0+rcosβ x=ℜcosα, y=ℜsinα, z=rsinβ. (A1) Cartesian and toroidal coordinates are related by x2+y2+z2=ℜ2+r2sin2β. The torus r= 0 lies in the z= 0 plane and has circular radius r0. Looking down the z-axis (about which αhas range 0 < α <2π) at the torus, one sees the torus boundaries as two concentric circles. The β= constant surfaces, 0 < β <2π,are spheres centered on the z-axis. In the plane β=π/2,x2+y2+z2=r2 0+r2. The Euclidean metric dx2+dy2+dz2with coordinates (A1) becomes dr2+ℜ2dα2+r2dβ2. (A2) The (α,β) 2-surface has Gaussian curvature K=cosβ r(r0+rcosβ). (A3) The angle βranges from 0 to 2 πover the generating circle, while Kis negative, zero, and positive. K<0 forπ/2< β <3π/2 K= 0 forβ=π/2,3π/2 K>0 for 0< β < π 2,3π/2< β <2π. The Euler-Poincar´ e characteristic is χ=2π∫display 0Kr(r0+rcosβ)dβ= 0 (A4) corresponding to the torus (sphere with one handle).\n16 APPENDIX B: GEODESICS To better understand the region surrounding the central singula rity we examine the geodesic ﬂow. From metric gtor-vacwe have a Lagrangean for geodesic paths L=1 2(ℜ4˙t2−ℜ4˙r2−ℜ−2˙α2−r2ℜ4˙β2) (B1) where overdots denote d/ds. The geodesic equations follow from d ds∂L ∂˙xa−∂L ∂xa= 0. (B2) Killing symmetries ∂tand∂αyield ﬁrst integrals ∂L ∂˙t=E0=ℜ4˙t, ∂L ∂˙α=−J0=−ℜ−2˙α or ˙t=E0/ℜ4,˙α=J0ℜ2(B3) Forxa= (β), the timelike geodesic equation is −r2ℜ4¨β+2r2ℜ3(rsinβ)˙β2+2ℜ3(rsinβ)(˙t2−˙r2)+ℜ3(rsinβ)˙α2= 0.(B4) If (β) =πthen¨β= 0. Furthermore, if ˙β= 0 and ¨β= 0, then the orbit remains in the (β) =πplane. (In order to examine the singular region, we choose ( β) =πrather than (β) = 0.) Again, from metric gtor-vac 1 =E2 0/ℜ4−J2 0ℜ2−ℜ4˙r2−r2ℜ4˙β2 1 =E2 0/(r0−r)4−J2 0(r0−r)2−(r0−r)4˙r2(B5) We follow the central force problem of classical mechanics, where E0=1 2m˙r2+Veﬀ(r), and write ˙ r2+Veﬀ(r) =const. Thus, the timelike geodesic paths in the ( β) =πplane can be described by the eﬀective potential Veﬀ(r) = 1/(r−r0)4+J2 0/(r−r0)2−E2 0/(r−r0)8. (B6) ForJ2 0=E2 0, the graph of Veﬀhas a hard negative core at r=r0. The graph increases exponentially to positive values with a maximum at rmax,and then falls to zero as 1 /r2.\n17 –2–1.5–1–0.500.51 1 1.2 1.4 1.6 1.8 2r FIG. 4:Veﬀwithr0= 0, J2 0=E2 0= 1 rmaxis a positive root of J2 0(r−r0)6+2(r−r0)4−4E2 0= 0. Atr=rmaxthere is a closed, unstable, geodesic path around the singular region. ForJ2 0= 0, the shape of the graph is the same, but the height of rmaxis decreased. rmax=r0+(2E2 0)1/4. For large angular momentum, J2 0> E2 0, the graph has no negative values. APPENDIX C: TORUS NULL TETRAD QUANTITIES The metric, gtor µν=lµnν+nµlν−mµ¯mν−¯mµmνwithℜ=r0+rcosβand̥= 1+b2 0ℜ4, has the null basis lµdxµ=̥√ 2(ℜ2dt−ℜ−1dα), (C1a) nµdxµ=̥√ 2(ℜ2dt+ℜ−1dα), (C1b) mµdxµ=−ℜ2 √ 2[(̥cosβ+i̥−1sinβ)dr−(̥sinβ−i̥−1cosβ)rdβ], (C1c) ¯mµdxµ=−ℜ2 √ 2[(̥cosβ−i̥−1sinβ)dr−(̥sinβ+i̥−1cosβ)rdβ]. (C1d)\n18 The spin coeﬃcients are ǫ=σ=λ=ρ=µ=γ= 0 (C2a) κ=−3 2√ 21 ℜ3̥(C2b) ν=−κ (C2c) π=1 2√ 2(1 ℜ3̥2)(1+9b2 0ℜ4) (C2d) τ=−π (C2e) α=−1√ 2(1 ℜ3̥2)(1−9b2 0ℜ4) (C2f) β=−α (C2g) mµand ¯mµare null geodesics, since mµ;νmν= (β−¯α)mµ. The only non-zero Ricci component is Φ11= 8b2 0 ℜ2̥4(C3) The Weyl tensor null tetrad components are Ψ0=−(3 ℜ6̥3)(1−b2 0ℜ4) (C4a) Ψ1= Ψ3= 0 (C4b) Ψ2=−(1 ℜ6̥4)(1−b2 0ℜ4)(1+9b2 0ℜ4) (C4c) Ψ4= Ψ0 (C4d) which correspond to Petrov type I. The quadratic Ricci and Weyl invariants are RµνRµν= (32b2 0/ℜ2̥4)2, (C5a) CαβµνCαβµν=192 ℜ12̥4(1−b2 0ℜ4)(1+6b2 0ℜ4+21b4 0ℜ8) (1+6b2 0ℜ4+b4 0ℜ8). (C5b) APPENDIX D: RELATIVISTIC ELECTROMAGNETIC FIELD The Maxwell ﬁeld is represented by skew tensor Fµν, with dual ﬁeld F∗ µν=1 2√−gεµναβFαβ. The symmetric energy-momentum is Tµν=1 4π(FµαFα ν+1 4gµνFαβFαβ). (D6)\n19 In a local Lorentz frame, the energy density is T00=−(E2+B2)/8π. (D7) The Einstein ﬁeld equations provide the trace-free Ricci tensor Rµν=−(FµαFα ν+1 4gµνFαβFαβ). (D8) For static systems there exists a hypersurface orthogonal time like Killing vector ξµ∂µ=∂t. The constant time hypersurfaces form a family of Lorentz frames with unit normal ˆtν= ξν/(ξµξµ)1/2. Local electric and magnetic ﬁelds are deﬁned by Eµ=Fµνˆtν= (0,/vectorE), Bµ=F∗ µνˆtν= (0,−/vectorB). (D9) Maxwell’s static equations are ∇·/vectorE= 4πρ,∇×/vectorE= 0,∇·/vectorB= 0,∇×/vectorB= 4π/vectorJ. (D10) The ﬁeld invariants are I1:=1 2FµνFµν=B2−E2, I2:=1 2FµνF∗ µν=−2EµBµ. (D11) The Maxwell components on an anti-self dual bivector basis are 1 2(Fµν+iF∗µν) =φ0Uµν−φ1Mµν+φ2Vµν. (D12) The ﬁeld invariants are I1+iI2= 4(φ0φ2−φ2 1). There are three necessary and suﬃcient Rainich conditions [11] for Tµνto be anelectrovac energy-momentum tensor. 1.Tµν(and Ricci) must be trace-free. gµνTµν=gµνRµν= 0. (D13) 2. The ”square” of Tµνis a positive multiple of the unit tensor. Tµ αTα ν= (I2 1+I2 2)δµ ν (D14a) orRµ αRα ν=1 4(RαβRαβ)δµ ν. (D14b)\n20 3. Since the electromagnetic energy-momentum density, T00, is negative in a local Minkowski frame, it is necessary for any timelike vector tµthat Tµνtµtν≤0. (D15) [1] L. Ferrario and D.T. Wickramasinghe, Mon. Not. R. Astron . Soc.356, 615 (2005). [2] S. L. Shapiro and S.A. Teukolsky, Black Holes, White Dwarfs, and Neutron Stars , (Wiley, New York, 1983) Ch. 7. [3] K. Ioka and M. Sasaki, Ap. J. 600, 296 (2004). [4] C. Cutler, Phys. Rev. D 66, 084025 (2002). [5] M. P. do Carmo, Diﬀerential Geometry of Curves and Surfaces , (Prentice-Hall, New Jersey, 1976) p 157. [6] W. Israel, Phys. Rev. D 15, 935 (1977). [7]Exact Solutions of Einstein’s Field Equations, Eds. D. Kramer, H. Stephani, E. Herlt, M. MacCallum and E. Schmutzer, 2nd Ed. (Cambridge University P ress, Cambridge, U.K. 2003). [8] E. Poisson, A Relativist’s Toolkit , (Cambridge University Press, 2004) p.89. [9] J.D. Jackson, Classical Electrodynamics , (3rd ed. John Wiley, New York, 1999). [10] P.M. Morse and H. Feshbach, Methods of Theoretical Physics , part II, ch 10 (McGraw Hill, New York, 1953). [11] L. Witten, ”A Geometric Theory of the Electromagnetic a nd Gravitational Fields” in Gravi- tation,Ed. L. Witten, (John Wiley, New York, 1962).\n",
  "metadata": {
    "paper_id": "gr-qc/0610093v1",
    "downloaded_at": "2025-08-24T19:59:53.403622+00:00"
  },
  "processed_at": "2025-08-24T19:59:53.403639+00:00"
}