{
  "content": "arXiv:gr-qc/9811031v2 22 Mar 1999On the existence of Killing vector ﬁelds∗ Istv´ an R´ acz† Yukawa Institute for Theoretical Physics Kyoto University, Kyoto 606-01, Japan September 27, 2018 Abstract In covariant metric theories of coupled gravity-matter sys tems the necessary and suﬃcient conditions ensuring the existence of a Killing vector ﬁeld a re investigated. It is shown that the symmetries of initial data sets are preserved by the evoluti on of hyperbolic systems. 1 Introduction In any physical theory those conﬁgurations which possess symme try are distinguished. They rep- resent, for instance, the equilibrium states of the underlying syst ems. It might also happen that the relevant ﬁeld equations are far too complicated not allowing us to have the general but only certain symmetric solutions of them. Einstein’s theory of gravity pr ovides immediate examples for these possibilities. In addition, in black hole physics the asymptotic ﬁn al state of the gravitational collapse of an isolated object is expected to be represented by a st ationary black hole solution (see e.g. [11, 19] for further details and references). It is also known t hat those solutions of Einstein’s equations which possess symmetries do represent critical points o f the phase space in the linear stability problem, i.e. in the investigation of the validity of the perturb ation theory [13, 14, 1, 2, 3]. The above examples indicate that the identiﬁcation of spacetimes po ssessing a symmetry is of obvious physical interest. In this paper the existence of symmetr ies will be studied in the case of coupled gravity-matter systems of the following types: The matte r ﬁelds are assumed to satisfy suitable hyperbolic equations and to possess a minimal coupling to gra vity. In addition, the Ricci tensor is supposed to be given as a function of the matter ﬁelds, th eir ﬁrst covariant derivatives and the metric. Within this setting we address the following question: What are the necessary and suﬃcient conditions that can guarantee the existence of a Killing vec tor ﬁeld so that the matter ﬁelds are also invariant? Themain purposeofthe presentpaperistoanswerthis question. T hereis, however,amoreprag- matic motivation beyond. We also would like to establish a detailed enoug h framework within which some of the claims of [17] concerning the existence of Killing vector ﬁe lds within the characteristic initialvalueprobleminthe caseofEinstein–Klein-Gordon,Einstein–[no n-Abelian]HiggsorEinstein- [Maxwell]-Yang-Mills-dilatonsystems(see[10]foranalogousresultsc oncerningtheEinstein-Maxwell case) can be justiﬁed. ∗Dedicated to the memory of Professor ´Agoston B´ aba †Fellow of the Japan Society for the Promotion of Science, on l eave of absence from MTA-KFKI Research Institute for Particle and Nuclear Physics, email: istvan@yukawa.ky oto-u.ac.jp 1\nOur main result is that hyperbolic evolutions preserve the symmetrie s of the initial data sets. In particular, initial symmetries are preserved in the case Einstein– Klein-Gordon, Einstein–[non- Abelian] Higgs and Einstein-[Maxwell]-Yang-Mills-dilaton systems. The necessary and suﬃcient conditions ensuring the existence of a Killing vector ﬁeld are given in terms of restrictions on certain initial data sets in an initial value pr oblem associated with the considered system. There is only one signiﬁcant requirement the ap plied initial value problem has to satisfy: The existence and uniqueness of solutions to quasilinear wave equations is expected to be guaranteed within its framework in the smooth setting. The init ial value problems which satisfy this condition will be referred as ‘appropriate initial value pro blems’. Immediate examples for appropriate initial value problems are the standard Cauchy pro blem (see e.g. Ref. [6]) and also in the characteristic initial value problem associated with an initial hypersurface represented by either the union of two smooth null hypersurfaces intersecting on a 2-dimensional spacelike surface [16, 18] or a characteristic cone [7, 4, 18]. Since no furthe r requirement on the initial value problem is used anywhere in the derivation of our results we shall not make a deﬁnite choice among these appropriate initial value problems. However, as a direct cons equence of this, our necessary and suﬃcient conditions cannot be as detailed as the corresponding restrictions applied e.g. in [5] where the case of Einstein-Maxwell systems in the framework of th e standard Cauchy problem was considered. Although, the analogous investigations could be carrie d out case by case they are not attempted to be done here. Instead we introduce the following not ation that will be applied on equal footing to any of the above mentioned appropriate initial valu e formulations: The initial data sets will be represented by the basic variables in square brackets w hile the initial hyper surface will always be denoted by Σ. Accordingly, whenever an ‘initial data set’ a nd an ‘initial hypersurface’ will be referred the relevant pair of these notions deﬁned in either o f the ‘appropriate initial value problems’ could be substituted.1 This paper is organized as follows: In section 2 we specify the gravity -matter systems to which our main results apply. Section 3 starts with the construction of a ‘c andidate’ Killing vector ﬁeld. Then a general procedure selecting the true Killing ﬁelds and also yield ing the desired necessary and suﬃcient conditions is presented. Finally, in section 4 the particu lar case of Einstein-[Maxwell]- Yang-Mills-dilaton systems is considered. Throughout this paper a spacetime ( M,gab) is taken to be a smooth, paracompact, connected, orientable manifold Mendowed with a smooth Lorentzian metric gab. Unless otherwise stated we shall use the notation and conventions of [19]. 2 The gravity-matter systems Thissectionistogiveamathematicallyprecisespeciﬁcationofthecon sideredcoupledgravity-matter systems. The matter ﬁelds areconsideredto be represented by smooth ten sorﬁelds. Since the metric gabis assumed to be deﬁned everywhereon Mwe may, without loss of generality, restrict considerationsto tensor ﬁelds T(i)a...bof type (0,li) wherea...bdenotes the li(∈N∪{0}) ‘slots’ ofT(i)a...b. The matter ﬁelds might also have gauge dependence but, even if they have, the corresponding gauge or internal space indices will be suppressed. In most of the cases the spacetim e indices of the matter ﬁeld variables will also be suppressed and the relevant (0 ,li) type tensor ﬁelds will simply be denoted 1All of the relevant ﬁeld equations considered in this paper w ill (or in certain cases by making use of a ‘hyperbolic reduction procedure’ [8] will be shown to) possess the form o f quasilinear wave equations. Thereby, in the particular case when our basic unknown is a function ϕ, one should think of the initial data set represented by [ ϕ] as a pair of the functions ϕ|Σandna∇aϕ|Σ, where nais normal to Σ, in the standard Cauchy problem while it consis ts of a single function ϕ|Σin the characteristic initial value problem. 2\nbyT(i). All the indices, however, will be spelled out explicitly in each of the not self explaining situations. In our setting, just like in various other analogous investigations, t he hyperbolic character of the matter ﬁeld equations have more relevance than any further in formation related, for instance, to their particular form. Thereby, we shall assume that the matte r ﬁeldsT(i)satisfy a quasi-linear, diagonal, second order hyperbolic system of the form2 ∇a∇aT(i)=F(i)( T(j),∇cT(j),gef) , (2.1) where each of the (0 ,li) type tensor ﬁelds F(i)is assumed to be a smooth function of the indicated arguments (the obvious dependence on the points of Mwill be suppressed throughout this paper). We assume, furthermore, that the matter ﬁelds are coupled to gr avity so that the Ricci tensor Rabcan be given as a smooth function of the ﬁelds T(i), their ﬁrst covariant derivatives and the metric, Rab=Rab( T(i),∇cT(i),gef) . (2.2) The last condition is satisﬁed, for instance, in Einstein’s theory of gr avity whenever the Lagrangian does contain at most ﬁrst order derivatives of the matter ﬁeld var iables. Thereby, our results imme- diately apply to Einstein-matter systems of this kind. Note, howeve r, that the above conditions are also satisﬁed by the ‘conformally equivalent representation’ of high er curvature theories possessing a gravitational Lagrangian that is a polynomial of the Ricci scalar (c onsidered e.g. in Ref. [12]) and could also be satisﬁed by various other types of covariant metric th eories of gravity. The introduction of the above level of generality might seem to be po intless because even within Einstein’s theory of gravity it has not been ﬁxed in general whether such a coupled gravity-matter system possesses unique smooth solutions in suitable initial value for mulations for smooth initial data sets. The remaining part of this section is to demonstrate – by making use of a straightforward adaptation of the ‘hyperbolic reduction’ procedure of Friedrich [8] to the present case – that (2.1) and (2.2) can be recast into the form of a system of coupled quasiline ar wave equations and thereby they possess, up to diﬀeomorphisms, unique solutions in ‘appropriat e initial value problems’ for the smooth setting. Consider ﬁrst the components of the metric gaband the matter ﬁelds T(i)in some coordinates as the basic unknowns. Observe then that the Ricci tensor and ∇a∇aT(i)read in the associated local coordinates as Rαβ=−1 2gµν∂µ∂νgαβ+gδ(α∂β)Γδ+H′ αβ(gερ,∂γgερ) (2.3) and ∇µ∇µT(i)=gµν∂µ∂νT(i)−li∑ k=1( T(i))[αk] δ( Rαkδ+∂αkΓδ) +H′ (i)(gερ,∂γgερ,T(j),∂γT(j)),(2.4) where∂αdenotes the partial derivative operator with respect to the coor dinatexα, Γµ=gαβΓµαβ withΓµερdenotingtheChristoﬀelsymbolof gαβ,moreover,( T(i))[αk] δstandsforT(i)α1...αk−1δαk+1...αliandH′ αβandH′ (i)(the later with the suppressed indices α1...αli) are appropriate smooth functions 2To be able to derive our later results, see equations (3.9) an d (3.13), we need to keep our formalism in an explicitly covariant form. As opposed to the usual treatmen t of the matter ﬁelds in the initial value problems (see e.g. [19, 16, 18]) the matter ﬁeld equations are assumed to be tens or equations. This, in particular, means that instead of requiring that the components of matter ﬁeld variables, a s a set of functions, satisfy hyperbolic wave equations involving only the ‘ﬂat wave operator’ gµν∂µ∂νexclusively (2.1) contains the complete action of the opera torgab∇a∇b on the matter ﬁeld variables. 3\nof the indicated variables. Thereby, (2.1) and (2.2) can be recast in to the form gµν∂µ∂νT(i)=li∑ k=1( T(i))[αk] δ∂αkΓδ+H(i)(gερ,∂γgερ,T(j),∂γT(j)) (2.5) gµν∂µ∂νgαβ= 2gδ(α∂β)Γδ+Hαβ(gερ,∂γgερ,T(j),∂γT(j)). (2.6) If the functions Γδwereknown these equationswould immediately giveriseto aquasilinear , diagonal second order hyperbolic system for the unknowns and we would hav e done. Notice, however, that as in [8] Γδcan be replaced in the above equations with arbitrary ‘gauge source functions’fδsatisfying thatfδ= Γδon an arbitrarily chosen initial hypersurface Σ (where Γδis always determined by the speciﬁed initial data [ gαβ]) and consider the relevant set of ‘reduced equations’ as propaga tion equations for the basic unknowns. From the corresponding unique solution the functions Γδcan be determined and, by refering to the twice contracted Bianchi ident ity, it can be demonstrated [8] (see also page 540 of [9]) that ∇µ∇µ(Γδ−fδ)+Rδν(Γν−fν) = 0. (2.7) Recall then that Γδ=fδon Σ and by (2.6) and its reduced form the entire initial data set for ( 2.7) has to vanish there. Thus we have that Γδ=fδthroughout the associated development, i.e. the solution of the reduced problem does satisfy the original set of cou pled equations (2.5) and (2.6). 3 The construction of a Killing vector ﬁeld A spacetime admits a Killing vector ﬁeld Kawhenever the Killing equation LKgab=∇aKb+∇bKa= 0 (3.1) holds. Then we have that Xab=∇aKbis a 2-form ﬁeld on Mand its integrability condition (dX)abc= 0 reads as ∇a∇bKc+∇c∇aKb+∇b∇cKa= 0. (3.2) Replacing now ∇aKbwith−∇bKa(based on the antisymmetry of ∇aKb) in the second term and using the deﬁnition of the Riemann tensor we get that ∇a∇bKc+RbcadKd= 0, (3.3) is equivalent to the integrability condition of Xab. This equation holds for any Killing vector ﬁeld on (M,gab). We will show below that its contraction ∇a∇aKc+RcdKd= 0, (3.4) which is a linear homogeneous wave equation for Ka, provides a mean to construct a ‘candidate’ Killing vectorﬁeld. Clearly, any Killing vectorﬁeld has to satisfy (3.4) bu t not all ofits solutions will giverisetoaKillingvectorﬁeld. Ouraiminthissectiontogivethenecess aryandsuﬃcientconditions on the initial data for (3.4), in terms of gabandT(i), which guaranteethat the corresponding solution of (3.4) will be a Killing vector ﬁeld so that the matter ﬁelds will also be inv ariant, i.e. LKT(i)= 0. The remaining part of this section is to show: Theorem 3.1 Let(M,gab)be a spacetime associated with a gravity-matter system spec iﬁed in sec- tion 2. Denote by D[Σ]the domain of dependence of an initial hypersurface Σwithin an appro- priate initial value problem. Then there exists a non-trivi al Killing vector ﬁeld KaonD[Σ], with 4\nLKT(i)= 0, if and only if there exists a non-trivial initial data set [Ka]for (3.4) so that [LKgab] and[LKT(i)]vanish3identically on Σ. ProofThe necessity of the above conditions is trivial since the ﬁelds LKgabandLKT(i), along with their derivatives, vanish on Σ. To see that the above conditions are also suﬃcient one can proceed as follows: Suppose that Ka satisﬁes (3.4) but otherwise it is an arbitrary vector ﬁeld. It can be shown (by taking the covariant derivative of (3.4), commuting derivatives and applying the contrac ted Bianchi identity) that LKgab satisﬁes the equation ∇e∇e(LKgab) =−2LKRab+2Reabf(LKgef)+2Re (a(LKgb)e). (3.5) Moreover, by taking the Lie derivative of (2.2) we get4 LKRab=∑ (i)(g ∂Rab ∂T(i))g LKT(i)+∑ (i)(g ∂Rab ∂( ∇eT(i)))g LK( ∇eT(i)) +(g∂Rab ∂gef)g LKgef.(3.6) Consider now the commutation relation of LKand∇a LK( ∇bT(i)) =∇b( LKT(i)) −li∑ k=1( T(i))[ak] e[∇LKg]ake b, (3.7) where( T(i))[ak] estands forT(i)a1...ak−1eak+1...aliand the notation [∇LKg]ac b=1 2gcf{∇a(LKgfb)+∇b(LKgaf)−∇f(LKgab)} (3.8) has been used. Then, in virtue of (3.5), (3.6) and (3.7), LKgabsatisﬁes an equation of the form ∇e∇e(LKgab) = Kab(LKgcd)+Lab(∇c(LKgcd))+∑ (i)M(i)ab( LKT(i)) +∑ (i)N(i)ab( ∇c(LKT(i))) (3.9) whereKab, Lab, M(i)abandN(i)abarelinearand homogeneousfunctions in theirindicated arguments. Now we show that the same type of equation holds for LKT(i). To see this consider ﬁrst the Lie derivative of (2.1) with respect to the vector ﬁeld Ka LK( ∇e∇eT(i)) =( LKgef) ∇e∇fT(i)+gefLK( ∇e∇fT(i)) (3.10) =∑ (j)(g ∂F(i) ∂T(j))g LKT(j)+∑ (j)(g ∂F(i) ∂( ∇cT(j)))g LK( ∇cT(j)) +(g∂F(i) ∂gab)g LKgab. By applying the commutation relation (3.7) twice we get LK( ∇e∇fT(i)) =∇e∇f( LKT(i)) −( ∇cT(i)) [∇LKg]fce −li∑ k=1/bracketleftBig 2( ∇(e|T(i))[ak] c[∇LKg]akc |f)+( T(i))[ak] c∇e( [∇LKg]akc f)/bracketrightBig .(3.11) 3As it will be shown below the ‘evolution equations’ for LKgabandLKT(i)are (3.9) and (3.13). By refering to these equations one can make immediate sense of the last part of our condition in either of the above mentioned appropriate initial value problems. 4Whenever Ta1...akandSb1...blare tensor ﬁelds of type (0 ,k) and (0 ,l), respectively, ( ∂Ta1...ak/∂Sb1...bl) is considered to be a tensor ﬁeld of type ( l,k). Accordingly, the contraction ( ∂Ta1...ak/∂Sb1...bl)LKSb1...blof (∂Ta1...ak/∂Sb1...bl) andLKSb1...blis a tensor ﬁeld of type (0 ,k). 5\nThe last term on the r.h.s. of (3.11) does not possess the needed fo rm yet because it contains second order covariant derivatives of LKgab. Thereby it could ‘get in the way’ of the demonstration thatLKT(i)do satisfy quasilinear wave equations of the type (3.9). Note, howe ver, that by the substitution LKgab=∇aKb+∇bKa, along with the commutation covariant derivatives and the application of the Bianchi identities, we get that whenever Kasatisﬁes (3.4) gef∇e( [∇LKg]akc f) =1 2gcd{∇e∇e(LKgakd)−Rde(LKgake)+Rake(LKged)}(3.12) must also holds. Finally, by making use of all of the equations (3.6)–(3 .12), it can be justiﬁed that LKT(i)do really satisfy an equation of the form ∇e∇e( LKT(i)) =P(i)(LKgcd)+Q(i)(∇b(LKgcd))+∑ (j)R(i)(j)( LKT(j)) +∑ (j)S(i)(j)( ∇c(LKT(j))) (3.13) whereP(i),Q(i),R(i)(j)andS(i)(j)arelinearandhomogeneousfunctions intheirindicatedarguments. To complete our proof consider a non-trivial initial data set [ Ka] on an initial hypersurface Σ associated with vanishing initial data, [ LKgab] and [LKT(i)] for (3.9) and (3.13). Since (3.9) and (3.13) comprise a set of coupled linear and homogeneous wave equat ions for LKgabandLKT(i), which possesses the identically zero solution associated with a zero in itial data set, we have that LKgab≡0 andLKT(i)≡0 throughout the domain where the associated unique solution of (3 .4) does exist. To see, ﬁnally, that this domain has to coincide with D[Σ] note that since (3.4) is also a linear homogeneous wave equation any solution of it can be shown – by making use of the ‘patching together local solutions’ techniques described e.g. on page 266 of [15] – to extend to the entire of the domain of dependence D[Σ] of Σ. Note that the full set of equations (2.1), (2.2), (3.4), (3.9) and (3 .13) could also be recast – by making use of the hyperbolic reduction techniques – into the form of a set of quasilinear wave equations. Moreover, the validity of the conditions of the above th eorem can also be justiﬁed if the initial data [ gab] and [T(i)], associated with (2.1) and (2.2), are given on Σ. Therefore in virtue of the above result we have Corollary 3.1 Denote by D[Σ]the maximal development of an initial data set [gab]and[T(i)], associated with (2.1) and (2.2), speciﬁed on an initial hype rsurface Σwithin an appropriate initial value problem. Then there exists a non-trivial Killing vect or ﬁeldKaonD[Σ], withLKT(i)= 0, if and only if there exists a non-trivial initial data set [Ka]for (3.4) so that the initial data, [LKgab] and[LKT(i)], for (3.9) and (3.13) vanish identically on Σ. Remark 3.1 Remember that whenever only the existence of a Killing vecto r ﬁeld ensured for the considered gravity-matter systems the matter ﬁelds need no t to be invariant. Nevertheless, the non- invariance of them – represented by the ﬁelds LKT(i)– has to ‘develop’ according to the linear homogeneous wave equations ∇e∇e( LKT(i)) =∑ (j)(g ∂F(i) ∂T(j))g LKT(j)+∑ (j)(g ∂F(i) ∂( ∇eT(j)))g ∇e( LKT(j)) (3.14) and the constraints 0 =∑ (i)(g ∂Rab ∂T(i))g LKT(i)+∑ (i)(g ∂Rab ∂( ∇eT(i)))g ∇e( LKT(i)) , (3.15) have also to be satisﬁed. 6\n4 Einstein-[Maxwell]-Yang-Mills (E[M]YM) systems In this section the case of matter ﬁelds for which the r.h.s. of (2.1) e xplicitly depends on second order derivatives of the matter ﬁeld variables will be considered. Ho wever, instead of trying to have a result of ‘maximal generality’ we only illustrate what sort of modiﬁca tions of the procedures of the previous section are needed to cover the particular case of E[M]YM s ystems which are described as follows. A Yang-Mills ﬁeld is represented by a vector potential Aataking values in the Lie algebra g of a Lie group G. For the sake of deﬁniteness, throughout this pap er, G will be assumed to be a matrix group and it will also be assumed that there exists a real inner product, denoted by ( /), ongwhich is invariant under the adjoint representation5. In terms of the gauge potential Aathe Lie-algebra-valued 2-form ﬁeld Fabis given as Fab=∇aAb−∇bAa+[Aa,Ab] (4.1) where [,] denotes the product in g. The Ricci tensor of an E[M]YM system is Rab=χ/braceleftbigg (Fae/Fbe)−1 4gab( Fef/Fef)/bracerightbigg , (4.2) with some constant χ, while the Yang-Mills ﬁeld equations read as ∇aFab+[Aa,Fba] = 0. (4.3) By the substitution of the r.h.s. of (4.1) for Fabinto (4.3) and commuting derivatives we get ∇a∇aAb=RbdAd−[∇aAa,Ab]−[Aa,∇aAb]−[Aa,Fba]+∇b(∇aAa). (4.4) In virtue of (4.1), (4.3) and (4.4) we have that the considered E[M]YM system is almost of the type characterized in section 2. The only, however, signiﬁcant diﬀe rence is that on the r.h.s. of (4.4) we have the term ∇b(∇aAa) which contains second order covariant derivatives of the gauge potentialAa. Fortunately, this term is of the same character as ∂αΓβwas in (2.6) and the same type of resolution does apply here. To see this substitute an arbitrary f unctionA, called ‘gauge source function’, for ∇aAain the last term of (4.4) so that A=∇aAaholds on an initial hypersurface Σ. The yielded equation is referred to be the reduced form of (4.4). Th en by the application of ∇bto (4.4), and also to its reduced form, we get that ∇b∇b(A−∇aAa) = 0. (4.5) In addition, we have that A=∇aAaon Σ, moreover, (4.4), along with its reduced form, implies that the initial data for (4.5) has to vanish identically on Σ. Thereby t he unique solution of the reduced form of (4.4) is in fact a solution of (4.4) itself. It follows from the above argument that an E[M]YM system diﬀers fro m the systems speciﬁed in section 2 only in that in the present case we have to apply two types o f gauge source functions fδ andAand then use the subsidiary equations (2.7) and (4.5) to demonstra te that the unique smooth solutions of the ‘reduced equations’ – which equations are obviously the needed type of quasilinear wave equations – are, up to ‘gauge transformations’, unique solutio ns of the full E[M]YM equations, as well. Turning back to the problem of the existence of a Killing vector ﬁeld in t he case of an E[M]YM system consider ﬁrst a vector ﬁeld Kasatisfying (3.4) and suppose that LK(∇aAa) does vanish 5Note that the inner product ( /) is not needed to be assumed to be positive deﬁnite as opposed to its use in [17]. 7\nthroughout. Then, from (4.4) we get that an equation of the type (3.13) has to be satisﬁed by LKAa. Thereby, a statement analogous to that of Theor.3.1 can immediat ely be recovered in the case of E[M]YM systems whenever a gauge potential AawithLK(∇aAa) = 0 does exist. Suppose now that a non-trivial initial data set [ Ka] for (3.4) is given so that [ LKgab] and [LKAa] vanish on an initial hypersurface Σ. We show that then there exists a gauge potential A∗ a(at least in a suﬃciently small neighbourhood Oof Σ) so that [ A∗ a] coincides with [ Aa] on Σ and LK(∇aA∗ a) = 0. To see this replace Aaby a gauge equivalent potential A∗ a=m−1(∇am+Aam), (4.6) wheremis an arbitrary smooth G-valued function (deﬁned in general locally o n an open subset ofM). Since LK(∇aAa) = 0 on Σ it is reasonable to require [ A∗ a] to coincide with [ Aa] on Σ. Accordingly, we set m=E(and if it is needed ∇am= 0) on Σ, where Eis the unit element of G. Since, so far only the initial data [ A∗ a] has been speciﬁed, we still have the freedom to choose the gauge source function A∗=∇aA∗ aarbitrarily. Thereby we assume that ∇aA∗ ais so that LK(∇aA∗ a) vanishes identically in D[Σ]. In addition, the generator of the gauge transformation (4.6) h as to satisfy ∇a∇am=m(∇aA∗ a)−(∇aAa)m−Aa∇am+(∇am)m−1(∇am+Aam). (4.7) By making use of this equation mand, in turn, the desired gauge potential A∗ acan be constructed. Clearly, (4.7), with given ‘source terms’ ∇aA∗ aand∇aAa, possesses (at least in a suﬃciently small neighbourhood Oof the initial hypersurface Σ) a unique solution so that m=E(and∇am= 0) on Σ. Moreover, for the gauge potential A∗ a, determined by this unique solution mvia (4.6), [ LKA∗ a] vanishes on Σ and LK(∇aA∗ a) = 0 throughout O. The following sums up what have been proven Theorem 4.1 Let(M,gab)be a spacetime associated with an E[M]YM system as it was spec iﬁed above. Let, furthermore, Σbe an initial hypersurface within an appropriate initial va lue problem. Then there exist a non-trivial Killing vector ﬁeld Kaand a gauge potential A∗ aso thatLKA∗ a= 0 in a neighbourhood OofΣ, if and only if there exists a non-trivial initial data set [Ka]for (3.4) so that[LKgab]and[LKAa]vanish identically on Σ. Remark 4.1 Combining now all the above results a statement analogous to that of Theor.4.1 can be proven for appropriate couplings (based on terms containin g suﬃciently low order derivatives of the matter ﬁelds variables) of Yang-Mills – matter systems in Ei nstein theory of gravity. In particular, it can be shown that Theor.4.1 generalizes to the case of Einste in-[Maxwell]-Yang-Mills-dilaton systems given by the Lagrangian L=R+2∇eψ∇eψ−e2γdψ(Fef/Fef), (4.8) whereRis the Ricci scalar, ψdenotes the (real) dilaton ﬁeld and γdis the dilaton coupling constant. Acknowledgments I wish to thank Helmut Friedrich for stimulating discussions. This rese arch was supported in parts by the Monbusho Grant-in-aid No. P96369 and by the OTKA grant No . T030374. 8\nReferences [1] J.M. Arms: Linearization stability of the Einstein-Maxwell system , J. Math. Phys. 18, 830-833 (1977) [2] J.M. Arms: Linearization stability of gravitational and gauge ﬁelds , J. Math. Phys. 20, 443-453 (1979) [3] J.M.ArmsandJ.E.Marsden: The absence of Killing ﬁelds is necessary for linearization stability of Einstein’s equations , Ind. Univ. Math. J. 28, 119-125 (1979) [4] F. Cagnac: Probl` eme de Cauchy sur un cono¨ ıde caract´ eristique pour d es ´ equations quasi- lin´ eaires, Annali Mat. pura appl. 129, 12-41 (1980) [5] B. Coll: On the evolution equations for Killing ﬁelds J. Math. Phys. 18, 1918-1922 (1977) [6] R. Courant and D. Hilbert: Methods of mathematical physics Vol. II. , New York, Interscience Publishers (1962) [7] F.G. Friedlander: The wave equation on curved space-time , Cambridge Univ. Press. (1975) [8] H. Friedrich: Hyperbolic reductions for Einstein’s equations , Class. Quant. Grav. 13, 1451-1469 (1996) [9] H. Friedrich: On the hyperbolicity of Einstein’s equations and other gaug e ﬁeld equations , Com- mun. Math. Phys. 100, 525-543 (1985) [10] H. Friedrich, I. R´ acz and R.M. Wald: On the rigidity theorem for spacetimes with a stationary event horizon or a compact Cauchy horizon , gr-qc9811021, to appear in Commun. Math. Phys. [11] S.W. Hawking and G.F.R. Ellis: The large scale structure of space-time , Cambridge University Press (1973) [12] T. Jacobson and G. Kang: Increase of black hole entropy in higher curvature gravity , Phys. Rev. D.52, 3518-3528 (1995) [13] V. Moncrief: Spacetime symmetries and linearization stability of the Ei nstein equations I. , J. Math. Phys. 16, 493-498 (1975) [14] V. Moncrief: Spacetime symmetries and linearization stability of the Ei nstein equations II. , J. Math. Phys. 17, 1893-1902 (1976) [15] H. M¨ uller zum Hagen and H.-J. Seifert: On characteristic initial-value and mixed problems , Gen. Rel. Grav. 8, 259-301 (1977) [16] H. M¨ uller zum Hagen: Characteristic initial value problem for hyperbolic syste ms of second order diﬀerential systems , Ann. Inst. Henri Poincar´ e 53, 159-216 (1990) [17] I. R´ acz: On further generalizations of the rigidity theorem for spac etimes with a stationary event horizon or a compact Cauchy horizon , in preparation [18] A.D. Rendall: Reduction of the characteristic initial value problem to th e Cauchy problem and its applications to the Einstein equations , Proc. R. Soc. Lond. A 427, 221-239 (1990) [19] R.M. Wald: General relativity , University of Chicago Press, Chicago (1984) 9\n",
  "metadata": {
    "paper_id": "gr-qc/9811031v2",
    "downloaded_at": "2025-08-24T19:21:18.405953+00:00"
  },
  "processed_at": "2025-08-24T19:21:18.405992+00:00"
}