{
  "content": "arXiv:quant-ph/0003151v1 31 Mar 2000Unconventional Quantum Computing Devices Seth Lloyd Mechanical Engineering MIT 3-160 Cambridge, Mass. 02139 Abstract: This paper investigates a variety of unconventional quantu m computation de- vices, including fermionic quantum computers and computer s that exploit nonlinear quan- tum mechanics. It is shown that unconventional quantum comp uting devices can in prin- ciple compute some quantities more rapidly than ‘conventio nal’ quantum computers. Computers are physical: what they can and cannot do is determ ined by the laws of physics. When scientiﬁc progress augments or revises tho se laws, our picture of what computers can do changes. Currently, quantum mechanics is g enerally accepted as the fundamental dynamical theory of how physical systems behav e. Quantum computers can in principle exploit quantum coherence to perform computat ional tasks that classical com- puters cannot [1-21]. If someday quantum mechanics should t urn out to be incomplete or faulty, then our picture of what computers can do will chan ge. In addition, the set of known quantum phenomena is constantly increasing: essen tially any coherent quantum phenomenon involving nonlinear interactions between quan tum degrees of freedom can in principle be exploited to perform quantum logic. This pap er discusses how the revi- sion of fundamental laws and the discovery of new quantum phe nomena can lead to new technologies and algorithms for quantum computers. Since new quantum eﬀects are discovered seemingly every day , let’s ﬁrst discuss two basic tests that a phenomenon must pass to be able to function as a basis for quantum computation. Theseare1)Thephenomenonmustbenonlinear, and2)Itmustbecoherent. To support quantum logic, the phenomenon must involve some f orm of nonlinearity, e.g., a nonlinear interaction between quantum degrees of freedom . Without such a nonlinearity quantum devices, like linear classical devices, cannot per form even so simple a nonlinear operation as an AND gate. Quantum coherence is a prerequisit e for performing tasks such as factoring using Shor’s algorithm [10], quantum simu lation a la Feynman [11] and Lloyd [12], or Grover’s data-base search algorithm [13], al l of which require extended manipulations of coherent quantum superpositions. 1\nThe requirements of nonlinearity and coherence are not only necessary for a phe- nomenon to support quantum computation, they are also in pri nciple suﬃcient. As shown in [14-15], essentially any nonlinear interaction between quantum degrees of freedom suf- ﬁces to construct universal quantum logic gates that can be a ssembled into a quantum computer. In addition, the work of Preskill et al.[18] on robust quantum computation shows that an error rate of no more than 10−4per quantum logic operation allows one to perform arbitrarily long quantum computations in principl e. In practice, of course, few if any quantum phenomena are like ly to prove suﬃciently controllable to provide extended quantum computation. Pro mising devices under current experimental investigation include ion traps [5,7], high ﬁ nesse cavities for manipulating light and atoms using quantum electrodynamics [6], and mole cular systems that can be made to compute using nuclear magnetic resonance [8-9]. Suc h devices store quantum information on the states of quantum systems such as photons , atoms, or nuclei, and accomplish quantum logic by manipulating the interactions between the systems via the application of semiclassical potentials such as microwave or laser ﬁelds. We will call such devices ‘conventional’ quantum computers, if only because such devices have actually been constructed. There is another sense in which such computers are conventio nal: although the de- vices described above have already been used to explore new r egimes in physics and to create and investigate the properties of new and exotic quan tum states of matter, they function according to well established and well understood laws of physics. Perhaps the most striking examples of the ‘conventionality’ of current quantum logic devices are NMR quantum microprocessors that are operated using technique s that have been reﬁned for almost half a century. Ion-trap and quantum electrodynamic quantum computers, though certainly cutting edge devices, operate in a quantum electr odynamic regime where the fundamental physics has been understood for decades (that i s not to say that new and unexpected physics does not arise frequently in this regime , rather that there is general agreement on how to model the dynamics of such devices). Make no mistake about it: a conventional quantum logic devic e is the best kind of quantum logic device to have around. It is exactly becausethe physics of nuclear magnetic resonance and quantum electrodynamics are well understood that devices based on this physics can be used systematically to construct and manipul ate the exotic quantum states that form the basis for quantum computation. With that recog nition, let us turn to 2\n‘unconventional’ quantum computers. Perhaps the most obvious basis for an unconventional quantu m computer is the use of particles with non-Boltzmann statistics in a reﬁme where these statistics play a key role in the dynamics of the device. For example, Lloyd [16] has pro posed the use of fermions as the fundamental carriers of quantum information, so that a site or state occupied by a fermion represents a 1 and an unoccupied site or state repres ents a 0. It is straightforward to design a universal quantum computer using a conditional h opping dynamics on an array of sites, in which a fermion hops from one site to another if on ly if other sites are occupied. If the array is one-dimensional, then such a fermionic quant um computer is equivalent to a conventional quantum computer via the well-known techn ique of bosonization. If the array is two or more dimensional, however, a local operation involving fermions on the lattice cannot be mocked up by a local operation on a conventi onal quantum computer, which must explicitly keep track of the phases induced by Fer mi statistics. As a result, such afermioniccomputer canperform certainoperationsmo rerapidlythanaconventional quantum computer. An obvious example of a problem that can be solved more rapidly on a fermionic quantum computer is the problem of simulating a l attice fermionic system in two or more dimensions. To get the antisymmetrization right in second quantized form, a conventional ‘Boltzmann’ quantum computer takes time pro portional to Tℓd−1whereT is the time over which the simulation is to take place, ℓis the length of the lattice and dis the dimension, while a fermionic quantum computer takes t ime proportional to T. (Here we assume that the computations for both conventional and Fermionic quantum computers can take advantage of the intrinsic parallelizab ility of such simulations: if the computations are performed serially an additional factro o fℓdis required for both types of computer to update each site sequentially.) As the lattice size ℓand the dimension dgrow large, the diﬀerence between the two types of computer also grows large. Indeed, the problem of si mulating fermions hopping on a hypercube of dimension dasd→ ∞is evidently exponentially harder on a con- ventional quantum computer than a Fermionic quantum comput er. Since a variety of diﬃcult problems such as the travelling-salesman problem a nd data-base search problem can be mapped to particles hopping on a hypercube, it is inter esting to speculate whether fermionic computers might provide an exponential speed-up on problems of interest in ad- dition to quantum simulation. No such problems are currentl y known, however. Fermionic computers could be realized in principle by manipulating th e ways in which electrons and 3\nholes hop from site to site on a semiconductor lattice (thoug h problems of decoherence are likely to be relatively severe for such systems). It might also be possible to construct bosonic computers usi ng photons, phonons, or atoms in a Bose-Einstein condensate. Such systems can be hig hly coherent and support nonlinear interactions: phonons and photons can interact i n a nonlinear fshion via their common nonlinear interaction with matter, and atoms in a Bos e condensate can be made to interact bia quantum electrodynamics (by introduction o f a cavity) or by collisions. So far, however, thefeature ofBosecondensates that makesthe m so interesting from thepoint of view of physics — all particles in the same state — makes the m less interesting from the point of view of quantum computation. Many particles in the s ame state, which can be manipulatedcoherentlybyavarietyoftechniques, explore thesamevolumeofHilbertspace as a single particle in that state. As a result, it is unclear h ow such a bosonic system could provide a speed-up over conventional quantum computation. More promising than Bose condensates from the perspective of quantum computation an d quantum communications, is the use of cavity quantum electrodynamics to ‘dial up’ or s ynthesize arbitrary states of the cavity ﬁeld. Such a use of bosonic states is important f or the ﬁeld of quantum communications, which requires the ability to create and ma nipulate entangled states of the electromagnetic ﬁeld. A third unconventional design for a quantum computer relies on ‘exotic’ statistics that are neither fermionic nor bosonic. Kitaev has recently proposed a quantum computer architecture based on ‘anyons,’ particles that when exchan ged acquuire an arbitrary phase. Examples of anyons include two-dimensional topological de fects in lattice systems of spins with various symmetries. Kitaev noted that such anyons coul d perform quantum logic via Aharonov-Bohm type interactions [19]. Preskill et al.have shown explicitly how anyonic systems could compute in principle [20], and Lloyd et al.have proposed methods of realizing anyons using superconducting circuits (they cou ld also in principle be constructed using NMR quantum computers to mock up the anyonic dynamics i n an eﬀectively two- dimensional space of spins) [21]. The advantage of using any ons for quantum computation is that their nonlocal topological nature can make them intr insically error-correcting and virtually immune to the eﬀects of noise and interference. As the technologies of the microscale become better develop ed, more and more po- tential designs for quantum computers, both conventional a nd unconventional, are likely to arise. Additional technologies that could prove useful f or the construction of quantum 4\nlogic devices include photonic crystals, optical hole-bur ning techniques, electron spin res- onance, quantum dots, superconducting circuits in the quan tum regime, etc. Since every quantum degree of freedom can in principle participate in a c omputation one cannot a priorirule out the possibility of using currently hard to control d egrees of freedom such as quark and gluon in complex nuclei to process information. Ne edless to say, most if not all of the designs inspired by these technologies are likely to f ail. There is room for optimism that some such quantum computer designs will prove practica ble, however. The preceding unconventional designs for quantum computer s were based on existing, experimentally conﬁrmed physical phenomena (except in the case of non-abelian anyons). Let usnowturntodesigns basedonspeculative, hypothetica l, andnotyetveriﬁed phenom- ena. (One of the most interesting of these phenomena is large -scale quantum computation itself: can we create and systematically transform entangl ed states involving hundreds or thousands of quantum variables?) A particularly powerful h ypothesis from the point of view of quantum computation is that of nonlinear quantum mec hanics. The conventional picture of quantum mechanics isthat itis l inear in the sense that the superposition principle is obeyed exactly. (Of course, qua ntum systems can still exhibit nonlinear interactions between degrees of freedom while co ntinuing to obey the superpo- sition principle.) Experiment conﬁrms that the superposit ion principle is indeed obeyed to a high degree of accuracy. Nonetheless, a number of scient ists including Weinberg have proposed nonlinear versions of quantum mechanics in which t he superposition principle is violated. Many of these proposals exhibit pathologies su ch as violations of the second law of thermodynamics or the capacity for superluminal comm unication. Despite such theoretical diﬃculties, it is still possible that quantum m echanics does indeed possess a small nonlinearity, even if it currently seems unlikely. If a nonlinear operation such as that proposed by Weinberg can be incorporated in a quantum lo gic operation, then the consequences are striking: NP-complete problems can be sol ved easily in polynomial time [17]. Indeed, NP-oracle problems and all problems in # Pcan be solved in polynomial time on such a nonlinear quantum computer. A general proof of this result is given in [17], however, a sim ple argument for why this is so can be seen as follows. Suppose that it is possible t o perform a non-unitary operation on a single qubit that has a positive Lyapunov expo nent over some region: i.e., somewhere on the unit sphere there exists a line of ﬁnite exte nt along which application of the operation causes nearby points to move apart exponentia lly at a rate eλ∆θproportional 5\nto their original angular separation δθ. Now consider a function f(x) fromNbits to one bit. We wish to determine whether or not there exists an xsuch that f(x) = 1, and if so, how many such x’s there are. Using the nonlinear operation with positive Ly apunov exponent, it is straightforward to construct a mapping leav es a point on the exponentially expanding line (call this point |0/angbracketright) ﬁxed if their are no solutions to the equation f(x) = 1, and that maps the point to a nearby point cos( n/2N)|0/angbracketright+ sin(n/2N)|1/angbracketrightalong the line if there are exactly nsolutions to the equation f(x) = 1. Repeated application of the nonlinear map can be used to drive the points apart at an expon entional rate: eventually, at a time determined by the number of qubits N, the number of solutions n, and the rate of spreading λ, the two points will become macroscopically distinguishab le, allowing one to determine whether or not there is a solution and if there is , how many solutions there are. The map fneed only be applied once, and the amount of time it takes to re veal the number of solutions is proportional to N. The fact that nonlinear quantum mechanics allows the straig htforward solution of NP-complete and # Pproblems should probably be regarded as yet another strike a gainst nonlinear quantum mechanics. Whether or not quantum mechan ics is linear is a question to be resolved experimentally, however. In the unlikely eve nt that quantum mechanics does turn out to be nonlinear, all our problems may be solved. Finally, let us turn our attention to hypothetical quantum T heories of Everything, such as string theory. Such a theory must clearly support qua ntum computation since it supports cavity quantum electrodynamics and nuclear magne tic resonance. The obvious question to ask is then, does a Theory of Everything need to su pport anything morethan quantum computation? So far as experimental evidence is con cerned the answer to this question is apparently No: we have no evident reason to doubt that the universe is at bottom anything more than a giant, parallel, quantum inform ation processing machine, and that the phenomena that we observe and attempt to charact erize are simply outputs of this machine’s ongoing computation. Of course, just how t he universe is carrying out this computation is likely to remain a question of great inte rest for some time. To summarize: Computers are physical systems, and what they can do in practice and in principle is circumscribed by the laws of physics. The law s of physics in turn permit a wide variety of quantum computational devices including so me based on nonconventional statisticsandexoticeﬀects. Modiﬁcationsmadetothelaws ofphysicshavetheconsequence that what can be computed in practice and in principle change s. A particularly intriguing 6\nvariation on conventional physics is nonlinear quantum mec hanics which, if true, would allow hard problems to be solved easily. 7\nReferences 1. P. Benioﬀ, ‘Quantum Mechanical Models of Turing Machines that Dissipate No Energy,’ Physical Review Letters , Vol.48, No. 23, pp. 1581-1585 (1982) 2. D.Deutsch, ‘Quantum Theory, theChurch-Turing Principl eandtheUniversalQuantum Computer,’ Proceedings of the Royal Society of London, A , Vol.400, pp. 97-117 (1985). 3. R.P. Feynman, ‘Quantum Mechanical Computers,’ Optics News , Vol.11, pp. 11-20 (1985); also in Foundations of Physics , Vol.16, pp. 507-531 (1986). 4. S. Lloyd, ‘A Potentially Realizable Quantum Computer,’ Science, Vol.261, pp. 1569- 1571 (1993). 5. J.I. Cirac and P. Zoller, ‘Quantum Computations with Cold Trapped Ions,’ Physical Review Letters , Vol.74, pp. 4091-4094 (1995). 6. Q.A. Turchette, C.J. Hood, W. Lange, H. Mabuchi, H.J. Kimb le, ‘Measurement of Conditional Phase Shifts for Quantum Logic,’ Physical Review Letters , Vol.75, pp. 4710- 4713 (1995). 7. C. Monroe, D.M. Meekhof, B.E. King, W.M. Itano, D.J. Winel and, ‘Demonstration of a Fundamental Quantum Logic Gate,’ Physical Review Letters , Vol.75, pp. 4714-4717 (1995). 8. D.G. Cory, A.F. Fahmy, T.F. Havel, ‘Nuclear Magnetic Reso nance Spectroscopy: an experimentally accessible paradigm for quantum computing ,’ inPhysComp96 , Proceedings of the Fourth Workshop on Physics and Computation, T. Toﬀoli , M. Biafore, J. Le˜ ao, eds., New England Complex Systems Institute, 1996, pp. 87-91. 9. N.A. Gershenfeld and I.L. Chuang, ‘Bulk Spin-Resonance Q uantum Computation,’ Science, Vol.275, pp. 350-356 (1997). 10. P. Shor, ‘Algorithms for Quantum Computation: Discrete Log and Factoring,’ in Proceedings of the 35th Annual Symposium on Foundations of C omputer Science , S. Gold- wasser, Ed., IEEE Computer Society, Los Alamitos, CA, 1994, pp. 124-134. 11. R.P. Feynman, ‘Simulating Physics with Computers,’ International Journal of Theo- retical Physics , Vol.21, pp. 467-488 (1982). 12. S. Lloyd, ‘Universal Quantum Simulators,’ Science, Vol.273, pp. 1073-1078 (1996). 13. L.K. Grover, ‘Quantum Mechanics Helps in Searching for a Needle in a Haystack,’ Physical Review Letters , Vol.79, pp. 325-328 (1997). 14. D. Deutsch, A. Barenco, A. Ekert, ‘Universality in Quant um Computation,’ Proceed- ings of the Royal Society of London A , Vol.449, pp. 669-677 (1995). 8\n15. S. Lloyd, ‘Almost Any Quantum Logic Gate is Universal,’ Physical Review Letters , Vol.75, pp. 346-349 (1995). 16. S. Lloyd, ‘Fermionic Quantum Computers,’ talk delivere d at the Santa Barbara work- shop on Physics of Information, November 1996. 17. D. Abrams and S. Lloyd, to be published. 18. J. Preskill et al., to be published. 19. Yu. Kitaev, to be published. 20. J. Preskill et al., to be published. 21. S. Lloyd et al.to be published. 9\n",
  "metadata": {
    "paper_id": "quant-ph/0003151v1",
    "downloaded_at": "2025-08-24T23:15:15.679935+00:00"
  },
  "processed_at": "2025-08-24T23:15:15.679955+00:00"
}